<p>El conducto de est&aacute;ticos (<strong>N. del T:</strong> <em>asset pipeline</em> en ingl&eacute;s) es una de las funcionalidades m&aacute;s importantes de Rails 3.1, pero tambi&eacute;n es de las m&aacute;s confusas.  En este episodio vamos a tratar de aclarar c&oacute;mo se usa para gestionar los est&aacute;ticos de nuestras aplicaciones Rails.  Los que no est&eacute;n familiarizados con esto pueden empezar por la <a href="http://guides.rubyonrails.org/asset_pipeline.html">Gu&iacute;a Rails sobre el conducto de est&aacute;ticos</a> porque cubre muchas de sus funcionalidades.</em>

<p>Los que ya hayan escrito una aplicaci&oacute;n Rails 3.1 sabr&aacute;n que si visitamos  <code><a href="http://localhost:3000/assets/application.js">http://localhost:3000/assets/application.js</a></code> veremos un archivo con todo el JavaScript que utiliza nuestra aplicaci&oacute;n.  Pero, &iquest;c&oacute;mo funciona esto?</p>

<p>El fichero <code>application.js</code> no tiene nada de especial; de hecho cualquier fichero que se ponga en el directorio <code>/app/assets/javascripts</code> ser&aacute; accesible igualmente.  Por ejemplo si en dicho directorio creamos un fichero llamado <code>greeting.txt</code> podemos verlo con el navegador cargando la URL  <a href="http://localhost:3000/assets/greeting.txt"><code>http://localhost:3000/assets/greeting.txt</code></a>. N&oacute;tese que aunque el fichero se encuentra en el directorio  <code>/app/assets/javascripts</code> la URL que usamos para acceder a &eacute;l es <code>/assets/greeting.txt</code>.  Esto se aplica para cualquier subdirectorio de <code>/app/assets</code> en el que pongamos el archivo, podemos incluso crear un nuevo directorio y ponerlo ah&iacute;, que el fichero seguir&aacute; estando accesible en la misma URL (aunque si hacemos esto tendremos que reiniciar el servidor).</p>

<p>El directorio <code>/app/assets</code> no es el &uacute;nico sitio donde podemos a&ntilde;adir este tipo de est&aacute;ticos.  Si creamos un directorio en <code>/lib/assets</code> cualquier fichero que pongamos ah&iacute; podr&aacute; ser accedido igual que si hubiese sido puesto en <code>/app/assets</code>, y lo mismo para todos los ficheros que cuelguen de <code>/vendor/assets</code>.</p>

<p>Si tenemos archivos est&aacute;ticos que no son realmente espec&iacute;ficos de la aplicaci&oacute;n nos puede venir bien ponerlos o bien en <code>/lib</code> o en <code>/vendor</code>.  Por ejemplo si usamos un <em>plugin</em> de jQuery el directorio <code>/vendor/assets</code> es un buen sitio para poner los ficheros JavaScript porque es otra persona quien los mantiene.  Igualmente podemos poner en <code>/lib</code> aquellos est&aacute;ticos que mantenemos nosotros pero que no son espec&iacute;ficos de la aplicaci&oacute;n.</p>

<p>Simplificando, el conducto de est&aacute;ticos no es m&aacute;s que una lista de rutas de carga.  Podemos ver dicho listado consultado en la consola <code>Rails.application.config.assets.paths</code>:</p>

<pre class="terminal">&gt; y Rails.application.config.assets.paths
--- 
- /Users/eifion/store/app/assets/images
- /Users/eifion/store/app/assets/javascripts
- /Users/eifion/store/app/assets/stylesheets
- /Users/eifion/store/lib/assets/greeting.txt
- /Users/eifion/store/vendor/assets/stylesheets
- /Users/eifion/.rvm/gems/ruby-1.9.2-p180@railspre/gems/jquery-rails-1.0.13/vendor/assets/javascripts</pre>

<p>La salida muestra todos los directorios debajo de <code>app/assets</code>, de <code>/lib/assets</code> y de <code>/vendor/assets</code>.  Al final aparece un directorio interesante que viene de la gema  <code>jquery-rails</code> que hemos incluido en nuestra aplicaci&oacute;n.  Podemos ver sus contenidos con la orden <code>bundle open</code>.</p>

<pre class="terminal">$ bundle open jquery-rails</pre>

<p>Con esto abriremos la gema con el editor de texto definido por las variables de entorno <code>BUNDLE_EDITOR</code> o <code>EDITOR</code>.  Si examinamos los ficheros de la gema veremos un directorio llamado <code>vendor/asset/javascripts</code> y que contiene varios ficheros de jQuery que podemos cargar a trav&eacute;s del conducto de est&aacute;ticos.</p>

<div class="imageWrapper">
  <img src="/system/photos/723/original/E279I01.png" width="801" height="377" alt="Ficheros y estructura de carpetas de la gema jquery-rails."/>
</div>

<p>Tal y como es de esperar, podemos acceder a cualquiera de estos archivos en la ruta <code>assets</code> en el navegador, porque todos estos directorios se encuentran en la ruta de carga del conducto de est&aacute;ticos.</p>

<div class="imageWrapper">
  <img src="/system/photos/724/original/E279I02.png" width="801" height="437" alt="El fichero jquery.js file est치 accesible en la URL /assets."/>
</div>

<p>Lo m&aacute;s interesante de esto es que las gemas de Ruby ya no sirven s&oacute;lo para gestionar c&oacute;digo Ruby, tambi&eacute;n podemos usarlas para gestionar JavaScript y otro est&aacute;ticos.  Probablemente veamos en un futuro m&aacute;s librer&iacute;as de JavaScript distribuidas como gemas de Ruby de forma que puedan aprovecharse de la gesti&oacute;n de dependencias de Bundler.</p>

<h3>Gesti&oacute;n de est&aacute;ticos con Sprockets</h3>

<p>Volvamos al fichero <code>application.js</code> de nuestra aplicaci&oacute;n, y ech&eacute;mosle un vistazo.</p>

<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">// This is a manifest file that&#x27;ll be compiled into including all the files listed below.
// Add new JavaScript/Coffee code in separate files in this directory and they&#x27;ll automatically
// be included in the compiled file accessible from http://example.com/assets/application.js
// It&#x27;s not advisable to add code directly here, but if you do, it&#x27;ll appear at the bottom of the
// the compiled file.
//
//= require jquery
//= require jquery_ujs
//= require_tree .</pre>

<p>El fichero s&oacute;lo contiene comentarios, pero son importantes.  Este tipo de archivo se conoce como <em>manifiesto</em> y lo gestiona  <a href="http://getsprockets.org/">Sprockets</a> internamente.  Cuando llega una petici&oacute;n para este archivo, Sprockets mira el manifiesto y recopila todos los ficheros mencionados y pone sus contenidos antes del c&oacute;digo que aparezca en este archivo.</p>

<p>Aqu&iacute; tambi&eacute;n funcionan las rutas de carga.  En este fichero tenemos <code>require jquery</code> (la extensi&oacute;n <code>.js</code> es opcional).  Sprockets buscar&aacute; en los directorios mencionados en la ruta de carga en busca de este archivo y, en este caso, lo cargar&aacute; del directorio <code>vendor/asset/javascripts</code>de la gema.</p>

<p>Se puede poner aqu&iacute; cualquier fichero JavaScript que se encuentre en la ruta de carga.  As&iacute;, si a&ntilde;adimos <code>require jquery-ui</code> a este archivo, se incluir&aacute; el c&oacute;digo <code>jquery-ui</code> de la gema.  Esto tambi&eacute;n se aplica a los ficheros de CoffeeScript, si incluimos <code>require home</code> se analizar&aacute; e incluir&aacute; el fichero <code>/app/assets/javascripts/home.js</code>.</p>

<p>Sin embargo no hace falta incluir dicho fichero <code>home</code>  porque al final de este archivo tenemos <code>require_tree .</code>, y el punto aqu&iacute; quiere decir el directorio actual.  Todos los ficheros JavaScript o CoffeScript que haya en este directorio y sus hijos ser&aacute;n autom&aacute;ticamente incluidos.</p>

<p>Podemos excluir algunos archivos si queremos.  Supongamos que tenemos unas p&aacute;ginas de administraci&oacute;n y s&oacute;lo queremos incluir su JavaScript cuando estamos viendo una de estas p&aacute;gias.  Por defecto estos ficheros ser&iacute;an incluidos para todas las p&aacute;ginas de nuestro sitio.</p>

<p>Si queremos ver qu&eacute; ficheros se est&aacute;n incluyendo podemos a&ntilde;adir el par&aacute;metro <code>debug_assets=1</code> a la URL, con lo que impediremos que se combinen los archivos JavaScript y si vemos el c&oacute;digo fuente de la p&aacute;gina veremos todos los archivos que Sprockets habr&iacute;a incluido, y veremos que tambi&eacute;n aparecen los del directorio <code>admin</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/725/original/E279I03.png" width="789" height="322" alt="Los ficheros JavaScript no se combinan si a침adimos el par치metro debug_asssets en la URL."/>
</div>

<p>Esto lo podemos soslayar de un par de formas.  Por un lado podr&iacute;amos utilizar <code>require_directory</code> en lugar de <code>require_tree</code> y esto incorporar&iacute;a los ficheros del directorio actual, y no los del subdirectorio, y por otra parte si queremos tener m&aacute;s control podr&iacute;amos hacer <code>require</code> de forma separada en lugar de incluir todo el directorio.  Alternativamente podr&iacute;amos mover los ficheros JavaScript a un directorio <code>public</code> y luego usar <code>require_tree ./public</code> para incluir s&oacute;lo dichos archivos.</p>

<p>Cabe preguntarse qu&eacute; comandos hay disponibles en el manifiesto de Sprocket, por desgracia no hay una fuente definitiva de documentaci&oacute;n pero en el fichero  <a href="https://github.com/sstephenson/sprockets/blob/master/lib/sprockets/directive_processor.rb"><code>directive_processor.rb</code></a> existen comentarios que explican c&oacute;mo funciona, as&iacute; como las distintas &oacute;rdenes que se le pueden pasar.</p>

<h3>Preprocesado</h3>

<p>El conducto de est&aacute;ticos tambi&eacute;n puede preprocesar.  Para ver c&oacute;mo funciona esto crearemos un fichero llamado <code>greeting.txt</code> en el nuevo directorio <code>/app/assets/anything</code>.  Podemos a&ntilde;adir otra extensi&oacute;n al nombre de archivo y especificar un procesador, por ejemplo <code>.erb</code>.  Si ahora le a&ntilde;adimos c&oacute;digo ERB a este archivo se evaluar&aacute; correctamente.</p>


<p class="codeFilePath">/app/assets/anything/greeting.txt.erb</p>
<pre class="ruby">hello world &lt;%= 1 + 1 %&gt;</pre>

<p>Si cargamos el fichero en un navegador veremos que el c&oacute;digo ERB se ha ejecutado correctamente.  N&oacute;tese que no incluimos la URL no incluye la extensi&oacute;n del preprocesador.</p>


<div class="imageWrapper">
  <img src="/system/photos/726/original/E279I04.png" width="801" height="280" alt="Se preprocesa el c칩digo erb antes de enviar el fichero al navegador."/>
</div>

<p>As&iacute; es como b&aacute;sicamente funcionan SASS y CoffeeScript.  Cuando un fichero tiene la extensi&oacute;n <code>.sc</code> &eacute;sta indica que hay que preprocesarlo con SASS.  Podemos encadenar este tipo de extensi&oacute;n y crear un fichero con la extensi&oacute;n, por ejemplo <code>.scss.erb</code>, con lo que el fichero primero pasar&iacute;a por ERB y luego por SASS.</p>

<p>El preprocesador es muy configurable.  Podemos a&ntilde;adir nuestros propios procesador o intercambiar los ya existentes, todo esto se controla con la 
<a href="https://github.com/rtomayko/tilt/">gema Tilt</a>, en cuya documentaci&oacute;n se puede encontrar toda la informaci&oacute;n necesaria.</p>

<h3>Diferencias en modo de producci&oacute;n</h3>

<p>Con esto terminamos esta peque&ntilde;a gu&iacute;a sobre la funcionalidad del conducto de est&aacute;tico, pero hay algunas diferencias de funcionamiento en producci&oacute;.  Primero, arrancaremos el servidor en modo de producci&oacute;n.</p>

<pre class="terminal">$ rails s -e production</pre>

<p>Si visitamos la p&aacute;gina principal de nuestra aplicaci&oacute;n y vemos el c&oacute;digo fuente compobaremos que los est&aacute;ticos se sirven de forma diferente.</p>

<pre class="terminal">&lt;link href=&quot;/assets/application-412fe22651f4486c51e54176003a9f57.css&quot; media=&quot;screen&quot; rel=&quot;stylesheet&quot; type=&quot;text/css&quot; /&gt;
  &lt;script src=&quot;/assets/application-3e3a5167191afa70c7b72440eee7dd40.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;</pre>

<p>Por motivos de cach&eacute;, ahora los nombres de archivo aparecen con un gui&oacute;n.  Esto da  mejor resultado que el viejo m&eacute;todo que usa Rails 3.0 de a&ntilde;adir una cadena porque cambia realmente el nombre del archivo.  Tambi&eacute;n si vemos el contenido del fichero veremos que el JavaScript ha sido minimizado, lo que ahorra ancho de banda.</p>

<p>Estos est&aacute;ticos se cachean autom&aacute;ticamente y son servidos por el <em>middleware</em> Rack Cache, lo que es bastante r&aacute;pido.  Si queremos que sea el propio servidor web quien sirva estos est&aacute;ticos podemos precompilarlos lanzando</p>

<pre class="terminal">$ rake assets:precompile</pre>

<p>Con esto se precompilar&aacute;n los est&aacute;ticos en el directorio <code>/public</code> de forma que ser&aacute;n accesibles desde el servidor web.</p>

<p>Con esto concluimos este episodio sobre el conducto de est&aacute;ticos.  No olvideis visitar la <a href="http://ryanbigg.com/guides/asset_pipeline.html">Gu&iacute;a de Rails</a> que contiene m&aacute;s informaci&oacute;n.</p>
