<p>L&#x27;asset pipeline est une des plus importantes fonctionnalit&eacute;s de Rails&nbsp;3.1. Elle peut cependant &ecirc;tre difficile &agrave; appr&eacute;hender. Dans cet &eacute;pisode, nous allons tenter de la d&eacute;mystifier un peu en montrant comment elle g&egrave;re les ressources media (assets) de vos applications Rails. Si le sujet vous est totalement inconnu, un bon point de d&eacute;part est le <a href="http://ryanbigg.com/guides/asset_pipeline.html">Guide Rails sur l&#x27;asset pipeline</a> qui aborde bon nombre de ses fonctionnalit&eacute;s.</p>

<p>Si vous avez &eacute;crit une application Rails&nbsp;3.1, vous savez probablement qu&#x27;en visitant <code><a href="http://localhost:3000/assets/application.js">http://localhost:3000/assets/application.js</a></code>, vous allez obtenir un fichier contenant tous les fichiers JavaScript de votre application. Mais comment cela fonctionne-t-il&nbsp;?</p>

<p>Le fichier <code>application.js</code> n&#x27;a rien de particulier. Tout fichier plac&eacute; dans le dossier <code>/app/assets/javascripts</code> est tout autant accessible. Si, par exemple, nous cr&eacute;ons, dans ce dossier, un fichier nomm&eacute; <code>greeting.txt</code>, nous pouvons le voir dans le navigateur en visitant <a href="http://localhost:3000/assets/greeting.txt"><code>http://localhost:3000/assets/greeting.txt</code></a>. Bien que le fichier soit dans <code>/app/assets/javascripts</code>, l&#x27;URL par laquelle nous y acc&eacute;dons est <code>/assets/greeting.txt</code>. Cela s&#x27;applique, peu importe, dans quel sous dossier de <code>/app/assets</code> nous pla&ccedil;ons le fichier. Nous pouvons m&ecirc;me cr&eacute;er un nouveau dossier et y placer le fichier, il sera toujours accessible &agrave; la m&ecirc;me URL. Si nous cr&eacute;ons effectivement un nouveau dossier, nous devrons tout de m&ecirc;me relancer le serveur avant que les fichiers que l&#x27;on y place soient accessibles.</p>

<p>Le dossier <code>/app/assets</code> n&#x27;est pas le seul dans lequel nous pouvons ajouter des assets. Si nous cr&eacute;ons un dossier <code>assets</code> dans <code>/lib</code>, tout fichier plac&eacute; dans celui-ci sera accessible comme s&#x27;il &eacute;tait mis dans le dossier <code>/app/assets</code>. Cela s&#x27;applique &eacute;galement &agrave; tout fichier plac&eacute; dans le dossier <code>/vendor/assets</code>.</p>

<p>Si vous avez des assets qui ne sont pas vraiment sp&eacute;cifiques &agrave; l&#x27;application courante, les dossiers <code>assets</code> situ&eacute;s dans <code>/lib</code> ou <code>/vendor</code> sont leur destination id&eacute;ale. Si l&#x27;application utilise un plugin jQuery, le dossier <code>/vendor/assets</code> est l&#x27;endroit o&ugrave; placer ses fichiers JavaScript puisqu&#x27;ils sont maintenus par quelqu&#x27;un d&#x27;autre. Pour les assets maintenus par nos soins mais qui ne sont pas sp&eacute;cifiques &agrave; l&#x27;application, le choix se portera plut&ocirc;t sur le dossier <code>/lib</code>.</p>

<p>Dans sa forme la plus basique, l&#x27;asset pipeline est une liste de chemins de chargement (loadpaths). Nous pouvons voir cette liste en lan&ccedil;ant la console Rails et en inspectant <code>Rails.application.config.assets.paths</code>. Nous afficherons le r&eacute;sultat en YAML pour plus de lisibilit&eacute;.</p>

<pre class="terminal">&gt; y Rails.application.config.assets.paths
--- 
- /Users/eifion/store/app/assets/images
- /Users/eifion/store/app/assets/javascripts
- /Users/eifion/store/app/assets/stylesheets
- /Users/eifion/store/lib/assets/greeting.txt
- /Users/eifion/store/vendor/assets/stylesheets
- /Users/eifion/.rvm/gems/ruby-1.9.2-p180@railspre/gems/jquery-rails-1.0.13/vendor/assets/javascripts</pre>

<p>Le r&eacute;sultat est une liste de tous les dossiers contenus dans <code>/app/assets</code> ainsi que ceux pr&eacute;sents dans <code>/lib/assets</code> et <code>/vendor/assets</code>. On trouve toutefois un dossier int&eacute;ressant &agrave; la fin de la liste. Celui-ci provient de la gem <code>jquery-rails</code>, incluse dans notre application. Nous pouvons voir son contenu gr&acirc;ce &agrave; la commande <code>bundle open</code>.</p>

<pre class="terminal">$ bundle open jquery-rails</pre>

<p>Cela ouvre la gem avec l&#x27;&eacute;diteur d&eacute;finit dans les variables d&#x27;environnement <code>BUNDLER_EDITOR</code> ou <code>EDITOR</code>. Si nous jetons un &oelig;il aux fichiers de la gem, nous allons voir un dossier <code>vendor/asset/javascripts</code> contenant un certain nombre de fichiers jQuery que nous pouvons charger via l&#x27;asset pipeline.</p>

<div class="imageWrapper">
  <img src="/system/photos/723/original/E279I01.png" width="801" height="377" alt="La structure des fichiers et dossiers de la gem jquery-rails."/>
</div>

<p>Comme vous pouvez vous y attendre, nous pouvons acc&eacute;der &agrave; chacun de ces fichiers, via le navigateur, sous le chemin <code>assets</code> puisque le dossier les contenant est list&eacute; dans le loadpath de l&#x27;asset pipeline.</p>

<div class="imageWrapper">
  <img src="/system/photos/724/original/E279I02.png" width="801" height="437" alt="Le fichier jquery.js est accessible dans le dossier assets."/>
</div>

<p>Ce qu&#x27;il est int&eacute;ressant de noter, c&#x27;est que cela signifie que les gems Ruby n&#x27;ont plus pour unique but de g&eacute;rer du code Ruby. Nous pouvons les utiliser pour g&eacute;rer des fichiers JavaScript ou tout autre type d&#x27;asset. Il est &agrave; pari&eacute; que nous verrons, sous peu, de nombreuses librairies JavaScript distribu&eacute;es sous forme de gems Ruby, nous pourrons alors profiter des avantages de Bundler et de sa gestion des d&eacute;pendances.</p>

<h3>G&eacute;rer les Assets avec Sprockets</h3>

<p>Retournons au fichier <code>application.js</code> de notre application et jetons-y un &oelig;il.</p>

<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">// This is a manifest file that&#x27;ll be compiled into including all the files listed below.
// Add new JavaScript/Coffee code in separate files in this directory and they&#x27;ll automatically
// be included in the compiled file accessible from http://example.com/assets/application.js
// It&#x27;s not advisable to add code directly here, but if you do, it&#x27;ll appear at the bottom of the
// the compiled file.
//
//= require jquery
//= require jquery_ujs
//= require_tree .</pre>

<p>Le fichier contient uniquement des commentaires mais certains ont une signification. Ce type de fichier est un manifest et est g&eacute;r&eacute; par <a href="http://getsprockets.org/">Sprockets</a>. Lorsqu&#x27;une requ&ecirc;te pour ce fichier arrive, Sprockets lit le manifest et compile tous les fichiers mentionn&eacute;s dans celui-ci puis inclut leur contenu avant le code du manifest.</p>

<p>Le loadpath fonctionne &eacute;galement ici. Nous trouvons une ligne <code>require jquery</code> dans ce fichier (l&#x27;extension <code>.js</code> est facultative). Sprockets va chercher ce fichier dans le loadpath et, dans le cas de jquery, le charger depuis le dossier <code>vendor/asset/javascripts</code> de l&#x27;engine <code>jquery-rails</code>.</p>

<p>Nous pouvons ajouter n&#x27;importe quel fichier JavaScript se trouvant dans le loadpath. Si nous ajoutons <code>require jquery-ui</code> au manifest, le fichier <code>jquery-ui.js</code> sera inclus. Cela s&#x27;applique &eacute;galement aux fichiers CoffeeScript. Si nous ajoutons <code>require home</code>, le fichier <code>/app/assets/javascripts/home.js.coffee</code> va &ecirc;tre analys&eacute; et inclus.</p>

<p>Inclure ce fichier <code>home</code> n&#x27;est pas n&eacute;cessaire car, en bas du fichier, on trouve <code>require_tree .</code>. Le point repr&eacute;sente ici le dossier courant. Cela signifie que tout fichier JavaScript ou CoffeeScript pr&eacute;sent dans ce dossier et ses sous dossiers sera inclus.</p>

<p>Si nous voulons exclure certains fichiers de l&#x27;arborescence, nous le pouvons. Disons que nous avons des pages d&#x27;administration sur notre site et que certains fichiers JavaScript doivent &ecirc;tre inclus uniquement sur ces pages. Par d&eacute;faut, ces fichiers vont &ecirc;tre inclus sur toutes les pages du site.</p>

<p>Si nous voulons voir les fichiers inclus, nous pouvons ajouter un param&egrave;tre <code>debug_assets=1</code> &agrave; l&#x27;URL. Cela va stopper l&#x27;agr&eacute;gation des fichiers JavaScript et, lorsque nous consultons le code source de la page, nous allons voir tous les fichiers que Sprockets inclurait, y compris les fichiers du dossier admin.</p>

<div class="imageWrapper">
  <img src="/system/photos/725/original/E279I03.png" width="789" height="322" alt="Les fichiers JavaScript ne sont pas agr&eacute;g&eacute;s si nous ajoutons le param&egrave;tre debug_assets &agrave; la query string."/>
</div>

<p>Il existe deux fa&ccedil;ons de r&eacute;soudre ce probl&egrave;me. Nous pourrions utiliser <code>require_directory</code> au lieu de <code>require_tree</code>. Cela permettrait de charger uniquement les fichiers du dossier courant et non ceux de ses sous dossiers. Si nous voulions plus de contr&ocirc;le sur les fichiers inclus, nous pourrions faire appel &agrave; <code>require</code> sur chaque fichier plut&ocirc;t que sur le dossier. Nous pourrions &eacute;galement d&eacute;placer les fichiers JavaScript que nous souhaitons inclure sur toutes les pages dans un sous dossier <code>public</code> et utiliser <code>require_tree ./public</code> pour inclure uniquement ces fichiers.</p>

<p>Si vous vous demandez quelles commandes peuvent &ecirc;tre utilis&eacute;es dans un manifest Sprockets, il n&#x27;existe pas encore de bonne documentation mais, dans le code source du fichier <code><a href="https://github.com/sstephenson/sprockets/blob/master/lib/sprockets/directive_processor.rb">directive_processor.rb</a></code>, on peut trouver des commentaires expliquant comment tout cela fonctionne et quelles sont les commandes utilisables.</p>

<h3>Pr&eacute;traitement</h3>

<p>L&#x27;asset pipeline permet &eacute;galement de faire du pr&eacute;traitement. Pour montrer comment cela fonctionne, nous allons cr&eacute;er un fichier nomm&eacute; <code>greeting.txt</code> dans un nouveau dossier <code>/app/assets/anything</code>. Tel quel, c&#x27;est simplement un fichier texte statique mais, nous pouvons ajouter une autre extension au nom de fichier et sp&eacute;cifier un processeur, par exemple <code>.erb</code>. Nous pouvons maintenant ajouter du code ERB dans ce fichier et il sera trait&eacute;.</p>

<p class="codeFilePath">/app/assets/anything/greeting.txt.erb</p>
<pre class="ruby">hello world &lt;%= 1 + 1 %&gt;</pre>

<p>Si nous regardons ce fichier dans un navigateur, nous allons voir que le code ERB a &eacute;t&eacute; ex&eacute;cut&eacute;. Notez que nous n&#x27;incluons pas l&#x27;extension du pr&eacute;processeur dans l&#x27;URL.</p>

<div class="imageWrapper">
  <img src="/system/photos/726/original/E279I04.png" width="801" height="280" alt="Le code erb est trait&eacute; avant que le fichier soit envoy&eacute; au navigateur."/>
</div>

<p>C&#x27;est essentiellement la mani&egrave;re de fonctionner de SASS et CoffeeScript. Lorsqu&#x27;un fichier a une extension <code>.scss</code>, elle est trait&eacute;e comme une extension de pr&eacute;processeur et le fichier passera par le processeur SASS. Nous pouvons m&ecirc;me cha&icirc;ner les extensions et cr&eacute;er un fichier avec, par exemple, une extension <code>.scss.erb</code>. Ce fichier passerait d&#x27;abord par le processeur ERB puis par le processeur SASS.</p>

<p>Le pr&eacute;traitement est tr&egrave;s configurable. Nous pouvons ajouter notre propre processeur ou &eacute;changer ceux existants. Tout est g&eacute;r&eacute; par la gem <a href="https://github.com/rtomayko/tilt/">Tilt</a>.</p>

<h3>Les diff&eacute;rences en mode Production</h3>

<p>C&#x27;est tout pour notre tour rapide de l&#x27;asset pipeline. Il existe quelques diff&eacute;rences sur son fonctionnement en production et nous allons terminer cet &eacute;pisode en les abordant. Tout d&#x27;abord, nous allons lancer notre serveur en mode production.</p>

<pre class="terminal">$ rails s -e production</pre>

<p>Si nous visitons la page d&#x27;accueil de notre application et regardons son code source, nous allons voir que nos assets sont d&eacute;livr&eacute;s diff&eacute;remment.</p>

<pre class="terminal">&lt;link href=&quot;/assets/application-412fe22651f4486c51e54176003a9f57.css&quot; media=&quot;screen&quot; rel=&quot;stylesheet&quot; type=&quot;text/css&quot; /&gt;
  &lt;script src=&quot;/assets/application-3e3a5167191afa70c7b72440eee7dd40.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;</pre>

<p>Les noms de fichiers incluent un hash pr&eacute;vu pour le cache. Cela fonctionne bien mieux que l&#x27;ancienne m&eacute;thode, bas&eacute;e sur la query string et utilis&eacute;e par Rails&nbsp;3.0, car le nom des fichiers est modifi&eacute;. Si nous regardons le contenu des fichiers, nous pouvons voir qu&#x27;il sont minifi&eacute;s pour &eacute;conomiser de la bande passante.</p>

<p>Ces assets sont automatiquement mis en cache et servis par le middleware Rack Cache pour plus de rapidit&eacute;. Si nous voulons que le serveur web se charge lui-m&ecirc;me de servir et h&eacute;berger ces assets, nous pouvons les pr&eacute;compiler en lan&ccedil;ant</p>

<pre class="terminal">$ rake assets:precompile</pre>

<p>Cela va pr&eacute;compiler les assets dans le dossier <code>/public</code> pour les rendre facilement accessibles par le serveur web.</p>

<p>C&#x27;est tout pour cet &eacute;pisode sur l&#x27;asset pipeline. N&#x27;oubliez pas de regarder le <a href="http://ryanbigg.com/guides/asset_pipeline.html">Guide Rails</a> pour plus d&#x27;informations.</p>
