<p>Ya ha sido publicada la primera versi&oacute;n Beta de Rails 3.1 y dedicaremos los pr&oacute;ximos episodios a repasar las novedades que trae.  Esta vez empezaremos mostrando su proceso de instalaci&oacute;n y dando un repaso general a su funcionalidad.</p>

<h3>Instalaci&oacute;n de Rails 3.1</h3>

<p>Antes de instalar la gema beta de Rails 3.1 utilizaremos rvm para crear un <em>gemset</em> que nos sirva para aislar esta instalaci&oacute;n del resto de nuestro entorno y as&iacute; poder utilizar la versi&oacute;n beta sin que afecte a nuestra instalaci&oacute;n de Rails 3.0.   Podemos crear un nuevo juego de gemas llamado <code>railspre</code> lanzando esta orden:</p>

<pre class="terminal">$ rvm 1.9.2@railspre --create</pre>

<p>Con esto ya podemos instalar la versi&oacute;n beta en este juego de gemas utilizando</p>

<pre class="terminal">$ gem install rails --pre</pre>

<p>Esto instalar&aacute; varias gemas, una vez que se haya completado dicha instalaci&oacute;n podemos comprobar nuestra versi&oacute;n de Rails para asegurarnos de que todo ha quedado bien instalado:</p>

<pre class="terminal">$ rails -v
Rails 3.1.0.beta1</pre>

<p>Con la beta ya instalada podemos pasar a crear nuestra primera aplicaci&oacute;n Rails 3.1.</p>

<pre class="terminal">$ rails new todo</pre>

<p>Por defecto Rails 3.1 utiliza jQuery como librer&iacute;a JavaScript.  Para crear una nueva aplicaci&oacute;n que utilice Prototype podemos utilizar la opci&oacute;n <code>--j</code>.</p>

<pre class="terminal">$ rails new todo -j prototype</pre>

<p>Antes de inspeccionar el contenido de la nueva aplicaci&oacute;n cambiaremos al directorio de la aplicaci&oacute;n con <code>cd</code> y ejecutaremos la orden <code>bundle</code> para instalar las gemas necesarias para  la aplicaci&oacute;n tras lo cual podemos estudiar su estructura.</p>

<p>Este es el aspecto de la estructura de directorios en TextMate (estamos utilizando el <em>plugin</em> <a href="https://github.com/jezdez/textmate-missingdrawer">MissingDrawer</a> para mostrar la estructura de carpetas en una barra lateral en lugar del caj&oacute;n por defecto)</p>

<div class="imageWrapper">
  <img src="/system/photos/657/original/E265I01.png" width="796" height="392" alt="Textmate mostrando La estructura de directorios de una aplicación Rails 3.1."/>
</div>

<p>Primero empezaremos viendo el <code>Gemfile</code>. Aqu&iacute; est&aacute;:</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">source &#x27;http://rubygems.org&#x27;

gem &#x27;rails&#x27;, &#x27;3.1.0.beta1&#x27;

# Bundle edge Rails instead:
# gem &#x27;rails&#x27;,     :git =&gt; &#x27;git://github.com/rails/rails.git&#x27;

gem &#x27;sqlite3&#x27;

# Asset template engines
gem &#x27;sass&#x27;
gem &#x27;coffee-script&#x27;
gem &#x27;uglifier&#x27;

gem &#x27;jquery-rails&#x27;

# Use unicorn as the web server
# gem &#x27;unicorn&#x27;

# Deploy with Capistrano
# gem &#x27;capistrano&#x27;

# To use debugger
# gem &#x27;ruby-debug19&#x27;, :require =&gt; &#x27;ruby-debug&#x27;

group :test do
  # Pretty printed test output
  gem &#x27;turn&#x27;, :require =&gt; false
end</pre>

<p>No hay ninguna sorpresa en las primeras l&iacute;neas del archivo, pero m&aacute;s adelante llegamos a la secci&oacute;n marcada  &ldquo;Asset template engines&rdquo;.  Ahora Rails incluye por defecto <a href="http://sass-lang.com/">SASS</a> y <a href="http://jashkenas.github.com/coffee-script/">CoffeeScript</a>, que ser&aacute;n objeto de estudio en futuras entregas.  Esta secci&oacute;n contiene una gema llamada  <a href="https://github.com/lautis/uglifier">Uglifier</a> que minimiza el c&oacute;digo JavaScript de la aplicaci&oacute;n en producci&oacute;n y la gema jquery-rails.  Si us&aacute;semos Prototype la gema que aparecer&iacute;a aqu&iacute; ser&iacute;a prototype-rails.</p>

<p>Al final del archivo aparece una referencia a la gema <a href="http://rubygems.org/gems/turn">turn</a> que hace que la salida de los tests quede m&aacute;s bonita.</p>

<h3>Cambios en las plantillas</h3>

<p>El mayor cambio que ha ocurrido en este apartado es c&oacute;mo los motores de plantillas gestionan los recursos est&aacute;ticos.  Si abrimos el directorio <code>/public</code> de la aplicaci&oacute;n veremos que ya no incluye los directorios <code>javascripts</code> o <code>stylesheets</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/658/original/E265I02.png" width="803" height="507" alt="Los directorios javascripts y stylesheets ya no aparecen bajo el directorio public."/>
</div>

<p>Si estos directorios han desaparecido, entonces &iquest;d&oacute;nde debemos poner nuestro c&oacute;digo JavaScript y CSS?  La respuesta es que ahora van en el nuevo directorio <code>/app/assets</code>.  Si abrimos el directorio <code>javascripts</code> veremos un fichero <code>application.js</code> pero si lo examinamos veremos que nos dice que aqu&iacute; no es donde deber&iacute;amos poner el c&oacute;digo JavaScript de la aplicaci&oacute;n.</p>

<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">// FIXME: Tell people that this is a manifest file, real code should go into discrete files
// FIXME: Tell people how Sprockets and CoffeeScript works
//
//= require jquery
//= require jquery_ujs
//= require_tree .</pre>

<p>(<em>N del T:</em> El texto dice &quot;FIXME Contar que este fichero es un mero manifiesto, el c&oacute;digo real deber&iacute;a ir en ficheros concretos.  FIXME Contar c&oacute;mo funciona Sprockets y CoffeScript&quot;)</p>

<p>Este fichero est&aacute; dise&ntilde;ado para servir como manifiesto.  La idea es que en lugar de escribir c&oacute;digo JavaScript aqu&iacute; deber&iacute;amos ponerlo en ficheros dentro del mismo directorio.  Para hacernos una idea de c&oacute;mo funciona esto, generaremos un andamiaje en nuestra aplicaci&oacute;n para un <code>Project</code>.</p>


<pre class="terminal">$ rails g scaffold project name:string</pre>

<p>Si examinamos la salida de esta orden veremos que algunos de los archivos generados han acabado en el directorio <code>app/assets</code>.</p>

<pre class="terminal">      create  app/assets/stylesheets/scaffold.css.scss
      invoke  assets
      create    app/assets/javascripts/projects.js.coffee
      create    app/assets/stylesheets/projects.css.scss</pre>

<p>Se incluye un fichero CSS, pero que posee la extensi&oacute;n <code>.scss</code> y un fichero JavaScript con la extensi&oacute;n <code>.coffee</code>.   Le vamos a echar un vistazo a estos ficheros pero antes debemos migrar la base de datos para que se cree la nueva tabla <code>projects</code>.</p>



<pre class="terminal">$ rake db:migrate</pre>

<p>Los ficheros SCSS tienen a primera vista el aspecto de ficheros CSS est&aacute;ndar, pero si miramos al final veremos algunas diferencias, incluyendo reglas anidadas.  Esto es una funcionalidad espec&iacute;fica de SASS que veremos en alg&uacute;n episodio futuro.</p>


<p class="codeFilePath">/app/assets/stylesheets/scaffold.css.scss</p>
<pre class="css">#error_explanation {
  width: 450px;
  border: 2px solid red;
  padding: 7px;
  padding-bottom: 0;
  margin-bottom: 20px;
  background-color: #f0f0f0;
  
  h2 {
    text-align: left;
    font-weight: bold;
    padding: 5px 5px 5px 15px;
    font-size: 12px;
    margin: -7px;
    margin-bottom: 0px;
    background-color: #c00;
    color: #fff;
  }
  
  ul li {
    font-size: 12px;
    list-style: square;
  }
}</pre>

<p>El andamiaje tambi&eacute;n ha generado un fichero <code>projects.css.scss</code> para incluir CSS espec&iacute;fico a las p&aacute;ginas de <code>Projects</code> y un fichero <code>projects.js.coffee</code> para el JavaScript relacionado con dicho modelo.  Obs&eacute;rvese que se trata s&oacute;lo de una recomendaci&oacute;n, todos los ficheros CSS y JavaScript se cargan en todas las p&aacute;ginas porque se fusionan en un &uacute;nico archivo.</p>

<p>Si ahora arrancamos el servidor de nuestra aplicaci&oacute;n y visitamos la p&aacute;gina de proyectos veremos que en el c&oacute;digo fuente de la p&aacute;gina aparecen incluidos dos ficheros.</p>


<pre class="html">&lt;link href=&quot;/assets/application.css&quot; media=&quot;screen&quot; &crarr;
  rel=&quot;stylesheet&quot; type=&quot;text/css&quot; /&gt;
&lt;script src=&quot;/assets/application.js&quot; type=&quot;text/javascript&quot;&gt; &crarr;
&lt;/script&gt;</pre>

<p>Dichos ficheros contienen versiones empaquetadas del JavaScript y CSS de la aplicaci&oacute;n.  Los contenidos de estos archivos vendr&aacute;n determinados por las l&iacute;neas <code>require</code> que aparecen en <code>applicaton.js</code> y <code>application.css</code>.  Dichas l&iacute;neas indican qu&eacute; ficheros se deben incluir as&iacute; como el orden de inclusi&oacute;n en el fichero combinado.</p>


<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">//= require jquery
//= require jquery_ujs
//= require_tree .</pre>

<p>Entre bambalinas Rails hace todo esto utilizando  <a href="http://www.getsprockets.com/">Sprockets</a>, que recibe todo los ficheros JavaScript o CSS necesarios en la aplicaci&oacute;n y los combina en un &uacute;nico archivo que es el que se entrega al cliente.  Esto significa que podemos organizar los ficheros en nuestra aplicaci&oacute;n como queramos, que ser&aacute;n finalmente combinados en un &uacute;nico archivo.  En modo de producci&oacute;n los ficheros tambi&eacute;n ser&aacute;n compactados para que se descarguen de la manera m&aacute;s eficiente posible.</p>

<p>En modo de desarrollo los ficheros <code>application.js</code> y <code>application.css</code> se recargan autom&aacute;ticamente mientras que en modo de producci&oacute;n se cachean de forma que no haya una penalizaci&oacute;n de rendimiento durante la compilaci&oacute;n de archivos CoffeScript y SASS.</p>

<h3>Cambios en las migraciones</h3>

<p>Veamos los cambios en otras funcionalidades de Rails 3.1, empezando con el fichero de migraci&oacute;n de base de datos que se gener&oacute; con el andamiaje anterior:</p>


<p class="codeFilePath">/db/migrate/20110511193808_create_projects.rb</p>
<pre class="ruby">class CreateProjects &lt; ActiveRecord::Migration
  def change
    create_table :projects do |t|
      t.string :name

      t.timestamps
    end
  end
end</pre>

<p>Esta migraci&oacute;n es distinta a las que estamos acostumbrados: en lugar de los m&eacute;todos <code>up</code> y <code>down</code> s&oacute;lo hay uno llamado <code>change</code> que sirve para hacer las migraciones hacia adelante y hacia atr&aacute;s.  En Rails 3.1 no hace falta escribir los dos m&eacute;todos siempre que su comportamiento pueda deducirse desde el m&eacute;todo <code>change</code>.  Se trata de una nueva funcionalidad de ActiveRecord que nos ahorrar&aacute; tiempo cuando escribamos c&oacute;digo de migraciones.</p>

<h3>Mapas de identidad</h3>

<p>Otra interesant&iacute;sima novedad de ActiveRecord son los Mapas de Identidad.  Si miramos el fichero de configuraci&oacute;n <code>application.rb</code> veremos que est&aacute;n activados por defecto.</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># Enable IdentityMap for Active Record, &crarr;
to disable set to false or remove the line below.
config.active_record.identity_map = true</pre>

<p>En esta primera beta de Rails 3.1 probablemente nos haga falta tocar un poco el fichero de configuraci&oacute;n a&ntilde;adiendo otra l&iacute;nea de c&oacute;digo:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># Enable IdentityMap for Active Record, &crarr;
to disable set to false or remove the line below.
config.active_record.identity_map = true
ActiveRecord::IdentityMap.enabled = true</pre>

<p>&iquest;Qu&eacute; hacen los Mapas de Identidad?  Utilic&eacute;moslos en la consola como demostraci&oacute;n.  Primero crearemos un nuevo <code>Project</code>:</p>

<pre class="terminal">&gt; p = Project.create!(:name =&gt; &quot;Yardwork&quot;)
  SQL (81.4ms)  INSERT INTO &quot;projects&quot; (&quot;created_at&quot;, &quot;name&quot;, &quot;updated_at&quot;) VALUES (?, ?, ?)  [[&quot;created_at&quot;, Fri, 13 May 2011 18:41:25 UTC +00:00], [&quot;name&quot;, &quot;Yardwork&quot;], [&quot;updated_at&quot;, Fri, 13 May 2011 18:41:25 UTC +00:00]]
 =&gt; #&lt;Project id: 1, name: &quot;Yardwork&quot;, created_at: &quot;2011-05-13 18:41:25&quot;, updated_at: &quot;2011-05-13 18:41:25&quot;&gt;</pre> 

<p>Lo primero que debemos notar es que el <em>log</em> aparece  directamente en la consola de forma que sabemos exactamente el SQL que se est&aacute; ejecutando en cada momento.</p>

<p>A continuaci&oacute;n recuperaremos el objeto reci&eacute;n creado por su <code>id</code>.</p>


<pre class="terminal">ruby-1.9.2-p180 :002 &gt; p1 = Project.find(1)
  Project Loaded  From Identity Map (id: 1)
 =&gt; #&lt;Project id: 1, name: &quot;Yardwork&quot;, created_at: &quot;2011-05-13 18:41:25&quot;, updated_at: &quot;2011-05-13 18:41:25&quot;&gt;</pre> 

<p>N&oacute;tese que la consola nos dice que el proyecto ha sido cargado a partir del Mapa de Identidad (id:1).  No se ha ejecutado nincuna consulta SQL para recuperar el proyecto de la base de datos porque Rails ya sabe que el proyecto est&aacute; cargado en memoria y utilizar&aacute; dicha instancia.  Podemos confirmarlo comprobando que los dos proyectos tienen el mismo <code>object_id</code>.</p>

<pre class="terminal">ruby-1.9.2-p180 :006 &gt; p.object_id == p1.object_id
 =&gt; true</pre>

<p>Esto significa que no tendremos el problema de establecer los atributos de un registro y pensar que se trata del mismo cuando lo cargamos a trav&eacute;s de una asociaci&oacute;n.  Ahora se nos garantiza que ambos ser&aacute;n la misma instancia.</p>


<h3>Asociaciones has_many :through anidadas</h3>

<p>Hay otras novedades en ActiveRecord, tales como las asociaciones <code>has_many :through</code> anidadas.  Veamos el siguiente c&oacute;digo de modelo.</p>

<p class="codeFilePath">/app/models/project.rb</p>
<pre class="ruby">class Project &lt; ActiveRecord::Base
  has_many :tasks
  has_many :assignments, :through =&gt; :tasks
  has_many :users, :through =&gt; :assignments
end</pre>

<p>En las versiones anteriores de Rails no pod&iacute;amos hacerlo, pero a partir de la 3.1 podemos anidar las asocaciones <code>has_many :through</code> lo cual nos puede ser &uacute;til en muchas situaciones.</p>

<p>Otra nueva prestaci&oacute;n es la posibilidad de asignar roles en las llamadas a <code>attr_accesible</code>.  Por ejemplo podr&iacute;amos hacer que el atributo <code>name</code> fuese <code>accessible</code>, pero s&oacute;lo para los usuarios que tuviesen el rol <code>admin</code>.</p>


<p class="codeFilePath">/app/models/project.rb</p>
<pre class="ruby">class Project &lt; ActiveRecord::Base
  attr_accessible :name, :as =&gt; :admin
end</pre>

<p>Si intentamos modificar el <code>Project</code> que hemos creado en consola con el navegador cambiando su nombre  &ldquo;Yardwork&rdquo; por &ldquo;Housework&rdquo;, dicho atributo no cambiar&aacute; porque no hemos iniciado sesi&oacute;n como administrador.</p>

<div class="imageWrapper">
  <img src="/system/photos/659/original/E265I03.png" width="801" height="280" alt="No tenemos el rol apropiado por lo que no se efectúa el cambio."/>
</div>

<p>Los roles se pasan a trav&eacute;s del controlador, modificando la llamada a <code>update_attributes</code> con la opci&oacute;n <code>:as</code>.</p>

<p class="codeFilePath">/app/controllers/projects_controller.rb</p>
<pre class="ruby">def update
  @project = Project.find(params[:id])

  respond_to do |format|
    if @project.update_attributes(params[:project], :as =&gt; :admin)
      format.html { redirect_to @project, notice: &#x27;Project &crarr;
          was successfully updated.&#x27; }
      format.json { head :ok }
    else
      format.html { render action: &quot;edit&quot; }
      format.json { render json: @project.errors, &crarr;           
        status: :unprocessable_entity }
    end
  end
end</pre>

<p>Si ahora intentamos actualizar el <code>Project</code> con el formulario veremos que funciona porque ya estamos pasando el rol <code>admin</code>.</p>

<h3>Cambios en la capa de las vistas</h3>

<p>Terminaremos viendo algunos cambios en las vistas.  El primero es peque&ntilde;o pero &uacute;til.  Hasta ahora, si ten&iacute;amos un <code>file_field</code> en un formulario ten&iacute;amos que a&ntilde;adir <code>:html =&gt; { :multipart =&gt; :true }</code> al  <code>form_for</code> para que los ficheros se enviasen correctamente.  Esta ya no hace falta En Rails 3.1 porque se pone autom&aacute;ticamente el atributo  <code>enctype</code> correcto en la etiqueta  <code>form</code> cuando dicho formulario contiene un <code>file_field</code>.</p>

<p>Hay otro cambio que afecta a la generaci&oacute;n de enlaces:  los <em>helpers</em> de URLs ya admiten opciones de dominio y subdominio.  Supongamos que tenemos el siguiente c&oacute;digo para un enlace:</p>


<pre class="ruby">&lt;%= link_to &#x27;Edit&#x27;, edit_project_path(@project) %&gt;</pre>

<p>Si queremos que estos enlaces apunten a un subdominio diferente podemos cambiar el c&oacute;digo de la siguiente manera:</p>

<pre class="ruby">&lt;%= link_to &#x27;Edit&#x27;, edit_project_url(@project, &crarr;
  :subdomain =&gt; &#x27;foo&#x27;) %&gt;</pre>

<p>El enlace ahora apuntar&aacute; a la misma p&aacute;gina en el subdominio <code>foo</code>.</p>

<h3>Salida de tests mejorada</h3>

<p>Por &uacute;ltimo le echaremos un vistazo a las mejoras en la salida de los tests.  Si ejecutamos <code>rake test</code> la salida quedar&aacute; m&aacute;s clara y bonita porque utiliza la gema turn que antes vimos en el <code>Gemfile</code>.</p>

<pre class="terminal">$ rake test
(in /Users/eifion/todo)
Loaded suite /Users/eifion/.rvm/gems/ruby-1.9.2-p180@global/gems/rake-0.8.7/lib/rake/rake_test_loader
Started

Finished in 0.003966 seconds.

0 tests, 0 assertions, 0 failures, 0 errors, 0 skips
Loaded suite /Users/eifion/.rvm/gems/ruby-1.9.2-p180@global/gems/rake-0.8.7/lib/rake/rake_test_loader
Started

ProjectsControllerTest:
     PASS should create project (0.16s) 
     PASS should destroy project (0.01s) 
     PASS should get edit (0.08s) 
     PASS should get index (0.01s) 
     PASS should get new (0.01s) 
     PASS should show project (0.01s) 
     PASS should update project (0.01s) 

Finished in 0.307078 seconds.

7 tests, 10 assertions, 0 failures, 0 errors, 0 skips</pre>

<p>Rails 3.1 trae muchas m&aacute;s novedades que se nos han quedado pendientes de estudiar.  Emisi&oacute;n continua de HTTP, herencia de vistas, <em>engines</em> montables y mucho m&aacute;s que veremos en episodios futuros.</p>

<p>Este <a href='https://gist.github.com/958283'>gist</a> enumera todos los cambios que ha habido hasta ahora en Rails 3.1</p>
