<p>Si encuentras que escribir el c&oacute;digo de las vistas es m&aacute;s que una tarea tediosa, estar&aacute;s alegre de saber que existe una librer&iacute;a llamada <a href="http://github.com/justinfrench/formtastic">Formtastic</a> que proporciona una manera m&aacute;s concisa para hacerlo. Con &eacute;sta, formularios complejos se pueden crear con relativamente poco c&oacute;digo como te mostraremos en este episodio.</p>
			
  <h3>Creando la aplicaci&oacute;n Vet</h3>

  <p>Antes de comenzar con Formtastic, vale la pena mencionar que existe un <a href="http://github.com/grimen/formtastic_tmbundle">paquete de TextMate</a>. El mismo proporciona una serie de &uacute;tiles fragmentos de c&oacute;digo que pueden hacer que la creaci&oacute;n de formularios sea a&uacute;n m&aacute;s f&aacute;cil.</p>

  <p>Para demostrar el funcionamiento de Formtastic, crearemos una nueva aplicaci&oacute;n Rails. Esta aplicaci&oacute;n llevar&aacute; el registro de pacientes animales en una cl&iacute;nica veterinaria. Llamaremos a la aplicaci&oacute;n <code>vet</code> y la crearemos de forma normal.</p>
  <pre class="terminal">rails vet</pre>
  <p>Formtastic es distribuido como una gema. Podemos incluirla en nuestra aplicaci&oacute;n agregando las siguiente l&iacute;nea en el archivo <code>/config/environment.rb</code>. (Si est&aacute;s utilizando TextMate e instalaste el paquete de Formtastic puedes usar <code>ftgem</code> y <code>&lt;TAB&gt;</code> como un acceso directo).</p>

  <pre class="ruby">config.gem &#x27;justinfrench-formtastic&#x27;, :lib =&gt; &#x27;formtastic&#x27;, :source =&gt; &#x27;http://gems.github.com&#x27;</pre>
  <p>Para asegurarnos que la gema est&aacute; instalada, necesitamos ejecutar</p> 
  <pre class="terminal">
  sudo rake gems:install
  </pre>
  <p>as&iacute; estamos listos para comenzar a escribir nuestra aplicaci&oacute;n.</p>

  <p>Nuestra aplicaci&oacute;n utilizar&aacute; la biblioteca <a href="http://github.com/ryanb/nifty-generators">nifty generators</a> de Ryan Bates para facilitar el desarrollo de partes de la misma. Lo primero que usaremos es el generador <code>nifty_layout</code>, el cu&aacute;l crear&aacute; un layout y una hoja de estilos</p>
  <pre class="terminal">
  script/generate nifty_layout
  </pre>
  <p>Luego generaremos nuestro primer modelo, utilizando el generador <code>nifty_scaffold</code> para crear un controlador y las vistas correspondientes. Pondremos nuestros animales en categor&iacute;as, as&iacute; que llamaremos a nuestro modelo <code>Category</code> y le daremos los atributos <code>name</code> y <code>description</code>.</p>
  <pre class="terminal">
  script/generate nifty_scaffold category name:string description:text
  </pre>
  <p>Ahora podemos migrar nuestra base de datos.</p>
  <pre class="terminal">rake db:migrate</pre>
  <p>Si corremos nuestra nueva aplicaci&oacute;n y navegamos a la p&aacute;gina para crear una nueva categor&iacute;a, veremos el c&oacute;digo generado para la vista por el scaffold</p>
  <div class="imageWrapper">
    <img src="/system/photos/214/original/E184I01.png" width="800" height="439" alt="The default New Category page."/>
  </div>

  <p>El c&oacute;digo generado por el scaffolding para el formulario anterior es el siguiente: </p>
  <pre class="ruby">
  &lt;% form_for @category do |f| %&gt;
    &lt;%= f.error_messages %&gt;
    &lt;p&gt;
      &lt;%= f.label :name %&gt;&lt;br /&gt;
      &lt;%= f.text_field :name %&gt;
    &lt;/p&gt;
    &lt;p&gt;
      &lt;%= f.label :description %&gt;&lt;br /&gt;
      &lt;%= f.text_area :description, :rows =&gt; 5 %&gt;
    &lt;/p&gt;
    &lt;p&gt;&lt;%= f.submit &quot;Submit&quot; %&gt;&lt;/p&gt;
  &lt;% end %&gt;
  </pre>
  <p>Esto es c&oacute;digo normal para un formulario Rails, comenzando con <code>form_for</code> y definiendo separadamente cada campo del formulario junto a su etiqueta. Finalmente, hay un bot&oacute;n de enviar con el que podremos agregar una nueva categor&iacute;a.</p>

  <p>Formtastic no sobreescribe ninguno de los m&eacute;todos est&aacute;ndar, por lo que a&uacute;n podremos utilizarlos en un formulario Formtastic. Si reemplazamos el <code>form_for</code> en el formulario anterior con <code>semantic_form_for</code> de Formtastic, el formulario funcionar&iacute;a de la misma manera. No tiene mucho sentido hacer eso, sin embargo; la verdadera ventaja aparece cuando utilizamos los m&eacute;todos de Formtastic. Con ellos, podemos cambiar nuestro formulario para que se vea de la siguiente forma:</p>
  <pre class="ruby">
  &lt;% semantic_form_for @category do |f| %&gt;
   &lt;%= f.inputs %&gt;
   &lt;%= f.buttons %&gt;
  &lt;% end %&gt;
  </pre>
  <p>El m&eacute;todo <code>inputs</code> es una manera conveniente de generar todos los campos para un modelo, igualmente, el m&eacute;todo <code>buttons</code> genera el bot&oacute;n de enviar. Si ahora recargamos el formulario, se ve un poco diferente.</p>
  <div class="imageWrapper">
    <img src="/system/photos/215/original/E184I02.png" width="801" height="502" alt="The New Category page using Formtastic code."/>
  </div>

  <p>Este formulario ahora es mostrado utilizando los m&eacute;todos de Formtastic. La diferencia m&aacute;s notoria es que mientras el formulario generado a trav&eacute;s de scaffold utilizaba tags de p&aacute;rrafos, Formtastic utiliza listas ordenadas y fieldsets para separar los campos de entrada de los botones.</p>

  <p>El formulario no se ve particularmente lindo como est&aacute;, pero podemos arreglarlo aplicando un poco de CSS. Formtastic viene con algunas hojas de estilo existentes que podemos generar para no tener que hacer todo el trabajo nosotros mismos. Si corremos</p>
  <pre class="terminal">
  script/generate formtastic_stylesheets
  </pre>
  <p>dos nuevas hojas de estilos ser&aacute;n creadas en el directorio <code>/public/stylesheets</code> de nuestra aplicaci&oacute;n y nos permite referenciarlas desde nuestro archivo de layout. En la secci&oacute;n head de nuestro layout ya estamos referenciando una hoja de estilo.</p>
  <pre class="ruby">
  &lt;head&gt;
    &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;
    &lt;%= stylesheet_link_tag &#x27;application&#x27; %&gt;
    &lt;%= yield(:head) %&gt;
  &lt;/head&gt;
  </pre>
  <p>Podemos agregar las dos hojas de estilo de Formtastic aqu&iacute; para incluirlas en todas las p&aacute;ginas de nuestra aplicaci&oacute;n</p>
  <pre class="ruby">
  &lt;%= stylesheet_link_tag &#x27;application&#x27;, &#x27;formtastic&#x27;, &#x27;formtastic_changes&#x27; %&gt;
  </pre>
  <p>El segundo archivo, <code>formtastic_changes</code>, es donde deber&iacute;amos realizar cualquier cambio al estilo por defecto provisto por Formtastic. Como ahora tenemos m&uacute;ltiples hojas de estilos, deber&iacute;amos utilizar la opci&oacute;n de cache de Rails de forma de combinar todos los archivos en uno solo cuando lo corramos en modo producci&oacute;n (Esto tambi&eacute;n se aplica a m&uacute;ltiples archivos JavaScript)</p>
  <pre class="ruby">
  &lt;%= stylesheet_link_tag &#x27;application&#x27;, &#x27;formtastic&#x27;, &#x27;formtastic_changes&#x27;, :cache =&gt; &#x27;base&#x27; %&gt;
  </pre>
  <p>Utilizando el cacheo de esta forma significa que menos cantidad de archivos ser&aacute;n pedidos al servidor cuando se carga la p&aacute;gina, ya que las tres hojas de estilos ser&aacute;n combinadas en una sola llamada <code>base.css</code></p>
  
  <p>Si recargamos el formulario ahora, se ver&aacute; un poco mejor, pero todav&iacute;a no como se deber&iacute;a ver.</p>

  <div class="imageWrapper">
    <img src="/system/photos/216/original/E184I03.png" width="800" height="475" alt="The form's layout isn't quite correct."/>
  </div>

  <p>Esto es por un par de l&iacute;neas en la hoja de estilos de Formtastic.</p>
  <pre class="terminal">
  html[xmlns] form.formtastic fieldset { display: block; }

  html[xmlns] form.formtastic fieldset ol li { display: block; }
  </pre>

  <p>Los dos selectores CSS anteriores esperan que el comienzo de las p&aacute;ginas, el tag <code>&lt;html&gt;</code>, tenga el atributo <code>xmlns</code>. En el archivo de layout generado por nifty_layout el tag no tiene este atributo, por lo que tendremos que agregarlo para que el formulario se muestre como deber&iacute;a.</p>
  <pre class="terminal">
  &lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot; xml:lang=&quot;en&quot; lang=&quot;en&quot;&gt;
  </pre>
  <p>Recargamos el formulario ahora y veremos como los campos de texto se alinean como hubi&eacute;ramos esperado. Hora que el formulario se ve como deber&iacute;a podemos agregar un par de categor&iacute;as, una para perros y otra para gatos. Las utilizaremos pronto cuando creemos el formulario para animales.</p>

  <div class="imageWrapper">
    <img src="/system/photos/217/original/E184I04.png" width="800" height="475" alt="Adding our first category."/>
  </div>

  <h3>Un ejemplo m&aacute;s complejo</h3>
  
  <p>Ahora pasaremos al formulario para los animales. Como con las categor&iacute;as, comenzaremos por generar el scaffold.</p>
  <pre class="terminal">
  script/generate nifty_scaffold animal name:string category_id:integer born_on:date female:boolean
  </pre>
  <p>El modelo <code>Animal</code> tendr&aacute; los atributos <code>name</code>, <code>born_on</code> y <code>female</code> junto con un <code>category_id</code> as&iacute; podremos poner cada animal dentro de una <code>Category</code>. Luego de crear el scaffold ejecutaremos la migraci&oacute;n de nuestra base de datos nuevamente de forma que la nueva tabla sea creada.</p>
  <pre class="terminal">
  rake db:migrate
  </pre>
  <p>El siguiente paso es crear las relaciones entre modelos, as&iacute; es que un animal pertenece a una categor&iacute;a&hellip;</p>
  <pre class="terminal">
  class Animal &lt; ActiveRecord::Base
    attr_accessible :name, :category_id, :born_on, :female
    belongs_to :category
  end
  </pre>
  <p>&hellip;y una categor&iacute;a tiene muchos animales.</p>
  <pre class="ruby">
  class Category &lt; ActiveRecord::Base
    attr_accessible :name, :description
    has_many :animals
  end
  </pre>
  <p>El formulario generado por el scaffolding se muestra debajo. Queremos reemplazarlo con un poco de c&oacute;digo Formtastic as&iacute; que lo cambiaremos pronto.</p>

  <div class="imageWrapper">
    <img src="/system/photos/218/original/E184I05.png" width="800" height="488" alt="The default New Animal page."/>
  </div>

  <p>Como en el formulario de categor&iacute;a, reemplazaremos el c&oacute;digo por defecto de <code>form_for</code> por el c&oacute;digo de Formtastic <code>semantic_form_for</code>.</p>
  <pre class="ruby">
  &lt;% semantic_form_for @animal do |f| %&gt;
    &lt;% f.inputs do %&gt;
      &lt;%= f.input :name %&gt;
      &lt;%= f.input :born_on %&gt;
      &lt;%= f.input :category %&gt;
      &lt;%= f.input :female %&gt;
    &lt;% end %&gt;
    &lt;%= f.buttons %&gt;
  &lt;% end %&gt;
  </pre>
  <p>Esta vez vamos a querer m&aacute;s control sobre los campos de nuestro formulario as&iacute; que vamos a personalizarlos pronto por lo que hemos pasado un bloque <code>f.inputs</code> y dentro del mismo usamos el m&eacute;todo <code>input</code> para definir cada campo. Luego de haber cerrado el bloque, podemos agregar nuestro bot&oacute;n enviar con <code>f.buttons</code> al igual que lo hicimos anteriormente.</p>

  <p>Si recargamos el formulario ahora, veremos que los campos son mostrados a trav&eacute;s de Formtastic.</p>

  <div class="imageWrapper">
    <img src="/system/photos/219/original/E184I06.png" width="801" height="477" alt="The New Animal page with the Formtastic controls on it."/>
  </div>

  <p>Formtastic ha creado campos de formularios apropiados a los tipos atributos del modelo <code>Animal</code>. Aunque no lo puedes ver aqu&iacute;, incluso ha inferido que el campo <code>category_id</code> es una asociaci&oacute;n y ha cargado el dropdown de categor&iacute;as con las categor&iacute;as que agregamos anteriormente.</p>
 
  <p>Hay algunos cambios que queremos hacerle a este formulario. Por defecto, la parte del a&ntilde;o de la fecha es cargada &uacute;nicamente con cinco a&ntilde;os hacia cada lado del a&ntilde;o actual y precisamos mostrar fechas m&aacute;s atr&aacute;s que eso. Tambi&eacute;n queremos quitar la opci&oacute;n en blanco del dropdown de <code>category</code> y mostrar el campo <code>female</code> como un par de botones de radio en lugar de un checkbox.</p>
 
  <p>Podemos personalizar campos usando las mismas opciones que pasamos a los helpers de formularios de Rails. Esto significa que podemos pasarle a <code>born_on</code> <code>:start_year</code> y podemos usar el par&aacute;metro <code>:include_blank =&gt; false</code> en nuestra categor&iacute;a para quitar la opci&oacute;n en blanco.</p>
  <pre class="ruby">
  &lt;% semantic_form_for @animal do |f| %&gt;
    &lt;% f.inputs do %&gt;
      &lt;%= f.input :name %&gt;
      &lt;%= f.input :born_on, :start_year =&gt; 1900 %&gt;
      &lt;%= f.input :category, :include_blank =&gt; false %&gt;
      &lt;%= f.input :female, :as =&gt; :radio %&gt;
    &lt;% end %&gt;
    &lt;%= f.buttons %&gt;
  &lt;% end %&gt;
  </pre>
  <p>Tenemos que tratar el campo <code>female</code> un poco diferente ya que estamos cambiando el tipo del elemento en el formulario. Para especificar un tipo de campo diferente al por defecto, Formtastic proporciona el par&aacute;metro <code>:as</code>. Podemos usar <code>:as =&gt; :radio</code> para cambiar el tipo a botones de radio</p>
 
  <p>Si miramos nuevamente el formulario, veremos que los cambios que realizamos efectivamente se reflejan en el mismo, con las fechas comenzando desde 1900, la opci&oacute;n en blanco no est&aacute; en la categor&iacute;a y el checkbox de female fue reemplazado por dos botones de radio</p>
 
  <div class="imageWrapper">
    <img src="/system/photos/220/original/E184I07.png" width="801" height="477" alt="The gender field is now rendered as radio buttons."/>
  </div>

  <p>Los botones de radio son una mejora con respecto al checkbox, pero en lugar de &ldquo;yes&rdquo; y &ldquo;no&rdquo; queremos que la etiqueta del campo sea &ldquo;Gender&rdquo; y que los botones de radio sean &ldquo;Male&rdquo; y &ldquo;Female&rdquo;. &iquest;Permite Formtastic &eacute;ste nivel de personalizaci&oacute;n? As&iacute; es. Podemos utilizar las opciones <code>:label</code> y <code>:collection</code> para asignar los valores de la etiqueta y los botones de radio.</p>
  <pre class="ruby">
  &lt;%= f.input :female, :as =&gt; :radio, :label =&gt; &quot;Gender&quot;, :collection =&gt; [[&quot;Male&quot;, false], [&quot;Female&quot;, false]] %&gt;
  </pre>
  <p>Como su nombre lo indica, la opci&oacute;n <code>:label</code> asigna el nombre de la etiqueta mientras que la opci&oacute;n <code>:collection</code> toma un array de arrays especificando el nombre y valor de cada bot&oacute;n de radio.</p>
  
  <p>El formulario ahora se ve como queremos.</p>  

  <div class="imageWrapper">
    <img src="/system/photos/221/original/E184I08.png" width="801" height="477" alt="The labels on the radio buttons are changed to the text we want."/>
  </div>

  <p>Nuestro formulario est&aacute; ahora completo y podemos utilizarlo para crear cuantos animales queramos.</p> 

  <h3>Llev&aacute;ndolo m&aacute;s lejos</h3>  

  <p>Con Formtastic hemos creado un formulario bastante complejo con relativamente poco c&oacute;digo en la vista, utilizando sus opciones de personalizaci&oacute;n para alterar alguno de los campos a nuestra necesidad. Todav&iacute;a hay bastante de Formtastic que no hemos cubierto aunque lo haremos en el pr&oacute;ximo episodio.</p>  
