
<p>En el episodio anterior, vimos como crear links para las acciones create, edit y destroy del sitio web de ASCIIcasts. Los links funcionaban, pero de una manera bastante permisiva con usuarios p&uacute;blicos.</p>

<div class="imageWrapper">
  <img src="/system/photos/17/original/E019I03.png" width="663" height="558" alt="The home page showing the edit and destroy links."/>
  <p class="title">La p&aacute;gina del listado de episodios con links para administraci&oacute;n visibles por todos los usuarios.</p>
</div>

<p>Lo que tenemos que hacer es restringir los links para que solo puedan ser vistos por usuarios que tengan permisos para editar episodios. Vamos a editar nuestro partial para episodios para que renderice solamente los links <code>edit</code> y <code>destroy</code>, si un m&eacute;todo llamado <code>admin?</code> devuelve true (haremos lo mismo con el link <code>new</code>, pero no mostraremos el c&oacute;digo aqu&iacute;.)</p>

<pre class="ruby">
&lt;li&gt;  
  &lt;p class=&quot;episodeId&quot;&gt;&lt;%= episode.episode_id %&gt;&lt;/p&gt;  
  &lt;h3&gt;&lt;%= link_to episode.title, episode_path(episode.identifier) %&gt;&lt;/h3&gt;  
  &lt;p class=&quot;summary&quot;&gt;&lt;%= episode.summary %&gt;&lt;/p&gt;  
  &lt;p class=&quot;tagList&quot;&gt;  
    Tags: &lt;% episode.tags.each do |tag| %&gt;&lt;%= link_to tag.title, tag_path(tag.title) %&gt;&lt;% end %&gt;  
  &lt;/p&gt;  
  &lt;% if admin? %&gt;  
  &lt;p class=&quot;adminActions&quot;&gt;  
    &lt;%= link_to &quot;Edit&quot;, edit_episode_path(episode) %&gt;  
    &lt;%= link_to &quot;Destroy&quot;, episode_path(episode), :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;  
  &lt;/p&gt;  
  &lt;% end %&gt;  
&lt;/li&gt; 
</pre>
<p class="title"> El partial de episodio con la verificaci&oacute;n admin? encerrando los links <code>edit</code> y <code>destroy</code>.</p>

<p>A continuaci&oacute;n, necesitaremos escribir el m&eacute;todo <code>admin?</code>, &iquest;pero d&oacute;nde deber&iacute;amos colocarlo?. Como estamos llamando al m&eacute;todo desde la vista, obviamente, por consiguiente lo tendremos que colocar en el archivo helper de la aplicaci&oacute;n. Pero, &iquest;si tambi&eacute;n quisi&eacute;ramos que fuera accesible por los controladores?. Entonces, mejor lo vamos a colocar en el controlador de aplicaci&oacute;n.</p>

<pre class="ruby">
class ApplicationController &lt; ActionController::Base  
  helper_method :admin?    
  protected  
  def admin?  
    false  
  end    
end  
</pre>
<p class="title">El m&eacute;todo <code>admin?</code> Agregado al <code>ApplicationController</code>.</p>

<p>Por ahora, nuestro m&eacute;todo <code>admin?</code> solamente va a devolver <code>false</code>, (vamos a terminar de implementarlo en el siguiente episodio). Como tambi&eacute;n vamos a querer utilizarlo en nuestras vistas, hemos utilizado el m&eacute;todo <code>helper_method</code> que lo hace visible desde el c&oacute;digo de las vistas.</p>

<h3>Casi terminamos</h3>

<p>Ahora que ya hemos escrito nuestro m&eacute;todo <code>admin?</code>, nuestros links est&aacute;n ocultos para usuarios que no son administradores. Aunque, todav&iacute;a nos queda un problema: cualquier persona puede entrar a las p&aacute;ginas de administraci&oacute;n y agregar o borrar episodios. Lo vamos a resolver utilizando un <code>before_filter</code>.</p>

<pre class="ruby">
class EpisodesController &lt; ApplicationController  
  before_filter :authorize, :except =&gt; [:index, :show ]  
    
  def index  
    @episodes = Episode.find(:all)  
  end  
  # show, new, create, edit, update and destroy methods hidden.  
end  
</pre>
<p class="title">El controlador de episodios sin los cuerpos de los m&eacute;todos.</p>

<p>El <code>before_filter</code> de arriba, va a ejecutar un m&eacute;todo llamado <code>authorize</code> antes que cada m&eacute;todo de nuestro controlador sea llamado. Lo vamos a colocar en el controlador de aplicaci&oacute;n para que est&eacute; disponible para todos los controladores.</p>

<pre class="ruby">
class ApplicationController &lt; ActionController::Base  
  helper_method :admin?    
  protected  
  def admin?  
    false  
  end    
  
  def authorize  
    unless admin?  
      flash[:error] = &ldquo;Unauthorized access&rdquo;  
      redirect_to home_path  
      false  
    end  
  end  
end  
</pre>
<p class="title">El controlador de Aplicaci&oacute;n con el m&eacute;todo <code>authorize</code>.</p>

<p>El m&eacute;todo revisa que el usuario sea un administrador, de lo contrario, muestra un m&eacute;todo flash y redirecciona a la p&aacute;gina principal. Finalmente, devuelve <code>false</code> para que ninguna otra acci&oacute;n sea ejecutada. Ahora, si intentamos visitar la p&aacute;gina nuevo episodio vamos a ser redireccionados a la p&aacute;gina principal. De manera alternativa, si no quisi&eacute;ramos que usuarios sin autorizaci&oacute;n sepan que la p&aacute;gina existe, podr&iacute;amos mostrar un error 404 (P&aacute;gina no encontrada).</p>

<h3>#TODO:</h3>

<p>Nuestro sistema de administraci&oacute;n est&aacute; casi terminado pero, todav&iacute;a, tenemos que implementar el m&eacute;todo <code>admin?</code>. Vamos a mostrarle como hacerlo en el siguiente episodio.</p>
