<p>Una de las  novedades m&aacute;s importantes que trae Rails 3.1 es la herencia de plantillas, que si bien no va a revolucionar c&oacute;mo escribimos nuestras  vistas s&iacute; que es bastante &uacute;til  y en este episodio veremos c&oacute;mo funciona.

<p>En este episodio veremos una aplicaci&oacute;n que tiene la misma navegaci&oacute;n en cada p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="/system/photos/670/original/E269I01.png" width="801" height="345" alt="La página principal de nuestra aplicación."/>
</div>

<p>La navigaci&oacute;n est&aacute; definida en el fichero de <em>layout</em> de la aplicaci&oacute;n dentro de un elemento <code>div</code> que tiene un <code>id</code> con valor <code>side</code> y que es est&aacute;tico.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
  &lt;title&gt;Store&lt;/title&gt;
  &lt;%= stylesheet_link_tag &quot;application&quot; %&gt;
  &lt;%= javascript_include_tag &quot;application&quot; %&gt;
  &lt;%= csrf_meta_tags %&gt;
&lt;/head&gt;
&lt;body&gt;
  &lt;div id=&quot;container&quot;&gt;

    &lt;% flash.each do |name, msg| %&gt;
      &lt;%= content_tag :div, msg, :id =&gt; &quot;flash_#{name}&quot; %&gt;
    &lt;% end %&gt;

    &lt;div id=&quot;side&quot;&gt;
      &lt;strong&gt;Pages&lt;/strong&gt;
      &lt;ul&gt;
        &lt;li&gt;&lt;%= link_to &quot;Home&quot;, root_path %&gt;&lt;/li&gt;
        &lt;li&gt;&lt;%= link_to &quot;Products&quot;, products_path %&gt;&lt;/li&gt;
      &lt;/ul&gt;
    &lt;/div&gt;

    &lt;%= yield %&gt;

    &lt;div class=&quot;clear&quot;&gt;&lt;/div&gt;
  &lt;/div&gt;
&lt;/body&gt;
&lt;/html&gt;</pre>

<p>Queremos personalizar la navegaci&oacute;n de forma que cambie dependiendo del controlador en cada momento.  Hay varias maneras posibles de hacer esto, pero nosotros usaremos la herencia de plantillas.  Para ellos moveremos la navegaci&oacute;n a su propio parcial llamado <code>side</code>.</p>

<p class="codeFilePath">/app/layouts/views/application.html.erb</p>
<pre class="ruby">&lt;div id=&quot;side&quot;&gt;
  &lt;%= render &quot;side&quot; %&gt;
&lt;/div&gt;</pre>

<p>&iquest;D&oacute;nde poner este parcial para que quede accesible a todos los controladores de la aplicaci&oacute;n?  Podr&iacute;amos crear un directorio llamado <code>shared</code> bajo <code>app/views</code> y ponerlo ah&iacute; o podr&iacute;amos ponerlo bajo el directorio <code>layouts</code>.  Sin embargo en Rails 3.1 podemos ponerlo en un directorio <code>app/views/application</code> que por defecto no se crea con la aplicaci&oacute;n Rails 3.1, as&iacute; que tendremos que hacerlo nosotros.</p>

<p class="codeFilePath">/app/views/application/_side.html.erb</p>
<pre class="ruby">&lt;strong&gt;Pages&lt;/strong&gt;
&lt;ul&gt;
  &lt;li&gt;&lt;%= link_to &quot;Home&quot;, root_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Products&quot;, products_path %&gt;&lt;/li&gt;
&lt;/ul&gt;</pre>

<p>Este parcial estar&aacute; disponible para todos los controladores, porque la herencia de vistas funciona de forma paralela a la herencia de controladores.  Todos los controladores heredan de <code>ApplicationController</code> por lo que todas las plantillas hereder&aacute;n del directorio <code>application</code>.</p>

<p>Si ahora cargamos una de las p&aacute;ginas de nuestra aplicaci&oacute;n veremos que la navegaci&oacute;n funciona igual que antes.</p>

<div class="imageWrapper">
  <img src="/system/photos/671/original/E269I02.png" width="801" height="345" alt="The navigation works as before."/>
</div>

<p>Con esto tenemos un parcial que puede ser f&aacute;cilmente redefinido para cualquier controlador de la aplicaci&oacute;n.  Tan s&oacute;lo tenemos que crear un fichero parcial <code>_side.html.erb</code> en el directorio normal de vistas del controlador bajo bajo <code>app/views/</code>.  Hagamos esto en <code>ProductsController</code>, creando un parcial que tenga un enlace adicional.</p></p>

<p class="codeFilePath">/app/views/products/_side.html.erb</p>
<pre class="ruby">&lt;strong&gt;Pages&lt;/strong&gt;
&lt;ul&gt;
  &lt;li&gt;&lt;%= link_to &quot;Home&quot;, root_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Products&quot;, products_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Manage Products&quot;, admin_products_path %&gt;&lt;/li&gt;
&lt;/ul&gt;</pre>

<p>Si recargamos cualquier p&aacute;gina debajo de <code>ProductsController</code> veremos este enlace.  En cualquier otro controlador seguiremos viendo la navegaci&oacute;n por defecto.</p>

<div class="imageWrapper">
  <img src="/system/photos/672/original/E269I03.png" width="801" height="345" alt="Todas las acciones que cuelgan de ProductsController mostrarán la plantilla redefinida."/>
</div>

<p>Con esto ya tenemos un lugar est&aacute;ndar donde dejar las plantillas que se tengan que compartir entre controladores, pudi&eacute;ndose  redefinir cualquiera de estas plantillas creando una plantilla con id&eacute;ntico nombre en el directorio de vistas correspondiente al controlador que necesite redefinirlas.</p>

<p>Este enfoque tambi&eacute;n funciona con controladores anidados.  Nuestra aplicaci&oacute;n tiene varios controladores bajo el espacio de nombres <code>Admin</code>, y todos ellos heredan de <code>BaseController</code>.</p>

<p class="codeFilePath">/app/controllers/admin/base_controller.rb</p>
<pre class="ruby">module Admin
  class BaseController &lt; ApplicationController
  end
end</pre>

<p>Tambi&eacute;n podemos redefinir plantillas en esta vista <code>Base</code>.  Si hacemos clic en el enlace  &ldquo;Manage Products&rdquo; de la p&aacute;gina anterior iremos a la p&aacute;gina  <code>/admin/products</code> y la navegaci&oacute;n volver&aacute; a ser la que se muestra por defecto.  &iquest;Qu&eacute; hacer si queremos redefinir la navegaci&oacute;n en todas las vistas de administraci&oacute;n?</p>

<p>Bajo el directorio <code>app/views/admin</code> tenemos un directorio <code>base</code>.  Las plantillas que pongamos ah&iacute; ser&aacute;n heredadas autom&aacute;ticamente por los otros controladores.  Hag&aacute;moslo y  a&ntilde;adamos otro enlace para poder distinguir esta plantilla de las otras.</p>

<p class="codeFilePath">/app/views/admin/base/_side.html.erb</p>
<pre class="ruby">&lt;strong&gt;Pages&lt;/strong&gt;
&lt;ul&gt;
  &lt;li&gt;&lt;%= link_to &quot;Home&quot;, root_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Products&quot;, products_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Manage Products&quot;, admin_products_path %&gt;&lt;/li&gt;
  &lt;li&gt;&lt;%= link_to &quot;Manage Categories&quot;, admin_categories_path %&gt;&lt;/li&gt;
&lt;/ul&gt;</pre>

<p>Si recargamos la p&aacute;gina <code>admin/products</code> veremos aplicada la plantilla del directorio <code>base</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/673/original/E269I04.png" width="801" height="358" alt="Las páginas que heredan de BaseController utilizarán la plantilla del directorio base."/>
</div>

<p>Esta plantilla se mostrar&aacute; para cualquier p&aacute;gina del espacio de nombres <code>Admin</code> porque todas estas p&aacute;ginas heredan del controlador <code>BaseController</code> que pertenece al espacio de nombres <code>Admin</code>.</p>

<p>La herencia de plantillas no s&oacute;lo funciona para los parciales sino tambi&eacute;n para cualquier plantilla de vista.  En la carpeta <code>app/views/admin</code> existe una plantilla <code>edit.html.erb</code> tanto en los directorios <code>categories</code> como <code>products</code>.  Ambas contienen el mismo c&oacute;digo.</p>

<p class="codeFilePath">/app/views/admin/categories/edit.html.erb</p>
<pre class="ruby">&lt;h1&gt;Edit&lt;/h1&gt;

&lt;%= render &#x27;form&#x27; %&gt;</pre>

<p>Si movemos una de estas plantillas al directorio <code>base</code> y borramos la otra ambos controaldores heredar&aacute;n la misma plantilla, y ambas p&aacute;ginas funcionar&aacute;n igual que antes.  Se trata de una posibilidad muy &uacute;til si tenemos que crear muchas p&aacute;ginas de administraci&oacute;n para nuestra aplicaci&oacute;n.  Estas p&aacute;ginas por lo general tienen mucha repetici&oacute;n en las vistas y con esta t&eacute;cnica podemos abstraer dichas plantillas a un controlador base y redefinirlas cuando se necesaria para controladores concretos.</p>

<p>Y ya que estamos hablando de redefinir plantillas veamos a continuaci&oacute;n otro truco que nos permite personalizar las plantillas bas&aacute;ndonos en algo que no sea el controlador. Supongamos que queremos dar una versi&oacute;n m&oacute;vil del sitio bajo el subdominio <code>mobile</code>.  Podemos cambiar las visitas a usar dependiendo del subdominio definiendo rutas de vistas distintas.  Esta funcionalidad no es nueva en Rails 3 y funciona con Rails 2 pero la hemos incluido en este episodio porque encaja muy bien.</p>

<p>Los controladores de nuestra aplicaci&oacute;n tienen rutas de vistas.  Si invocamos a <code>controller.view_paths</code> en una vista veremos cu&aacute;les son las rutas de vistas  de un controlador.</p>

<p class="codeFilePath">/app/views/admin/base/edit.html.erb</p>
<pre class="ruby">&lt;h1&gt;Edit&lt;/h1&gt;

&lt;%= render &#x27;form&#x27; %&gt;

&lt;%= controller.view_paths %&gt;</pre>

<p>Si recargamos la p&aacute;gina de edici&oacute;n de un producto veremos listado <code>view_paths</code> (para que sea m&aacute;s c&oacute;modo utilizar subdominios con nuestra aplicaci&oacute;n en desarrollo utilizamos el servidor web <a href="http://pow.cx/">Pow</a>.)</p>

<div class="imageWrapper">
  <img src="/system/photos/674/original/E269I05.png" width="800" height="405" alt="La página mostrando sus rutas de vistas."/>
</div>

<p>El controlador tiene su ruta de vistas por defecto, pero podemos a&ntilde;adir m&aacute;s.  Una  forma de hacerlo es usando  <code>before_filter</code> en <code>ApplicationController</code>.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">class ApplicationController &lt; ActionController::Base
  protect_from_forgery
  before_filter :subdomain_view_path
  
  def subdomain_view_path
    if request.subdomain.present?
      prepend_view_path &quot;app/views/#{request.subdomain}_subdomain&quot;
    end
  end  
end</pre>

<p>En el m&eacute;todo <code>before_filter</code> utilizamos  <code><a href="http://apidock.com/rails/AbstractController/ViewPaths/ClassMethods/prepend_view_path">prepend_view_path</a></code> para a&ntilde;adir una nueva ruta de vistas bas&aacute;ndonos en el subdominio de la petici&oacute;n, si es que hay tal subdominio.  Podemos ver la nueva ruta de vistas cargando otra vez la p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="/system/photos/675/original/E269I06.png" width="800" height="405" alt="Ya aparece la nueva ruta de vistas."/>
</div>

<p>Vemos que ya aparece el subdominio en <code>view_paths</code>.  Si elminamos el subdominio <code>mobile</code> de la URL y recargamos la p&aacute;gina, &eacute;ste desaparecer&aacute;.  Podemos utilizar esto para pesonalizar nuestras vistas dependiendo del subdominio actual.  Si creamos un nuevo directorio bajo <code>views</code> llamado <code>mobile_subdomain</code> podemos a&ntilde;adir plantillas de vistas que tendr&aacute;n precedencia sobre sus equivalentes por defecto.  Podemos crear un nuevo <code>index.html.erb</code> bajo el directorio <code>products</code> y esta plantila s&oacute;lo se usar&aacute; cuando se acceda desde el subdominio <code>mobile</code>.</p>

<p class="codeFilePath">/app/views/mobile_subdomain/products/index.html</p>
<pre class="ruby">&lt;h1&gt;mobile version&lt;/h1&gt;</pre>

<p>Si vemos la p&aacute;gina sin el subdominio veremos la versi&oacute;n por defecto.</p>

<div class="imageWrapper">
  <img src="/system/photos/676/original/E269I07.png" width="800" height="323" alt="Se usa la plantilla por defecto si el subdominio no viene."/>
</div>

<p>Si ponemos el subdominio, se utiliza la nueva plantilla que redefine la plantilla por defecto.</p>

<div class="imageWrapper">
  <img src="/system/photos/677/original/E269I08.png" width="800" height="280" alt="The mobile template is shown if the page is viewed under the mobile subdomain."/>
</div>

<p>Con esto concluimos este episodio que trata sobre la redefinici&oacute;n de plantillas, bien mediante la herencia o por la manipulaci&oacute;n de la ruta de vistas.  Ambas t&eacute;cnicas permiten personalizar, abstraer y redefinir todas nuestras vistas.  Si necesitamos personalizar todav&iacute;a m&aacute;s las vistas podemos hacer un decisor de vistas, pero eso es algo que dejamos para otro episodio.</p>
