<p>&#x53EF;&#x80FD;&#x4F60;&#x6700;&#x4E0D;&#x60F3;&#x770B;&#x5230;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#x5728;&#x4F60;&#x7684;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x54C1;&#x91CC;&#x6709;&#x4E2A;&#x9519;&#x8BEF;&#x63D0;&#x793A;500&#x3002;&#x5F53;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x65F6;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/232/original/E187I01.png" width="804" height="280" alt="The 500 error on our site."/>
</div>

<h3>&#x9519;&#x8BEF;&#x901A;&#x77E5;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;</h3>

<p>&#x6709;&#x5F88;&#x591A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x8BA9;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x540E;&#x7ACB;&#x5373;&#x901A;&#x77E5;&#x6211;&#x4EEC;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x56DB;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>

      <p>&#x7B2C;&#x4E00;&#x79CD;&#x4E5F;&#x662F;&#x6700;&#x7ECF;&#x5178;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x5F02;&#x5E38;&#x901A;&#x77E5;(<a href="http://github.com/rails/exception_notification">exception notification</a>)&#x63D2;&#x4EF6;.&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x57FA;&#x672C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5F53;&#x5B89;&#x88C5;&#x5E76;&#x4E14;&#x914D;&#x7F6E;&#x597D;&#x5B83;&#x540E;&#xFF0C;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x4ED6;&#x90FD;&#x4F1A;&#x53D1;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7ED9;&#x6211;&#x4EEC;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x95EE;&#x9898;,&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x90AE;&#x7BB1;&#x91CC;&#x5C06;&#x4F1A;&#x585E;&#x6EE1;&#x5404;&#x79CD;&#x62A5;&#x9519;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E5F;&#x80FD;&#x6FC0;&#x52B1;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x3002;</p>
      
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5F02;&#x5E38;&#x8BB0;&#x5F55;(<a href="http://github.com/defunkt/exception_logger">exception logger</a>)&#x63D2;&#x4EF6;,&#x5B83;&#x5728;<a href="http://railscasts.com/episodes/104-exception-notifications">104&#x7AE0;</a>&#x4E2D;&#x88AB;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FC7;&#x3002;&#x5B83;&#x548C;&#x5F02;&#x5E38;&#x901A;&#x77E5;(exception notification)&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x4F1A;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x5B83;&#x5728;&#x4E00;&#x5F20;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x8BB0;&#x5F55;&#x4E0B;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E0A;&#x53CD;&#x6620;&#x51FA;&#x6765;&#x3002;</p>
  <p>&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x90FD;&#x662F;&#x6536;&#x8D39;&#x6027;&#x8D28;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x87FE;&#x870D;(<a href="http://www.hoptoadapp.com/">Hoptoad</a>)&#xFF0C;&#x5B83;&#x50A8;&#x5B58;&#x8FD9;&#x4E9B;&#x5F02;&#x5E38;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x7F51;&#x9875;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5F88;&#x53CB;&#x597D;&#x7684;&#x754C;&#x9762;&#x53BB;&#x8FDE;&#x63A5;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x5668;&#x6765;&#x53D6;&#x5F97;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/233/original/E187I02.png" width="800" height="442" alt="The Hoptoad application."/>
</div>
  <p>&#x6700;&#x540E;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x6EA2;&#x51FA;&#x5904;&#x7406;&#x4E13;&#x5BB6;(<a href="http://getexceptional.com/">Exceptional</a>)&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53BB;&#x5C1D;&#x8BD5;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</p>

<div class="imageWrapper">
  <img src="/system/photos/234/original/E187I03.png" width="800" height="442" alt="The Exceptional application."/>
</div>

<h3>&#x8C03;&#x8BD5;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h3>
  <p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CC;&#x5B89;&#x88C5;&#x6EA2;&#x51FA;&#x901A;&#x77E5;(exception notification)&#x63D2;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x5229;&#x7528;&#x5B83;&#x5728;&#x90AE;&#x7BB1;&#x91CC;&#x63A5;&#x53D7;&#x62A5;&#x9519;&#x90AE;&#x4EF6;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x770B;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre class="terminal">
  A NoMethodError occurred in ProductsController#create:
 
  undefined method `add_to&#x27; for #&lt;ActiveRecord::Errors:0x2480bdc&gt;
  [RAILS_ROOT]/app/models/product.rb:6:in `validate&#x27;
 
-------------------------------
Request:
-------------------------------
 
  * URL: http://localhost:3000/products
  * IP Address: 127.0.0.1
  * Parameters: {&quot;commit&quot;=&gt;&quot;Submit&quot;, &quot;authenticity_token&quot;=&gt;&quot;f8hYo4S/c6iJaTV9wVj6E0BjWyy1soIBQtMUbRB8Ms0=&quot;, &quot;product&quot;=&gt;{&quot;name&quot;=&gt;&quot;Headphones&quot;, &quot;price&quot;=&gt;&quot;-2&quot;}, &quot;action&quot;=&gt;&quot;create&quot;, &quot;controller&quot;=&gt;&quot;products&quot;}
  * Rails root: /Users/eifion/apps_for_asciicasts/ep187/store
 
-------------------------------
Session:
-------------------------------
 
  * session id: &quot;0956b27849e48cdbc6de94b89cf5cf14&quot;
  * data: {&quot;flash&quot;=&gt;{}}
</pre>
  <p>&#x5728;&#x8FD9;&#x4E2A;&#x901A;&#x77E5;&#x4E2D;&#x5B83;&#x6307;&#x51FA;&#x6211;&#x4EEC;&#x5728;&#x6211;&#x4EEC;&#x4EA7;&#x54C1;&#x7684;&#x6A21;&#x5757;&#x7684;&#x7B2C;&#x516D;&#x884C;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x3002;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x770B;&#x8D77;&#x6765;&#x662F;&#x76F8;&#x5F53;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x52A8;&#x624B;&#x53BB;&#x89E3;&#x51B3;&#x5B83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x505A;&#x8FD9;&#x4E2A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4E00;&#x4EFD;&#x6D4B;&#x8BD5;&#x7F3A;&#x9677;&#x8BA1;&#x5212;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x8FD9;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x6D4B;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x5E76;&#x4E14;&#x4F1A;&#x8003;&#x8651;&#x4E0D;&#x518D;&#x7EE7;&#x7EED;&#x67E5;&#x770B;&#x4EE3;&#x7801;&#x5E76;&#x6682;&#x65F6;&#x653E;&#x4E0B;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x5E76;&#x4E0D;&#x5728;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x4E5F;&#x5E94;&#x8BE5;&#x5199;&#x4E00;&#x4EFD;&#x8986;&#x76D6;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x8BA1;&#x5212;&#x3002;&#x6211;&#x4EEC;&#x8FC7;&#x4E00;&#x4F1A;&#x5C06;&#x8981;&#x5C55;&#x793A;&#x5728;&#x8FD9;&#x79CD;&#x7ED9;&#x4F60;&#x6700;&#x5927;&#x5E2E;&#x52A9;&#x4E0B;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x5F0F;&#x4E0B;&#x5199;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x8BA1;&#x5212;&#xFF0C;&#x6267;&#x884C;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x56F0;&#x96BE;&#x3002;</p>
  <p>&#x5373;&#x4F7F;&#x4F60;&#x5728;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F1A;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x9700;&#x6C42;&#x70B9;&#x5199;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x8BA1;&#x5212;&#x3002;&#x8FD9;&#x4E2A;&#x88AB;&#x62A5;&#x77E5;&#x7684;&#x9519;&#x8BEF;&#x4EA7;&#x751F;&#x539F;&#x56E0;&#x662F;&#x5728;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x4E0A;&#x5BF9;&#x4EA7;&#x54C1;&#x505A;&#x7684;&#x6D4B;&#x8BD5;&#x5B58;&#x5728;&#x7F3A;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x8FD9;&#x4E2A;&#x7F3A;&#x53E3;&#x4E2D;&#x6F0F;&#x6389;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x660E;&#x786E;&#x7684;&#x627E;&#x5230;&#x90A3;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x88AB;&#x5F88;&#x597D;&#x6D4B;&#x8BD5;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x3002;</p>
  <p>&#x9996;&#x5148;&#x4E00;&#x4EF6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6211;&#x4EEC;&#x5199;&#x4E00;&#x4EFD;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7F3A;&#x9677;&#x8BA1;&#x5212;&#x6765;&#x8986;&#x76D6;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x5C06;</p>

<p>&#x8981;&#x7528;Rails&#x27;&#x5185;&#x5D4C;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF0C;&#x6BD4;&#x5982;&#x9EC4;&#x74DC;&#x5207;&#x7247;&#x5668;&#xFF08;Cucumber&#xFF09;&#xFF0C;&#x6765;&#x505A;&#x8FD9;&#x4E2A;&#x3002;</p>
  <p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5C31;&#x80FD;&#x8C03;&#x51FA;&#x9519;&#x8BEF;</p>

<pre class="terminal">
script/generate integration_test exceptions
</pre> 
  <p>&#x8FD9;&#x5C06;&#x7ED9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x80FD;&#x653E;&#x8986;&#x76D6;&#x9519;&#x8BEF;&#x7684;&#x6D4B;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7528;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x9519;&#x8BEF;&#x7684;&#x6D4B;&#x8BD5;&#x53BB;&#x66FF;&#x4EE3;&#x9ED8;&#x8BA4;&#x6587;&#x4EF6;&#x4E2D;&#x653E;&#x9ED8;&#x8BA4;&#x6D4B;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<pre class="ruby">
require &#x27;test_helper&#x27;  

class ExceptionsTest &lt; ActionController::IntegrationTest   
  fixtures :all  
  
  test &quot;POST /products&quot; do  
    post &quot;/products&quot;, &quot;commit&quot; =&gt; &quot;submit&quot;, &quot;product&quot; =&gt;{&quot;name&quot;=&gt;&quot;Headphones&quot;, &quot;price&quot; =&gt; &quot;-2&quot;}   
    assert_response :success  
  end  
end 
</pre>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x540D;&#x5B57;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x547D;&#x540D;&#x89C4;&#x5219;&#x5373;&#x7528;&#x6211;&#x4EEC;&#x8BF7;&#x6C42;&#x7684;HTTP&#x548C;URL&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E00;&#x6EA2;&#x51FA;&#x53D1;&#x751F;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x53D1;&#x9001;&#x5230;<code>/products</code>&#x76EE;&#x5F55;&#x4E0B;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x901A;&#x77E5;&#x91CC;&#x7533;&#x8BF7;&#x7684;&#x5177;&#x4F53;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x8BE5;<code>controller</code>&#xFF0C;<code>action</code>&#x548C;<code>authenticity_token</code>&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5728;&#x901A;&#x77E5;&#x4E0A;&#x8BF7;&#x6C42;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x4E0A;&#x9762;&#x6709;&#x4E9B;&#x53C2;&#x6570;&#x88AB;&#x4F20;&#x9012;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9700;&#x8981;&#x4F20;&#x9012;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6765;&#x6A21;&#x62DF;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x5F53;&#x4E2D;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>

<p>&#x8FD0;&#x884C;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x53EA;&#x8981;&#x8FD0;&#x884C;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>

<pre class="terminal">
rake test:integration
</pre>
  <p>&#x5728;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre class="terminal">
1) Failure:
test_POST_/products(ExceptionsTest) [/test/integration/exceptions_test.rb:9]:
Expected response to be a &lt;:success&gt;, but was &lt;500&gt;
&lt;&quot;undefined method `add_to&#x27; for #&lt;ActiveRecord::Errors:0x1036bc4f8&gt;&quot;&gt;
 
1 tests, 1 assertions, 1 failures, 0 errors
</pre>
  <p>&#x8FD9;&#x4E2A;&#x8868;&#x793A;&#x5728;&#x6EA2;&#x51FA;&#x901A;&#x77E5;&#x4E0A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76F8;&#x540C;&#x7684;&#x9519;&#x8BEF;&#xFF1A;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x5B9A;&#x4E49; <code>add_to</code>&#x65B9;&#x6CD5;&#x7684;&#x9519;&#x8BEF;500&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x73B0;&#x6EA2;&#x51FA;&#x53D1;&#x751F;&#x7684;&#x6D4B;&#x8BD5;&#x3002;</p>
  <p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x8F7D;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x5931;&#x8D25;&#x65F6;&#x6CA1;&#x6709;&#x6808;&#x8DDF;&#x8E2A;&#x663E;&#x793A;&#x3002;&#x8FD9;&#x662F;&#x57FA;&#x4E8E;<a href="http://pastie.org/693810">Railscast</a>&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8FD9;&#x5757;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#x8FD9;&#x662F;&#x4E00;&#x5757;&#x975E;&#x5E38;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6B63;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x548C;&#x5B83;&#x53D1;&#x751F;&#x7684;&#x5730;&#x65B9;&#x7684;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<pre class="terminal">
1) Failure:
test_POST_/products(ExceptionsTest) [/test/integration/exceptions_test.rb:22]:
app/models/product.rb:6:in `validate&#x27;
app/controllers/products_controller.rb:16:in `create&#x27;
/test/integration/exceptions_test.rb:21:in `test_POST_/products&#x27;.
Expected response to be a &lt;:success&gt;, but was &lt;500&gt;
&lt;&quot;undefined method `add_to&#x27; for #&lt;ActiveRecord::Errors:0x1036bc188&gt;&quot;&gt;
</pre>
  <p>&#x8FD9;&#x4E2A;&#x7ED9;&#x6211;&#x4EEC;&#x8DB3;&#x591F;&#x7684;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x5728;&#x54EA;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x5B9A;&#x4F4D;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>

<pre class="ruby"> 
class Product &lt; ActiveRecord::Base   
  belongs_to :category  
  
  def validate   
    if price &lt; 0   
      errors.add_to :price, &quot;cannot be negative&quot;  
    end  
  end  
end  
</pre>
  <p>&#x8FD9;&#x4E2A;&#x5F53;&#x7136;&#x662F;&#x5E94;&#x8BE5;&#x6DFB;&#x52A0;<code>add_to</code>&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6362;&#x6210;&#x8FD9;&#x4E2A;&#x5E76;&#x4E14;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;,&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x5F53;&#x7136;&#x5E94;&#x8BE5;&#x5728;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#x5199;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x533A;&#x8986;&#x76D6;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x529F;&#x80FD;&#x70B9;&#x3002;</p> 
  <p>&#x5F53;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x6211;&#x4EEC;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x4E86;&#x3002;</p>
<pre class="terminal"> 
$ rake test:integration
(in /Users/eifion/rails/apps_for_asciicasts/ep187/store)
/System/Library/Frameworks/Ruby.framework/Versions/1.8/usr/bin/ruby -I&quot;lib:test&quot; &quot;/Library/Ruby/Gems/1.8/gems/rake-0.8.7/lib/rake/rake_test_loader.rb&quot; &quot;test/integration/exceptions_test.rb&quot; 
Loaded suite /Library/Ruby/Gems/1.8/gems/rake-0.8.7/lib/rake/rake_test_loader
Started
.
Finished in 0.188851 seconds.
 
1 tests, 1 assertions, 0 failures, 0 errors
</pre>
  <p>&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x4E86;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x7684;&#x5C1D;&#x8BD5;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x6765;&#x68C0;&#x67E5;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x5E76;&#x4E14;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x88AB;&#x89E3;&#x51B3;&#x4E86;&#x3002;</p>

<h3>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</h3>
  <p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x53E6;&#x5916;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x4EA7;&#x54C1;&#x63A7;&#x5236;&#x8005;&#x7684;&#x7F16;&#x8F91;&#x6A21;&#x677F;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>

<pre class="terminal">
A ActionView::TemplateError occurred in ProductsController#edit:
 
  undefined method `add_to&#x27; for #&lt;ActiveRecord::Errors:0x2480bdc&gt;
  [RAILS_ROOT]/app/views/products/edit.html.erb:6: syntax error, unexpected tIVAR, expecting &#x27;)&#x27;
...ncat(( link_to &quot;Show&quot; @product ).to_s); @output_buffer.conca...
                              ^) on line #6 of app/views/products/edit.html.erb:
    3: &lt;%= render :partial =&gt; &#x27;form&#x27; %&gt;
    4: 
    5: &lt;p&gt;
    6:   &lt;%= link_to &quot;Show&quot; @product %&gt; |
    7:   &lt;%= link_to &quot;View All&quot;, products_path %&gt;
    8: &lt;/p&gt;
 
        app/views/products/edit.html.erb:12:in `compile!&#x27;
 
 
-------------------------------
Request:
-------------------------------
 
  * URL: http://localhost:3000/products/8/edit
  * IP Address: 127.0.0.1
  * Parameters: {&quot;action&quot;=&gt;&quot;edit&quot;, &quot;controller&quot;=&gt;&quot;products&quot;, &quot;id&quot;=&gt;&quot;8&quot;}
  * Rails root: /Users/rbates/code/railscasts-episodes/episode-187/store
 
-------------------------------
Session:
-------------------------------
 
  * session id: &quot;0956b27849e48cdbc6de94b89cf5cf14&quot;
  * data: {&quot;flash&quot;=&gt;{}}
</pre>
  <p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5199;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x6765;&#x8986;&#x76D6;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x4E4B;&#x524D;&#x3002;&#x8FD9;&#x4E00;&#x6B21;&#x5931;&#x8D25;&#x7684;&#x8BF7;&#x6C42;&#x662F;GET&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;POST&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF0C;&#x53EA;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;URL&#x548C;&#x68C0;&#x67E5;&#x7684;&#x53CD;&#x5E94;&#x662F;200&#x3002;</p>
<pre class="ruby">
test &quot;GET /products/8/edit&quot; do  
  get &quot;/products/8/edit&quot;  
  assert_response :success  
end
</pre>  
  <p>&#x5F53;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF0C;&#x6D4B;&#x8BD5;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x4E0D;&#x662F;&#x90A3;&#x4E2A;&#x6211;&#x4EEC;&#x9884;&#x671F;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x88AB;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;404&#x66FF;&#x4EE3;&#x3002;</p>
<pre class="terminal">
1) Failure:
test_GET_/products/8/edit(ExceptionsTest) [/test/integration/exceptions_test.rb:26]:
Expected response to be a &lt;:success&gt;, but was &lt;404&gt;
</pre> 
  <p>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x5E93;&#x4E2D;<code>id</code>&#x4E3A;8&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7F16;&#x5199;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7684;&#x5C0F;&#x4F0E;&#x4FE9;&#xFF1A;&#x6709;&#x65F6;&#x6D4B;&#x8BD5;&#x5728;&#x67D0;&#x4E2A;&#x7ED3;&#x6784;&#x88AB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x5B9A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D4B;&#x8BD5;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x8BE5;&#x7ED3;&#x6784;&#x6765;&#x8BA9;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x6D4B;&#x8BD5;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x8FC7;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;session&#x53D8;&#x91CF;&#x6216;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x3002;</p>
  <p>&#x5728;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;Factories &#x673A;&#x5236;&#xFF08;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x56DE;&#x5230;<a href="http://asciicasts.com/episodes/158-factories-not-fixtures">158&#x7AE0;</a>&#xFF09;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x3002;&#x6211;&#x4EEC;&#x4E3A;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CC;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x5E76;&#x66F4;&#x6539;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x5728;&#x8C03;&#x7528;&#x521B;&#x5EFA;&#x8BE5;&#x4EA7;&#x54C1;&#x7684;&#x7F16;&#x8F91;&#x7F51;&#x9875;&#x3002;</p>
<pre class="ruby">
test &quot;GET /products/8/edit&quot; do  
  product = Product.first   
  get &quot;/products/#{product.id}/edit&quot;  
  assert_response :success  
end  
</pre>
  <p>&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x89C1;&#x8FD9;&#x4E2A;&#x9884;&#x6599;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>

<pre class="terminal">
1) Failure:
test_GET_/products/8/edit(ExceptionsTest) [/test/integration/exceptions_test.rb:27]:
Expected response to be a &lt;:success&gt;, but was &lt;500&gt;
&lt;&quot;compile error\n/Users/eifion/rails/apps_for_asciicasts/ep187/store/app/views/products/edit.html.erb:4: syntax error, unexpected tIVAR, expecting &#x27;)&#x27;\n...ncat(( link_to \&quot;Show\&quot; @product ).to_s); @output_buffer.conca...\n                              ^&quot;&gt;
</pre>
 
  <p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x89C6;&#x7A97;&#x91CC;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;<code>link_to</code>&#x8C03;&#x7528;&#x4E2D;&#x7F3A;&#x5C11;&#x4E86;&#x4E00;&#x4E2A;&#x9017;&#x53F7;&#x3002;</p>

<pre class="ruby">
&lt;% title &quot;Edit Product&quot; %&gt;   
&lt;%= render :partial =&gt; &#x27;form&#x27; %&gt;   
&lt;p&gt;   
  &lt;%= link_to &quot;Show&quot; @product %&gt;   
  &lt;%= link_to &quot;View All&quot;, products_path %&gt;   
&lt;/p&gt;  
</pre>
  <p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E76;&#x4E14;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x90A3;&#x4ED6;&#x4EEC;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5DF2;&#x7ECF;&#x628A;&#x6240;&#x6709;&#x5F02;&#x5E38;&#x90FD;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x4E60;&#x60EF;&#x4E8E;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x8FD9;&#x5C06;&#x5E26;&#x6765;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x63D0;&#x5347;&#x4F60;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x503C;&#x5F97;&#x53BB;&#x770B;&#x4E00;&#x770B;<a href="http://asciicasts.com/episodes/156-webrat">156&#x7AE0;</a>&#x7684;Webrat&#x3002;</p>