<p>&#x8FD9;&#x4E00;&#x96C6;&#x5C06;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x6388;&#x6743;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x57FA;&#x4E8E;&#x89D2;&#x8272;&#x7684;&#x6388;&#x6743;&#x673A;&#x5236;&#x3002;&#x901A;&#x8FC7;&#x5B83;&#xFF0C;&#x7528;&#x6237;&#x80FD;&#x591F;&#x88AB;&#x6307;&#x6D3E;&#x7ED9;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x89D2;&#x8272;&#x5C06;&#x7ED9;&#x4E88;&#x4ED6;&#x4EEC;&#x67D0;&#x4E9B;&#x8D2F;&#x7A7F;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x6743;&#x9650;&#x3002;&#x5168;&#x9762;&#x7684;&#x63CF;&#x8FF0;&#x6388;&#x6743;&#x662F;&#x4E00;&#x4E2A;<span>&#x68D8;&#x624B;&#x7684;&#x95EE;&#x9898;</span>&#x3002;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;<a href="http://steffenbartsch.com/blog/2008/08/rails-authorization-plugins/">&#x5B58;&#x5728;&#x592A;&#x591A;&#x7684;&#x6388;&#x6743;plugins&#x548C;gems</a>,&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x6240;&#x8C13;&#x7684;&#x6700;&#x4F73;&#x7684;&#x6388;&#x6743;&#x65B9;&#x6848;&#x5B9E;&#x9645;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6240;&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x578B;&#x3002;</p>

<p>&#x672C;&#x96C6;&#x7684;&#x7126;&#x70B9;&#x662F;<a href="http://github.com/stffn/declarative_authorization">declarative	authorization</a>,&#x66F4;&#x5148;&#x8FDB;&#x7684;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E4B;&#x4E00;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x5B83;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x9887;&#x4E3A;&#x590D;&#x6742;,&#x4F46;&#x53EA;&#x8981;&#x4ED8;&#x51FA;&#x5C11;&#x8BB8;&#x52AA;&#x529B;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x80FD;&#x5904;&#x7406;&#x8303;&#x56F4;&#x5E7F;&#x6CDB;&#x7684;&#x6388;&#x6743;&#x9700;&#x6C42;&#x3002;</p>

<h3>&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x52A0;&#x5165;&#x6388;&#x6743;</h3>
		<p>&#x5728;&#x672C;&#x96C6;&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x4E3B;&#x9875;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x7AE0;&#x5217;&#x8868;&#xFF0C;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x80FD;&#x591F;&#x62E5;&#x6709;&#x8BB8;&#x591A;&#x8BC4;&#x8BBA;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x5728;&#x6587;&#x7AE0;&#x672C;&#x8EAB;&#x7684;&#x9875;&#x9762;&#x4E0A;&#x3002;</p>

<div class="imageWrapper">
	<img alt="The home page of our blogging application." height="523" src="/system/photos/235/original/E188I01.png" width="824" />
</div>

		<p>&#x5F53;&#x524D;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x8BE5;&#x7F51;&#x7AD9;&#x7684;&#x7528;&#x6237;&#x90FD;&#x80FD;&#x591F;&#x7F16;&#x8F91;&#x6216;&#x5220;&#x9664;&#x4EFB;&#x610F;&#x7684;&#x6587;&#x7AE0;&#x6216;&#x8BC4;&#x8BBA;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x613F;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x89D2;&#x8272;&#x6765;&#x6388;&#x4E88;&#x4E0D;&#x540C;&#x7684;&#x529F;&#x80FD;&#x7EA7;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x7AD9;&#x70B9;&#x4E0A;&#x505A;&#x597D;&#x4E86;&#x6388;&#x6743;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x9876;&#x90E8;&#x90FD;&#x6709;&#x94FE;&#x63A5;&#x4EE5;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x6216;&#x767B;&#x5F55;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;Authlogic,&#x5B83;&#x5728;160&#x96C6;&#x91CC;&#x88AB;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FC7; [<a href="http://railscasts.com/episodes/160-authlogic">&#x89C2;&#x770B;</a>, <a href="http://asciicasts.com/episodes/160-authlogic">&#x9605;&#x8BFB;</a>]&#x3002;</p>

<p>&nbsp;&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x89D2;&#x8272;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>Role</code>&#x7684;&#x65B0;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>name</code>&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5C5E;&#x6027;&#x3002;<code>Role</code>&#x548C;<code>User</code>&#x6A21;&#x578B;&#x7ECF;&#x7531;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>Assignment</code>&#x7684;&#x8FDE;&#x63A5;&#x8868;,&#x901A;&#x8FC7;<code>has_many :through</code>&#x5173;&#x7CFB;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
		<p>&nbsp;&#x4E3A;&#x4E86;&#x7ED9;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x89D2;&#x8272;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4FEE;&#x6539;&#x6CE8;&#x518C;&#x8868;&#x5355;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BA9;&#x7528;&#x6237;&#x9009;&#x62E9;&#x4ED6;&#x4EEC;&#x89D2;&#x8272;&#x3002;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;&#x66FE;&#x5728;17&#x96C6; [<a href="http://asciicasts.com/episodes/160-authlogic">&#x89C2;&#x770B;</a>, <a href="http://asciicasts.com/episodes/17-habtm-checkboxes">&#x9605;&#x8BFB;</a>]&#x91CC;&#x63CF;&#x8FF0;&#x8FC7;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x590D;&#x9009;&#x6846;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x89D2;&#x8272;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x793A;&#x4F8B;&#x5E94;&#x7528;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>

<div class="imageWrapper">
	<img alt="The signup page showing the roles checkboxes." height="523" src="/system/photos/236/original/E188I02.png" width="824"/>
</div>
		<p>&#x6211;&#x4EEC;&#x7684;&#x4E09;&#x4E2A;&#x89D2;&#x8272;&#x5C06;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x9650;&#xFF1A;admin&#x89D2;&#x8272;&#x7684;&#x6210;&#x5458;&#x5C06;&#x88AB;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x3001;&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;moderators &#x5C06;&#x88AB;&#x5141;&#x8BB8;&#x7F16;&#x8F91;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x4F46;&#x6587;&#x7AE0;&#x4E0D;&#x884C;&#x3002;authors &#x5C06;&#x88AB;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x6587;&#x7AE0;&#x548C;&#x7F16;&#x8F91;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6CA1;&#x6709;&#x88AB;&#x6307;&#x5B9A;&#x4EFB;&#x4F55;&#x89D2;&#x8272;&#x7684;&#x7528;&#x6237;&#x5C06;&#x88AB;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x8BC4;&#x8BBA;&#x548C;&#x7F16;&#x8F91;&#x81EA;&#x5DF1;&#x7684;&#x8BC4;&#x8BBA;&#x3002;</p>

<h3>Declarative Authorization&#x5165;&#x95E8;</h3>
		<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x8FDB;&#x5165;&#x6B63;&#x9898;&#x5427;&#x3002;Declarative Authorization&#x53EF;&#x4EE5;&#x4ECE;GemCutter&#x4EE5;gem&#x7684;&#x5F62;&#x5F0F;&#x83B7;&#x5F97;&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x6B65;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684; <code>/config/environment.rb</code> &#x6587;&#x4EF6;&#x4E2D;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x7684;&#x5F15;&#x7528;&#x4EE5;&#x83B7;&#x53D6;&#x5B83;&#x3002;</p>

<pre class="ruby">
config.gem &quot;declarative_authorization&quot;, :source =&gt; &quot;http://gemcutter.org&quot;
</pre>

<p>&#x7136;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;gem&#x88AB;&#x5B89;&#x88C5;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8FD0;&#x884C;</p>
<pre class="terminal">
sudo rake gems:install
</pre>
		<p>&nbsp;&#x6211;&#x4EEC;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9A;&#x4E49;&#x7684;&#x89D2;&#x8272;&#x7684;&#x6743;&#x9650;&#x5C06;&#x88AB;&#x5B9A;&#x4E49;&#x5728;<code>/config</code>&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x540D;&#x4E3A;<code>authorization_rules.rb</code>&#x7684;&#x65B0;&#x6587;&#x4EF6;&#x4E2D;&#x3002;Declarative 
		Authorization&#x63D0;&#x4F9B;&#x5B83;&#x81EA;&#x5DF1;&#x7684;DSL&#x6765;&#x5B9A;&#x4E49;&#x89D2;&#x8272;&#x548C;&#x6743;&#x9650;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x5B83;&#x6765;&#x5B9A;&#x4E49;admin&#x7528;&#x6237;&#x7684;&#x6743;&#x9650;&#x3002;</p>

<pre class="ruby">
authorization do
  role :admin do
    has_permission_on [:articles, :comments], :to =&gt; [:index, :show, :new, :create, :edit, :update, :destroy]
  end
end
</pre>

<p>&#x89D2;&#x8272;&#x88AB;&#x5B9A;&#x4E49;&#x5728;&#x4E00;&#x4E2A;<code>authorization</code>&#x4EE3;&#x7801;&#x5757;&#x91CC;&#x3002;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#xFF0C;&#x540C;&#x65F6;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x5217;&#x51FA;&#x4E86;&#x89D2;&#x8272;&#x7684;&#x6743;&#x9650;&#x3002; 
		&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>has_permission_on</code>&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x6743;&#x9650;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;,&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x89D2;&#x8272;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x7684;&#x6A21;&#x578B;&#x5217;&#x8868;&#xFF0C;&#x540E;&#x8DDF;&#x4E00;&#x4E2A;<code>:to</code>&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x660E;&#x5728;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x4E0A;&#x5141;&#x8BB8;&#x7684;action&#x6E05;&#x5355;&#x3002;</p>
		<p>&nbsp;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7A0D;&#x5019;&#x5B9A;&#x4E49;&#x5176;&#x5B83;&#x7684;&#x89D2;&#x8272;&#x5E76;&#x4E14;&#x6D4B;&#x8BD5;&#x6211;&#x4EEC;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x6210;&#x679C;&#x3002;&#x4F46;&#x5728;&#x524D;&#x8FDB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x56E0;&#x4E3A;declarative 
		authorization&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x89D2;&#x8272;&#x662F;&#x600E;&#x6837;&#x88AB;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539; <code>User</code>&#x6A21;&#x578B;&#xFF0C;&#x589E;&#x52A0;&#x4E00;&#x4E2A;<code>role_symbols</code>&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x7B26;&#x53F7;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x7528;&#x6237;&#x6240;&#x5C5E;&#x7684;&#x89D2;&#x8272;&#x5217;&#x8868;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7684; 
		 <code>User</code>&#x6A21;&#x578B;&#x6709;&#x4E00;&#x4E2A;<code>admin</code>&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;&#x5982;&#x679C;&#x7528;&#x6237;&#x662F;&#x4E00;&#x4E2A;admin&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x5C5E;&#x4E8E;<code>:admin</code>&#x89D2;&#x8272;&#x3002;</p>

<pre class="ruby">
def role_symbols
  [:admin] if admin?
end
</pre>
		<p>&nbsp;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7279;&#x522B;&#x4E4B;&#x5904;&#x5728;&#x4E8E;<code>User</code>&#x548C;<code>Role</code>&#x4E4B;&#x95F4;&#x662F;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x7684;&#x89D2;&#x8272;&#x662F;&#x5728;&#x4ED6;&#x4EEC;&#x6CE8;&#x518C;&#x65F6;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x65E9;&#x5148;&#x770B;&#x5230;&#x7684;&#x590D;&#x9009;&#x6846;&#x6307;&#x5B9A;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728;<code>role_symbols</code> 

&#x4E2D;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x5F53;&#x524D;&#x7528;&#x6237;&#x7684;&#x89D2;&#x8272;&#x8F6C;&#x6362;&#x4E3A;&#x7B26;&#x53F7;&#x6570;&#x7EC4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>

<pre class="ruby">
def role_symbols
  roles.map do |role|
    role.name.underscore.to_sym
  end
end
</pre>

<p>Declarative authorization&#x73B0;&#x5728;&#x80FD;&#x591F;&#x5C06;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6240;&#x5C5E;&#x7684;&#x89D2;&#x8272;&#x6620;&#x5C04;&#x5230;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x5728;<code>authorization_rules</code>&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x4E0A;&#x4E86;&#x3002;</p>

		<p>&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x8981;&#x505A;&#x3002;&#x4E00;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x7684;<code>ApplicationController</code>&#x91CC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>before_filter</code>&#x6765;&#x544A;&#x8BC9;declarative authorization&#x5F53;&#x524D;&#x7528;&#x6237;&#x662F;&#x54EA;&#x4E2A;&#x3002;</p>

<pre class="ruby">
class ApplicationController &lt; ActionController::Base
  helper :all
  protect_from_forgery
  before_filter { |c| Authorization.current_user = c.current_user }
end
</pre>

<p>&nbsp;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5BF9;&#x6BCF;&#x4E2A;&#x63A7;&#x5236;&#x5668;&#x589E;&#x52A0;<code>before_filter</code> 

&#x6765;&#x9650;&#x5236;&#x8BBF;&#x95EE;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7531;declarative authorization&#x63D0;&#x4F9B;&#x7684;&#x540D;&#x4E3A;<code>filter_resource_access</code>&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x7ED9; 
		RESTful&#x98CE;&#x683C;&#x7684;&#x63A7;&#x5236;&#x5668;&#x589E;&#x52A0;&#x524D;&#x7F6E;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x540C;&#x65F6;&#x8FD8;&#x505A;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;&#x5F53;<code>filter_resource_access</code>&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x4F1A;&#x52A0;&#x8F7D;&#x5355;&#x4E2A;&#x8D44;&#x6E90;&#x6A21;&#x578B;&#x4EE5;&#x4FBF;&#x5B83;&#x80FD;&#x68C0;&#x67E5;&#x5BF9;&#x6B64;&#x6A21;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;<code>show</code>, <code>new</code>, <code>create</code>,
<code>edit</code>, <code>update</code> &#x548C; <code>delete</code> 
		&#x8FD9;&#x4E9B;action&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x79FB;&#x9664;&#x52A0;&#x8F7D;&#x6A21;&#x578B;&#x7684;&#x4EE3;&#x7801;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;<code>ArticlesController</code> 
		&#x548C; <code>CommentsController</code>&#x91CC;&#x90FD;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4EFB;&#x4F55;&#x63A7;&#x5236;&#x5668;&#x6CA1;&#x6709;&#x9075;&#x5FAA;RESTful&#x60EF;&#x4F8B;&#xFF0C;&#x6587;&#x6863;7&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x600E;&#x6837;&#x5904;&#x7406;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>

		<h3>&#x6D4B;&#x8BD5;&#x6211;&#x4EEC;&#x7684;&#x6210;&#x679C;</h3>
		<p>&#x81F3;&#x6B64;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x7EC8;&#x4E8E;&#x5230;&#x4E86;&#x80FD;&#x6D4B;&#x8BD5;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x53D6;&#x5F97;&#x7684;&#x6210;&#x679C;&#x7684;&#x9636;&#x6BB5;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;admin&#x89D2;&#x8272;&#x7684;&#x7528;&#x6237;&#x767B;&#x5F55;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x6240;&#x6709;&#x6587;&#x7AE0;&#xFF0C;&#x5E76;&#x4E14;&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x6587;&#x7AE0;&#x4E0E;&#x8BC4;&#x8BBA;&#x7684;&#x94FE;&#x63A5;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x4F46;&#x5F53;&#x6211;&#x4EEC;&#x6CE8;&#x9500;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF1A;</p>
		<div class="imageWrapper">
			<img alt="The error page shown when trying to access an unauthorized action." height="280" src="/system/photos/237/original/E188I03.png" width="803"/>
		</div>
		<p>&nbsp;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x4E86;&#x4E3B;&#x9875;&#xFF0C;&#x5373;&#x6587;&#x7AE0;&#x7D22;&#x5F15;&#x9875;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6CE8;&#x9500;&#x540E;&#xFF0C;&#x4F5C;&#x4E3A;guest&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;action&#x3002;&#x4E3A;&#x4E86;&#x4FEE;&#x590D;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;<code>authorization_rules</code>&#x6587;&#x4EF6;&#x4E2D;&#x4E3A;guest&#x589E;&#x52A0;&#x6743;&#x9650;&#x3002;guest&#x89D2;&#x8272;&#x662F;&#x4E00;&#x4E2A;&#x4E3A;&#x5C1A;&#x672A;&#x6CE8;&#x518C;&#x6216;&#x767B;&#x5F55;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x89D2;&#x8272;&#x7684;&#x7528;&#x6237;&#x4FDD;&#x7559;&#x7684;&#x7279;&#x6B8A;&#x89D2;&#x8272;&#x3002;</p>

<pre class="ruby" style="display: none;">authorization do
  role :admin do
    has_permission_on [:articles, :comments], :to =&gt; [:index, :show, :new, :create, :edit, :update, :destroy]
  end

  role :guest do
    has_permission_on :articles, :to =&gt; [:index, :show]
    has_permission_on :comments, :to =&gt; [:new, create]
  end
end
</pre>
		<p>&nbsp;&#x5728;guest&#x89D2;&#x8272;&#x4E2D;&#x6211;&#x4EEC;&#x8D4B;&#x4E88;&#x6765;&#x8BBF;&#x8005;&#x7684;&#x6743;&#x9650;&#x4F7F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6587;&#x7AE0;&#x7684;index&#x548C;show action&#x4EE5;&#x53CA;&#x8BC4;&#x8BBA;&#x7684;new&#x548C;create 		action&#x3002;&#x505A;&#x4E86;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x540E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6587;&#x7AE0;&#x5217;&#x8868;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
	<img alt="We can now see the home page again." height="302" src="/system/photos/238/original/E188I04.png" width="824"/>
</div>

<h3>&#x9690;&#x85CF;&#x7981;&#x6B62;&#x8BBF;&#x95EE;&#x7684;Action&#x7684;&#x94FE;&#x63A5;</h3>
		<p>&nbsp;&#x867D;&#x7136;guest&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x8BC4;&#x8BBA;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;action&#x7684;&#x94FE;&#x63A5;&#x8FD8;&#x663E;&#x793A;&#x5728;&#x90A3;&#x91CC;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x6B65;&#x8981;&#x505A;&#x7684;&#x662F;&#x79FB;&#x9664;&#x89D2;&#x8272;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x6267;&#x884C;&#x7684;action&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x89C6;&#x56FE;&#x4EE3;&#x7801;&#xFF0C;Declarative 
		authorization &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;<code>permitted_to? </code>&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;</p>

		<p>&nbsp;&#x5728; <code>ArticleController</code>&#x7684; show action 
		&#x5BF9;&#x5E94;&#x7684;&#x89C6;&#x56FE;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;<code>permitted_to?</code>&#x6765;&#x9690;&#x85CF;&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x6587;&#x7AE0;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x9664;&#x975E;&#x5F53;&#x524D;&#x7528;&#x6237;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x6743;&#x9650;&#x3002;</p>

<pre class="ruby">&lt;p&gt;
  &lt;% if permitted_to? :edit, @article %&gt;
    &lt;%= link_to &quot;Edit&quot;, edit_article_path(@article) %&gt; |
  &lt;% end %&gt;

  &lt;% if permitted_to? :destroy, @article %&gt;
    &lt;%= link_to &quot;Destroy&quot;, @article, :method =&gt; :delete, :confirm =&gt; &quot;Are you sure?&quot; %&gt; |
  &lt;% end %&gt;

  &lt;%= link_to &quot;Back to Articles&quot;, articles_path %&gt;
&lt;/p&gt;
</pre>

<p>&nbsp;<code>permitted_to?</code>&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x4E00;&#x4E2A;action &#x548C; 
		&#x4E00;&#x4E2A;model&#x7684;&#x540D;&#x79F0;&#x3002;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x66F4;&#x4E0B;&#x9762;&#x4E00;&#x70B9;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x505A;&#x7C7B;&#x4F3C;&#x7684;&#x4FEE;&#x6539;&#x4F7F;&#x5F97;&#x9664;&#x975E;&#x5F53;&#x524D;&#x7528;&#x6237;&#x80FD;&#x591F;&#x7F16;&#x8F91;&#x6216;&#x5220;&#x9664;&#x8BC4;&#x8BBA;&#xFF0C;&#x5426;&#x5219;&#x9690;&#x85CF;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#x3002;</p>

<pre class="ruby">
&lt;p&gt;
  &lt;% if permitted_to? :edit, comment %&gt;
    &lt;%= link_to &quot;Edit&quot;, edit_comment_path(comment) %&gt; |
  &lt;% end %&gt;

  &lt;% if permitted_to? :destroy, comment %&gt;
    &lt;%= link_to &quot;Destroy&quot;, comment, :method =&gt; :delete, :confirm =&gt; &quot;Are you sure?&quot; %&gt;
  &lt;% end %&gt;

&lt;/p&gt;
</pre>
		<p>&#x6211;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x5728;index&#x89C6;&#x56FE;&#x4E2D;&#x505A;&#x51FA;&#x7C7B;&#x4F3C;&#x4FEE;&#x6539;&#x6765;&#x9690;&#x85CF;&#x65B0;&#x5EFA;&#x6587;&#x7AE0;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>

<pre class="ruby">
&lt;% if permitted_to? :create, Article.new %&gt;
  &lt;p&gt;&lt;%= link_to &quot;New Article&quot;, new_article_path %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>&#x6CE8;&#x610F;&#xFF0C;&#x7531;&#x4E8E;&#x5728;index 		action&#x4E2D;&#x6CA1;&#x6709;&#x6587;&#x7AE0;&#x7684;&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>&#x4E86;Article.new</code>&#x6765;&#x4EE3;&#x66FF;&#x3002;</p>
		<p>&#x73B0;&#x5728;&#x5F53;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x9762;&#x9875;&#x65F6;&#xFF0C;&#x9664;&#x975E;&#x7528;&#x6237;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x5426;&#x5219;&#x7F16;&#x8F91;&#x548C;&#x5220;&#x9664;&#x7684;&#x94FE;&#x63A5;&#x5C06;&#x88AB;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;</p>
		<div class="imageWrapper">
			<img alt="The edit and destroy links are now hidden." height="431" src="/system/photos/239/original/E188I05.png" width="823"/>
		</div>
		<h3>&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x89D2;&#x8272;&#x548C;&#x89C4;&#x5219;</h3>

		<p>&#x73B0;&#x5728;&#x4E07;&#x4E8B;&#x4FF1;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>authorization_rules</code> 
&#x6587;&#x4EF6;&#x6765;&#x66F4;&#x6539;&#x7F51;&#x7AD9;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x7684;DSL&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E00;&#x4E9B;&#x76F8;&#x5F53;&#x9AD8;&#x7EA7;&#x7684;&#x89C4;&#x5219;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x5141;&#x8BB8;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x89D2;&#x8272;&#x7684;&#x767B;&#x5F55;&#x7528;&#x6237;&#x80FD;&#x4FEE;&#x6539;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;<code>:guest</code>&#x89D2;&#x8272;&#x589E;&#x52A0;&#x4E0B;&#x5217;&#x89C4;&#x5219;:</p>

<pre class="ruby">
role :guest do
  has_permission_on :articles, :to =&gt; [:index, :show]
  has_permission_on :comments, :to =&gt; [:new, :create]
  has_permission_on :comments, :to =&gt; [:edit, :update] do
    if_attribute :user =&gt; is { user }
  end
end
</pre>

<p>&nbsp;Declarative authorization&nbsp; &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;<code>if_attribute</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x4E3A;&#x6743;&#x9650;&#x589E;&#x52A0;&#x6761;&#x4EF6;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x6743;&#x9650;&#x53EA;&#x6709;&#x5728; <code>:user</code> &#x5C5E;&#x6027;&#xFF0C;&#x5373;&#x8BC4;&#x8BBA;&#x6240;&#x5C5E;&#x7684;&#x7528;&#x6237;&#x5C31;&#x662F;&#x5F53;&#x524D;&#x767B;&#x5F55;&#x7528;&#x6237;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x4F1A;&#x88AB;&#x6388;&#x4E88;&#x3002;</p>
		<p>&#x73B0;&#x5728;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4EE5;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x89D2;&#x8272;&#x7684;&#x7528;&#x6237;&#x767B;&#x5F55;&#x5E76;&#x7ED9;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x6DFB;&#x52A0;&#x4E00;&#x6761;&#x8BC4;&#x8BBA;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x5728;&#x90A3;&#x6761;&#x8BC4;&#x8BBA;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&quot;edit&quot;&#x94FE;&#x63A5;&#xFF0C;&#x4F46;&#x5728;&#x5176;&#x4ED6;&#x4EBA;&#x521B;&#x5EFA;&#x7684;&#x8BC4;&#x8BBA;&#x4E0A;&#x5219;&#x6CA1;&#x6709;&#x3002;</p>

<div class="imageWrapper">
	<img alt="The guest user can now edit the comments they have made." height="552" src="/system/photos/240/original/E188I06.png" width="823"/>
</div>
		<p>&nbsp;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x4E00;&#x5207;&#x5C31;&#x53EA;&#x8981;&#x5728;<code>authorization_rules</code>&#x6587;&#x4EF6;&#x4E2D;&#x505A;&#x4E00;&#x5904;&#x4FEE;&#x6539;,&#x8FD9;&#x663E;&#x793A;&#x4E86;&#x521B;&#x5EFA;&#x89C4;&#x5219;&#x662F;&#x591A;&#x4E48;&#x7B80;&#x5355;&#x3002;</p>

<h3>&#x4E3A;&#x5176;&#x5B83;&#x89D2;&#x8272;&#x589E;&#x52A0;&#x6743;&#x9650;</h3>
		<p>&#x6211;&#x4EEC;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521B;&#x5EFA;&#x4E86;3&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x53EA;&#x7ED9;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x4E86;&#x6743;&#x9650;&#xFF08;&#x9664;&#x4E86;guest&#x89D2;&#x8272;&#x4E4B;&#x5916;)&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x7ED9;&#x5176;&#x4ED6;&#x89D2;&#x8272;&#x589E;&#x52A0;&#x6743;&#x9650;&#x3002;</p>

<pre class="ruby">
role :moderator do
  includes :guest
  has_permission_on :comments, :to =&gt; [:edit,:update]
end

role :author do
  includes :guest
  has_permission_on :articles, :to =&gt; [:new, :create]
  has_permission_on :articles, :to =&gt; [:edit, :update] do
    if_attribute :user =&gt; is { user }
  end
end

</pre>
		<p>&#x6CE8;&#x610F;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;<code>includes</code>&#x65B9;&#x6CD5;&#x6765;&#x7ED9;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x6388;&#x4E88;&#x6765;&#x81EA;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x6743;&#x9650;&#x3002;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;moderator&#x89D2;&#x8272;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x505A;guest&#x7528;&#x6237;&#x80FD;&#x591F;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x6216;&#x66F4;&#x65B0;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x8BC4;&#x8BBA;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;authors&#x53EF;&#x4EE5;&#x505A;guest&#x80FD;&#x505A;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x6587;&#x7AE0;&#x548C;&#x66F4;&#x65B0;&#x4EFB;&#x4F55;&#x4E00;&#x7BC7;&#x4ED6;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x6587;&#x7AE0;&#x3002;</p>

<h3>&#x66F4;&#x53CB;&#x597D;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;</h3>
		<p>&nbsp;&#x5728;&#x7ED3;&#x675F;&#x672C;&#x96C6;&#x524D;&#x6211;&#x4EEC;&#x5C06;&#x7ED9;&#x5E94;&#x7528;&#x505A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x6B63;&#x5728;&#x67E5;&#x770B;&#x6211;&#x4EEC;&#x7F51;&#x7AD9;&#x4EBA;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x7684;action&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x9519;&#x8BEF;&#x9875;&#x9762;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x544A;&#x77E5;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x88AB;&#x5141;&#x8BB8;&#x90A3;&#x6837;&#x505A;&#x3002;</p>
		<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539; <code>ApplicationController</code>&#x6765;&#x6539;&#x8FDB;&#x5B83;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>permission_denied</code>&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x8BD5;&#x56FE;&#x8C03;&#x7528;&#x672A;&#x7ECF;&#x6388;&#x6743;&#x7684;action&#x65F6;&#x88AB;&#x6267;&#x884C;&#x3002;</p>


<pre class="ruby">
def permission_denied
  flash[:error] = &quot;Sorry, you not allowed to access that page.&quot;

  redirect_to root_url
end
</pre>
		<p>&nbsp;&#x73B0;&#x5728;&#x5F53;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x672A;&#x88AB;&#x5141;&#x8BB8;&#x7684;action&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x88AB;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x4E3B;&#x9875;&#x5E76;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x66F4;&#x53CB;&#x597D;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>

<div class="imageWrapper">
	<img alt="We now see a custom error when trying to access an unauthorized action." height="296" src="/system/photos/241/original/E188I07.png" width="823"/>
</div>

<p>&#x672C;&#x96C6;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x3002; Declarative authorization &#x4E3A;Rails&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x6388;&#x6743;&#x90E8;&#x5206;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x6D01;&#x6709;&#x529B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x4EC5;&#x662F;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x70B9;&#x76AE;&#x6BDB;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x7684;&#x8BDD;&#xFF0C;<a href="http://github.com/stffn/declarative_authorization">&#x6587;&#x6863;&#x9875;</a>&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x8BFB;&#x3002;</p>