<p>&#x8FD9;&#x4E00;&#x96C6;&#x6211;&#x4EEC;&#x6765;&#x7528;Paperclip&#x548C;jQuery&#x53EB;&#x505A;Jcrop&#x7684;&#x63D2;&#x4EF6;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x88C1;&#x526A;&#x56FE;&#x7247;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;Rails&#x5E94;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x8BBA;&#x575B;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x7528;&#x6237;&#x540D;&#x6CE8;&#x518C;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x5934;&#x50CF;&#x56FE;&#x7247;&#x6765;&#x5C55;&#x793A;&#x81EA;&#x5DF1;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/204/original/E182I01.png" width="800" height="389" alt="The new user page."/>
</div>

<p>&#x7528;&#x6237;&#x9009;&#x62E9;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5927;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5C06;&#x4F1A;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x5E76;&#x88C1;&#x526A;&#x5230;100&#x50CF;&#x7D20;&#x7684;&#x6B63;&#x65B9;&#x5F62;&#x4E4B;&#x5185;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/205/original/E182I02.png" width="803" height="427" alt="The users page showing the cropped avatar." />
</div>

<p>&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7528;<a href="http://github.com/thoughtbot/paperclip">Paperclip</a>&#x6765;&#x81EA;&#x52A8;&#x88C1;&#x526A;&#x548C;&#x8C03;&#x6574;&#x56FE;&#x7247;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x600E;&#x4E48;&#x53BB;&#x88C1;&#x526A;&#x56FE;&#x7247;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E9B;JavaScript&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x96C6;&#x5C31;&#x8981;&#x8BB2;&#x600E;&#x4E48;&#x6765;&#x505A;&#x3002;</p>

<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089;Paperclip&#xFF0C;&#x5728;134&#x96C6;&#x4E2D;&#x6DB5;&#x76D6;&#x4E86;Paperclip&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F60;&#x60F3;&#x7406;&#x89E3;&#x600E;&#x4E48;&#x7528;Paperclip&#x6765;&#x6DFB;&#x52A0;&#x9644;&#x4EF6;&#x5230;&#x4F60;&#x7684;Model&#x4E2D;&#xFF0C;&#x90A3;&#x4E00;&#x96C6;&#x662F;&#x503C;&#x5F97;&#x770B;&#x4E00;&#x4E0B;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x96C6;&#x4E5F;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x90A3;&#x4E00;&#x96C6;&#x4E4B;&#x4E0A;&#x7684;&#x3002;</p>

<p>&#x6709;&#x4E00;&#x4E9B;JavaScript&#x56FE;&#x7247;&#x88C1;&#x526A;&#x7684;&#x5E93;&#x53EF;&#x4EE5;&#x7528;&#xFF1B;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7528;&#x4E00;&#x4E2A;jQuery&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x53EB;&#x505A;<a href="http://deepliquid.com/content/Jcrop.html">Jcrop</a>&#x7684;&#x5E93;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4F7F;&#x7528;Prototype&#x548C;Scriptaculous&#x6765;&#x4EE3;&#x66FF;jQuery,<a href="http://www.defusion.org.uk/code/javascript-image-cropper-ui-using-prototype-scriptaculous/">JavaScript Image Cropper UI library</a>&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;</p>

<h3>&#x521B;&#x5EFA;&#x88C1;&#x526A;&#x9875;&#x9762;</h3>

<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;User Model&#x7528;&#x4E86;Paperclip&#x3002;</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base
  has_attached_file :avatar, :styles  =&gt; { :small =&gt; &quot;100x100#&quot; }
end
</pre>

<p>avatar&#x5C5E;&#x6027;&#x6709;&#x4E00;&#x4E2A;style&#x5C06;&#x4F1A;&#x628A;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x6210;100&#215;100&#x3002;&#x6211;&#x4EEC;&#x8981;&#x751F;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x663E;&#x793A;&#x7ED9;&#x7528;&#x6237;&#x8BA9;&#x4ED6;&#x88C1;&#x526A;&#x4ED6;&#x7684;&#x5934;&#x50CF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x7528;&#x6237;&#x663E;&#x793A;&#x539F;&#x59CB;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x662F;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x5927;&#x5C0F;&#x6216;&#x957F;&#x5BBD;&#x6BD4;&#xFF0C;&#x5E76;&#x4E14;&#x6253;&#x4E71;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x5E03;&#x5C40;&#x3002;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x6DFB;&#x52A0;&#x53E6;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x6837;&#x5F0F;&#x7684;&#x56FE;&#x7247;&#x8BA9;&#x7528;&#x6237;&#x6765;&#x88C1;&#x526A;&#x3002;</p>

<pre class="ruby">
has_attached_file :avatar, :styles  =&gt; { :small =&gt; &quot;100x100#&quot;, :large =&gt; &quot;500x500&gt;&quot; }
</pre>

<p>&#x8FD9;&#x4E2A;&#x65B0;&#x7684;large&#x6837;&#x5F0F;&#x5C06;&#x628A;&#x56FE;&#x7247;&#x8C03;&#x6574;&#x5230;500&#215;500&#x50CF;&#x7D20;&#x4E4B;&#x5185;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5728;&#x5927;&#x5C0F;&#x540E;&#x9762;&#x7528;&#x4E86;&#8221;<code>&gt;</code>&#8221;&#xFF0C;&#x8FD9;&#x6BD4;&#x7528;&#8221;<code>#</code>&#8221;&#x597D;&#xFF0C;Paperclip&#x5C06;&#x7EF4;&#x6301;&#x8FD9;&#x4E2A;&#x957F;&#x5BBD;&#x6BD4;&#xFF0C;&#x6240;&#x4EE5;&#x56FE;&#x7247;&#x4E0D;&#x4F1A;&#x88AB;&#x88C1;&#x526A;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4FEE;&#x6539;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x5E76;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x6216;&#x4FEE;&#x6539;&#x5934;&#x50CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x76F4;&#x63A5;&#x53BB;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x88C1;&#x526A;&#x4ED6;&#x4EEC;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x7684;&#x9875;&#x9762;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>UsersController</code>&#x4E2D;&#x7684;<code>create</code>&#x548C;<code>update</code> action&#xFF0C;&#x5E76;&#x4E14;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB;<code>crop</code>&#x7684;&#x65B0;action&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x5148;&#x4FEE;&#x6539;<code>create</code> action&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x5934;&#x50CF;&#xFF0C;&#x5C06;&#x76F4;&#x63A5;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x4EE5;&#x524D;&#x7684;&#x64CD;&#x4F5C;&#x9875;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x56FE;&#x7247;&#x4E0A;&#x4F20;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6E32;&#x67D3;<code>crop</code> action&#x3002;</p>

<pre class="ruby">
def create
  @user = User.new(params[:user])
  if @user.save
    flash[:notice] = &quot;Successfully created user.&quot;
    if params[:user][:avatar].blank?
      redirect_to @user
    else
      render :action =&gt; &#x27;crop&#x27;
    end
  else
    render :action =&gt; &#x27;new&#x27;
  end
end
</pre>

<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x66F4;&#x65B0;&#x540E;&#x5982;&#x679C;&#x6709;&#x65B0;&#x56FE;&#x7247;&#x4E0A;&#x4F20;&#x6211;&#x4EEC;&#x8981;&#x663E;&#x793A;<code>crop</code>&#x89C6;&#x56FE;&#x3002;</p>

<pre class="ruby">
def update
  @user = User.find(params[:id])
  if @user.update_attributes(params[:user])
    flash[:notice] = &quot;Successfully updated user.&quot;
    if params[:user][:avatar].blank?
      redirect_to @user
    else
      render :action =&gt; &#x27;crop&#x27;
    end
  else
    render :action =&gt; &#x27;edit&#x27;
  end
end
</pre>

<p>&#x6211;&#x4EEC;&#x5728;<code>/app/views/users/crop.html.erb</code>&#x521B;&#x5EFA;new&#x89C6;&#x56FE;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5C06;&#x9700;&#x8981;&#x5305;&#x542B;Jcrop&#x7528;&#x5230;&#x7684;css&#x548C;JavaScript&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x548C;&#x5305;&#x542B;jQuery&#x5E93;&#x4E00;&#x6837;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5E03;&#x5C40;&#x6587;&#x4EF6;&#x91CC;&#x5934;&#x90E8;&#x6709;&#x4E00;&#x4E2A;<code>yield</code>&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x4ECE;&#x89C6;&#x56FE;&#x6587;&#x4EF6;&#x5411;&#x9875;&#x9762;&#x7684;<code>head</code>&#x6BB5;&#x63D2;&#x5165;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x4E86;jQuery&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8FD9;&#x70B9;&#x3002;</p>

<pre class="ruby">
&lt;head&gt;
  &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;
  &lt;%= stylesheet_link_tag &#x27;application&#x27; %&gt;
  &lt;%= javascript_include_tag &#x27;jquery.1.3.2.min&#x27; %&gt;
  &lt;%= yield(:head) %&gt;
&lt;/head&gt;
</pre>

<p>&#x6211;&#x4EEC;&#x8981;&#x7ED9;&#x65B0;&#x9875;&#x9762;&#x4E00;&#x4E2A;&#x6807;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;<code>content_for</code>&#x5757;&#x6765;&#x653E;&#x6211;&#x4EEC;&#x6A21;&#x677F;&#x91CC;&#x8981;&#x4F20;&#x5230;head&#x6BB5;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x5C06;&#x7531;&#x4E00;&#x4E2A;Jcrop&#x7684;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x548C;JavaScript&#x6587;&#x4EF6;&#x7684;&#x94FE;&#x63A5;&#x6784;&#x6210;&#xFF0C;&#x6587;&#x4EF6;&#x6211;&#x4EEC;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x653E;&#x5230;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7684;&#x9002;&#x5F53;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5185;&#x8054;&#x7684;JavaScript&#x4E5F;&#x8981;&#x653E;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;JavaScript&#x5C06;&#x662F;id&#x4E3A;cropbox&#x7684;&#x5143;&#x7D20;&#x62E5;&#x6709;Jcrop&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x9875;&#x9762;&#x7684;body&#x4E2D;&#x6E32;&#x67D3;&#x56FE;&#x7247;&#x672C;&#x8EAB;&#xFF0C;&#x628A;&#x5B83;<code>id</code>&#x8BBE;&#x4E3A;<code>cropbox</code>&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5199;&#x7684;jQuery&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x4E86;&#x3002;</p>

<pre class="ruby">
&lt;% title &quot;Crop Avatar&quot; %&gt;
&lt;% content_for (:head) do %&gt;
&lt;%= stylesheet_link_tag &quot;jquery.Jcrop&quot; %&gt;
&lt;%= javascript_include_tag &quot;jquery.Jcrop.min&quot; %&gt;
&lt;script type=&quot;text/javascript&quot;&gt;
  $(function() {
    $(&#x27;#cropbox&#x27;).Jcrop();
  });
&lt;/script&gt;
&lt;% end %&gt;

&lt;%= image_tag @user.avatar.url(:large), :id =&gt; &quot;cropbox&quot; %&gt;
</pre>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7F16;&#x8F91;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x5E76;&#x4E14;&#x4E0A;&#x4F20;&#x4E00;&#x5F20;&#x65B0;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x88AB;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x54EA;&#x4E2A;&#x65B0;&#x7684;<code>crop</code> action&#xFF0C;&#x5728;&#x90A3;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x89C1;&#x90A3;&#x4E2A;&#x5927;&#x7684;500&#215;500&#x7248;&#x672C;&#x7684;&#x56FE;&#x7247;&#x6709;Jcrop&#x7684;&#x529F;&#x80FD;&#x3002;&#x5F53;&#x5149;&#x6807;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x9762;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x53D8;&#x6210;&#x5341;&#x5B57;&#x7EBF;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x62D6;&#x52A8;&#x8986;&#x76D6;&#x56FE;&#x7247;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9009;&#x62E9;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/206/original/E182I03.png" width="804" height="638" alt="Selecting part of the image."/>
</div>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x80FD;&#x9009;&#x62E9;&#x56FE;&#x7247;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x529E;&#x6CD5;&#x53BB;&#x88C1;&#x526A;&#x5B83;&#x3002;&#x8981;&#x60F3;&#x88C1;&#x526A;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x7ED9;&#x9875;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#xFF0C;&#x8868;&#x5355;&#x5305;&#x542B;&#x88C1;&#x526A;&#x56FE;&#x7247;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x76F8;&#x5BF9;&#x4E8E;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;x,y&#x5750;&#x6807;&#x503C;&#xFF0C;&#x548C;&#x548C;&#x4E00;&#x4E2A;&#8221;crop&#8221;&#x6309;&#x94AE;&#x3002;</p>

<p>&#x5934;&#x50CF;&#x662F;&#x4F5C;&#x4E3A;User&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65B0;&#x8868;&#x5355;&#x5C06;&#x4F1A;&#x4FEE;&#x6539;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;<code>User</code>&#x6A21;&#x578B;&#x4E2D;&#x65B0;&#x5EFA;&#x56DB;&#x4E2A;&#x65B0;&#x5C5E;&#x76F8;&#x6765;&#x653E;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x7684;&#x5750;&#x6807;&#x3002;</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base
  has_attached_file :avatar, :styles  =&gt; { :small =&gt; &quot;100x100#&quot;, :large =&gt; &quot;500x500&gt;&quot; }
  attr_accessor :crop_x, :crop_y, :crop_w, :crop_h
end
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8868;&#x5355;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x9690;&#x85CF;&#x5B57;&#x6BB5;&#x6765;&#x5B58;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F00;&#x53D1;&#x6211;&#x4EEC;&#x7684;&#x9875;&#x9762;&#x65F6;&#x5019;&#x7528;&#x6587;&#x672C;&#x6846;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x89C1;&#x90A3;&#x4E9B;&#x503C;&#x88AB;&#x5B58;&#x4F4F;&#x4E86;&#x3002;&#x8868;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x76F4;&#x63A5;&#x653E;&#x5728;crop&#x89C6;&#x56FE;&#x7684;&#x56FE;&#x7247;&#x4E0B;&#x9762;&#x3002;</p>

<pre class="ruby">
&lt;% form_for @user do |form| %&gt;
  &lt;% for attribute in [:crop_x, :crop_y, :crop_w, :crop_h] %&gt;
    &lt;%= form.text_field attribute, :id =&gt; attribute %&gt;
  &lt;% end %&gt;
  &lt;p&gt;&lt;%= form.submit &quot;Crop&quot; %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7ED9;&#x8868;&#x5355;&#x4E2D;&#x6BCF;&#x4E2A;&#x6587;&#x672C;&#x6846;&#x4E00;&#x4E2A;<code>id</code>&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;JavaScript&#x4E2D;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x3002;&#x8981;&#x5728;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5728;Jcrop&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x3002;</p>

<pre class="javascript">
$(function() {
  $(&#x27;#cropbox&#x27;).Jcrop({
    onChange: update_crop,
    onSelect: update_crop,
    setSelect: [0, 0, 500, 500],
    aspectRatio: 1
  });
});
</pre>

<p>Jcrop&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x4E8B;&#x4EF6;&#x56DE;&#x8C03;&#xFF0C;<code>onChange</code>&#x548C;<code>onSelect</code>&#xFF0C;&#x5F53;&#x9009;&#x62E9;&#x6539;&#x53D8;&#x6216;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x90FD;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x5B9A;&#x4E49;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;<code>setSelect</code>&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x6700;&#x521D;&#x7684;&#x7684;&#x88C1;&#x526A;&#x77E9;&#x5F62;&#xFF0C;&#x548C;<code>aspectRatio</code>&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x88C1;&#x526A;&#x77E9;&#x5F62;&#x7684;&#x957F;&#x5BBD;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x4E3A;1&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x6709;&#x6B63;&#x65B9;&#x5F62;&#x53EF;&#x4EE5;&#x88AB;&#x9009;&#x62E9;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5199;<code>update_crop</code>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x662F;&#x4F20;&#x9012;&#x5750;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x4ECE;&#x4E2D;&#x80FD;&#x63D0;&#x53D6;&#x51FA;<code>x</code>, <code>y</code>, <code>width</code>&#x548C;<code>height</code>&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x4F20;&#x5230;&#x9002;&#x5F53;&#x7684;&#x8868;&#x5355;&#x5B57;&#x6BB5;&#x91CC;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x76F4;&#x63A5;&#x8DDF;&#x5728;&#x4E0A;&#x9762;&#x51FD;&#x6570;&#x7684;&#x4E0B;&#x9762;&#x3002;</p>

<pre class="javascript">
function update_crop(coords) {
  $(&#x27;#crop_x&#x27;).val(coords.x);
  $(&#x27;#crop_y&#x27;).val(coords.y);
  $(&#x27;#crop_w&#x27;).val(coords.w);
  $(&#x27;#crop_h&#x27;).val(coords.h);  
}
</pre>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x8868;&#x5355;&#x7684;&#x5B57;&#x6BB5;&#x90FD;&#x6709;&#x8868;&#x793A;&#x4F46;&#x524D;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x7684;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x79FB;&#x52A8;&#x5E76;&#x8C03;&#x6574;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x6846;&#x4E2D;&#x7684;&#x503C;&#x5C06;&#x4F1A;&#x6539;&#x53D8;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/207/original/E182I04.png" width="800" height="730" alt="The coordinates of the cropped image are now shown in the text fields."/>
</div>

<p>&#x5F53;&#x6211;&#x4EEC;&#x70B9;&#x51FB;&#8221;crop&#8221;&#x6309;&#x94AE;&#x7684;&#x65F6;&#x5019;&#xFF0C;<code>User</code>&#x6A21;&#x578B;&#x88AB;&#x66F4;&#x65B0;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x88C1;&#x526A;&#x540E;&#x9700;&#x8981;&#x544A;&#x8BC9;Paperclip&#x91CD;&#x65B0;&#x5904;&#x7406;&#x9644;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>after_update</code>&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x8FC7;&#x8FC7;&#x6EE4;&#x5668;&#x5C06;&#x91CD;&#x65B0;&#x5904;&#x7406;&#x56FE;&#x7247;&#x3002;</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base
  has_attached_file :avatar, :styles  =&gt; { :small =&gt; &quot;100x100#&quot;, :large =&gt; &quot;500x500&gt;&quot; }
  attr_accessor :crop_x, :crop_y, :crop_w, :crop_h
  after_update :reprocess_avatar, :if =&gt; :cropping?

  def cropping?
    !crop_x.blank? &amp;&amp; !crop_y.blank? &amp;&amp; !crop_w.blank? &amp;&amp; !crop_h.blank?
  end

  private
  def reprocess_avatar
    avatar.reprocess!
  end
end
</pre>

<p>&#x5982;&#x679C;&#x56DB;&#x4E2A;&#x88C1;&#x526A;&#x53C2;&#x6570;&#x4ECE;&#x8868;&#x5355;&#x4F20;&#x9012;&#x8FC7;&#x6765;&#xFF0C;<code>after_update</code>&#x8FC7;&#x6EE4;&#x5668;&#x5C06;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5982;&#x679C;&#x6709;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x6709;&#x503C;&#xFF0C;Paperclip&#x7684;<code>reprocess!</code>&#x65B9;&#x6CD5;&#x5C06;&#x88AB;&#x8C03;&#x7528;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x544A;&#x8BC9;Paperclip&#x600E;&#x4E48;&#x53BB;&#x7528;&#x8868;&#x5355;&#x4F20;&#x6765;&#x7684;&#x5750;&#x6807;&#x91CD;&#x65B0;&#x5904;&#x7406;&#x56FE;&#x7247;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;Paperclip processor&#xFF0C;&#x5728;&#x90A3;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x8981;&#x5728;<code>User</code>&#x6A21;&#x578B;&#x91CC;&#x6307;&#x5B9A;processor&#x3002;</p>

<pre class="ruby">
has_attached_file :avatar, :styles  =&gt; { :small =&gt; &quot;100x100#&quot;, :large =&gt; &quot;500x500&gt;&quot; }, :processors =&gt; [:cropper]
</pre>

<p>&#x4E60;&#x60EF;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;processor&#x653E;&#x5728;/lib&#x4E0B;&#x9762;&#x7684;<code>paperclip_processors</code>&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x521B;&#x5EFA;&#x90A3;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5E76;&#x5728;&#x91CC;&#x9762;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;<code>cropper.rb</code>&#x6587;&#x4EF6;&#xFF0C;&#x91CC;&#x9762;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF1A;</p>

<pre class="ruby">
module Paperclip
  class Cropper &lt; Thumbnail
    def transformation_command
      if crop_command
        crop_command + super.sub(/ -crop \S+/, &#x27;&#x27;)
      else
        super
      end
    end

    def crop_command
      target = @attachment.instance
      if target.cropping?
        &quot; -crop #{target.crop_w}x#{target.crop_h}+#{target.crop_x}+#{target.crop_y}&quot;
      end
    end
  end
end
</pre>

<p>&#x81EA;&#x5B9A;&#x4E49;&#x7684;Paperclip processor&#x653E;&#x5728;<code>Paperclip</code>&#x6A21;&#x5757;&#x91CC;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x7684;processor&#x7EE7;&#x627F;<code>Paperclip</code>&#x9ED8;&#x8BA4;&#x7684;processor,<code>Thumbnail</code> processor&#x3002;<code>Thumbnail</code>&#x6709;&#x4E00;&#x4E2A;<code>transformation_command</code>&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8986;&#x76D6;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x52A0;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x547D;&#x4EE4;&#x53C2;&#x6570;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;<code>transformation_command</code>&#x65B9;&#x6CD5;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x68C0;&#x67E5;&#x5B58;&#x5728;&#x7684;&#x88C1;&#x526A;&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x57FA;&#x4E8E;<code>User</code>&#x6A21;&#x578B;&#x4E2D;&#x5C5E;&#x76F8;&#x7684;&#x547D;&#x4EE4;&#x6765;&#x66FF;&#x4EE3;&#x3002;</p>

<h3>&#x9009;&#x62E9;&#x56FE;&#x7247;&#x4E2D;&#x6B63;&#x786E;&#x7684;&#x90E8;&#x5206;</h3>

<p>&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5199;&#x5B8C;&#x6211;&#x4EEC;&#x7684;processor&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x88C1;&#x526A;&#x6211;&#x4EEC;&#x7684;&#x56FE;&#x7247;&#x4E86;&#xFF0C;&#x770B;&#x770B;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x662F;&#x4E0D;&#x662F;&#x548C;&#x9884;&#x671F;&#x7684;&#x4E00;&#x6837;&#x3002;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x8F66;&#x5B50;&#x5E76;&#x6309;&#x4E0B;&#8221;crop&#8221;&#x6309;&#x94AE;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/208/original/E182I05.png" width="800" height="726" alt="Selecting part of the image for cropping."/>
</div>

<p>&#x7ED3;&#x679C;&#x57FA;&#x672C;&#x6B63;&#x786E;&#xFF0C;&#x56FE;&#x7247;&#x88AB;&#x88C1;&#x526A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/209/original/E182I06.png" width="800" height="438" alt="The wrong copped area is selected."/>
</div>


<p>&#x8FD9;&#x4E2A;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x662F;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x770B;&#x89C1;&#x7684;&#x56FE;&#x7247;&#x662F;<code>large</code>&#x6837;&#x5F0F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x5DF2;&#x7ECF;&#x8C03;&#x6574;&#x8FC7;&#x5927;&#x5C0F;&#x4E86;&#xFF0C;&#x88C1;&#x526A;&#x5750;&#x6807;&#x662F;&#x7ED9;&#x4E88;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x3002;Paperclip&#x88C1;&#x526A;&#x7684;&#x56FE;&#x7247;&#x662F;&#x539F;&#x59CB;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x4E2D;&#x8865;&#x5145;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4F7F;&#x56FE;&#x7247;&#x6B63;&#x786E;&#x88C1;&#x526A;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;Paperclip&#x7684;<code>Geometry.from_file</code>&#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;<code>User</code>&#x6A21;&#x578B;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x5F97;&#x5230;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x5E76;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x53D8;&#x91CF;&#x91CC;&#x9762;&#x3002;</p>

<pre class="ruby">
def avatar_geometry(style = :original)
  @geometry ||= {}
  @geometry[style] ||= Paperclip::Geometry.from_file(avatar.path(style))
end
</pre>

<p>&#x5728;<code>crop</code>&#x89C6;&#x56FE;&#x91CC;&#x9762;&#x6211;&#x4EEC;&#x80FD;&#x4FEE;&#x6539;&#x5F53;&#x88C1;&#x526A;&#x9009;&#x62E9;&#x6539;&#x53D8;&#x65F6;&#x8BBE;&#x7F6E;&#x8868;&#x5355;&#x503C;&#x7684;JavaScript&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8003;&#x8651;&#x5230;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x5BBD;&#x5EA6;&#x548C;&#x88C1;&#x526A;&#x8FC7;&#x7684;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x5EA6;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x5E76;&#x7528;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x628A;&#x6240;&#x6709;&#x503C;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x3002;</p>

<pre class="javascript">
function update_crop(coords) {
  var ratio = &lt;%= @user.avatar_geometry(:original).width %&gt; / &lt;%= @user.avatar_geometry(:large).width %&gt;; 
  $(&#x27;#crop_x&#x27;).val(Math.floor(coords.x * ratio));
  $(&#x27;#crop_y&#x27;).val(Math.floor(coords.y * ratio));
  $(&#x27;#crop_w&#x27;).val(Math.floor(coords.w * ratio));
  $(&#x27;#crop_h&#x27;).val(Math.floor(coords.h * ratio));  
}
</pre>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x8F66;&#x7684;&#x524D;&#x9762;&#x5E76;&#x88C1;&#x526A;&#xFF0C;&#x56FE;&#x7247;&#x7684;&#x6B63;&#x786E;&#x533A;&#x57DF;&#x5C31;&#x88AB;&#x88C1;&#x526A;&#x4E86;&#x3002;</p>

<div class="imageWraper">
  <img src="/system/photos/210/original/E182I07.png" width="800" height="429" alt="The correct area is now selected."/>
</div>

<h3>&#x6DFB;&#x52A0;&#x9884;&#x89C8;&#x56FE;&#x7247;</h3>

<p>&#x8FD9;&#x4E00;&#x96C6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x88C1;&#x526A;&#x9875;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9884;&#x89C8;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5207;&#x7684;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x5934;&#x50CF;&#x662F;&#x4E0D;&#x662F;&#x548C;&#x70B9;&#x51FB;crop&#x6309;&#x94AE;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#x3002;</p>

<p>&#x56DE;&#x5230;<code>crop</code>&#x89C6;&#x56FE;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x5927;&#x56FE;&#x7247;&#x548C;&#x8868;&#x5355;&#x4E4B;&#x95F4;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9884;&#x89C8;&#x6BB5;&#x843D;&#x3002;&#x5728;&#x6BB5;&#x843D;&#x91CC;&#x8FD8;&#x662F;&#x663E;&#x793A;&#x5927;&#x56FE;&#x4F46;&#x662F;&#x7528;&#x4E00;&#x4E2A;div&#x6765;&#x9650;&#x5B9A;100&#215;100&#x50CF;&#x7D20;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x9690;&#x85CF;&#x6389;&#x591A;&#x51FA;&#x6765;&#x7684;&#x90E8;&#x5206;&#x3002;&#x73B0;&#x5728;&#x663E;&#x793A;&#x5750;&#x6807;&#x7684;&#x6587;&#x672C;&#x6846;&#x53EF;&#x4EE5;&#x7528;&#x9690;&#x85CF;&#x7684;&#x5B57;&#x6BB5;&#x6765;&#x66FF;&#x4EE3;&#x4E86;&#x3002;</p>

<pre class="ruby">
&lt;%= image_tag @user.avatar.url(:large), :id =&gt; &quot;cropbox&quot; %&gt;

&lt;h4&gt;Preview&lt;/h4&gt;
&lt;div style=&quot;width: 100px; height: 100px; overflow: hidden;&quot;&gt;
  &lt;%= image_tag @user.avatar.url(:large), :id =&gt; &quot;preview&quot; %&gt;
&lt;/div&gt;

&lt;% form_for @user do |form| %&gt;
  &lt;% for attribute in [:crop_x, :crop_y, :crop_w, :crop_h] %&gt;
    &lt;%= form.hidden_field attribute, :id =&gt; attribute %&gt;
  &lt;% end %&gt;
  &lt;p&gt;&lt;%= form.submit &quot;Crop&quot; %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>&#x6211;&#x4EEC;&#x7ED9;&#x9884;&#x89C8;&#x56FE;&#x7247;&#x4E00;&#x4E2A;<code>id</code>&#x53EB;<code>preview</code>,&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;JavaScript&#x91CC;&#x5F15;&#x7528;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x4FEE;&#x6539;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x88C1;&#x526A;&#x533A;&#x57DF;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x9884;&#x89C8;&#x56FE;&#x7247;&#x3002;</p>

<pre class="javascript">
function update_crop(coords) {
  var rx = 100/coords.w;
  var ry = 100/coords.h;
  $(&#x27;#preview&#x27;).css({
    width: Math.round(rx * &lt;%= @user.avatar_geometry(:large).width %&gt;) + &#x27;px&#x27;,
    height: Math.round(ry * &lt;%= @user.avatar_geometry(:large).height %&gt;) + &#x27;px&#x27;,
    marginLeft: &#x27;-&#x27; + Math.round(rx * coords.x) + &#x27;px&#x27;,
    marginTop: &#x27;-&#x27; + Math.round(ry * coords.y) + &#x27;px&#x27;
  });

  var ratio = &lt;%= @user.avatar_geometry(:original).width %&gt; / &lt;%= @user.avatar_geometry(:large).width %&gt;; 
  $(&#x27;#crop_x&#x27;).val(Math.floor(coords.x * ratio));
  $(&#x27;#crop_y&#x27;).val(Math.floor(coords.y * ratio));
  $(&#x27;#crop_w&#x27;).val(Math.floor(coords.w * ratio));
  $(&#x27;#crop_h&#x27;).val(Math.floor(coords.h * ratio));  
}
</pre>

<p>&#x88C1;&#x526A;&#x533A;&#x57DF;&#x4E00;&#x6539;&#x53D8;&#xFF0C;&#x9884;&#x89C8;&#x56FE;&#x7247;&#x5C31;&#x4F1A;&#x8DDF;&#x7740;&#x66F4;&#x65B0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x88C1;&#x526A;&#x7684;&#x6B63;&#x65B9;&#x5F62;&#x62D6;&#x52A8;&#x6216;&#x6539;&#x53D8;&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x65F6;&#x5730;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x5934;&#x50CF;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/211/original/E182I08.png" width="815" height="807" alt="The cropped area now shows as a live preview."/>
</div>

<p>&#x8FD9;&#x4E00;&#x96C6;&#x5C31;&#x5230;&#x8FD9;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x4E00;&#x770B;jschwindt github&#x4E0A;&#x7684;<a href="http://github.com/jschwindt/rjcrop">rjcrop</a>&#x9879;&#x76EE;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;Rails&#x5E94;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x8FD9;&#x770B;&#x5230;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x3002;</p>