<p>En el episodio anterior, explicamos como mostrar u ocultar los links de administraci&oacute;n dependiendo si el usuario actual es un administrador. Lo hicimos escribiendo un m&eacute;todo booleano llamado <code>admin?</code> en nuestro <code>ApplicationController</code>. Si el m&eacute;todo <code>admin?</code> devuelve <code>true</code>  entonces los links eran mostrados sino eran ocultos. Dejamos este m&eacute;todo devolviendo <code>true</code> de forma predeterminada. Vamos a terminar de escribir este m&eacute;todo y dar una forma para los usuarios administradores de loguearse al sitio.</p>

<h3>Hay m&aacute;s de una forma de conseguirlo</h3>

<p>Hay muchas formas diferentes de implementar un sistema de logueo. Podr&iacute;amos implementar un sistema de registraci&oacute;n de usuario con un modelo <code>User</code>, una p&aacute;gina de registraci&oacute;n y todo lo dem&aacute;s. Pero si pensamos seguir este camino, existe un excelente plugin para descargar <sup><a href="#fn1">1</a></sup>   llamado <code>restful_authentication</code>, que es una versi&oacute;n actualizada de <code>acts_as_authenticated</code>. Una vez instalado, el modelo User y el controlador llamado Sessions pueden ser generados de la siguiente forma:</p>

<pre class="terminal">
$script/plugin install git://github.com/technoweenie/restful-authentication.git restful_authentication
$script/generate authenticated User sessions
$rake db:migrate
</pre>

<p>No vamos a utilizar Restful Authentication. El plugin <code>restful_authentication</code> va a ser discutido con mayor detalle en el episodio 67.</p>

<p>Nuestro sitio es tan simple que todo el sistema de administraci&oacute;n de usuarios no es necesario. Solamente,  vamos a necesitar administrar los episodios en el sitio, asi que vamos a continuar con un m&eacute;todo un poco m&aacute;s directo que no requiere un modelo User o plugins. Si quisi&eacute;ramos hacerlo realmente simple, podr&iacute;amos restringir el acceso por direcci&oacute;n IP y escribir nuestro m&eacute;todo &#x27;<code>admin?</code>&#x27; de la siguiente forma.</p>

<pre class="ruby">
def admin  
  request.remote_ip == &quot;127.0.0.1&quot;  
end  
</pre>

<p>Esto es un poco limitante, debido a que asume que nuestra conexi&oacute;n a Internet tiene una direcci&oacute;n IP est&aacute;tica y que siempre se va a querer administrar el sitio cuando se ingresa desde esa direcci&oacute;n IP. En cambio, vamos a hacer una simple p&aacute;gina de login  que tomor&aacute; una clave. Si la clave que se ingresa es correcta, entonces el usuario ver&aacute; links de administraci&oacute;n.</p>

<div class="imageWrapper">
  <img src="/system/photos/18/original/E021I01.png" width="742" height="254" alt="The login page." />
  <p class="title">Nuesta b&aacute;sica p&aacute;gina de login.</p>
</div>

<p>Para hacer esto, vamos a generar un controlador de Sesi&oacute;n. El c&oacute;digo ser&iacute;a:</p>

<pre class="ruby">
class SessionsController &lt; ApplicationController  
  def new  
  end  

  def create  
    session[:password] = params[:password]  
    flash[:notice] = &rsquo;Successfully logged in&rsquo;  
    redirect_to home_path  
  end  
    
  def destroy  
    reset_session  
    flash[:notice] = &rsquo;Successfully logged out&rsquo;  
    redirect_to login_path  
  end  
end  
</pre>

<p>Tambi&eacute;n, hay una nueva vista b&aacute;sica en la carpeta <code>/views/sessions</code>.</p>

<pre class="ruby">
&lt;% form_tag sessions_path do %&gt;  
  Password: &lt;%= password_field_tag :password %&gt;  
  &lt;%= submit_tag &quot;Login&quot; %&gt;  
&lt;% end %&gt;  
</pre>

<p>El formulario es enviado a la acci&oacute;n <code>create</code> que almacena la clave ingresada en la sesi&oacute;n, y luego redirecciona a la p&aacute;gina de inicio. En nuestro m&eacute;todo <code>admin?</code>, vamos a comparar la clave de la sesi&oacute;n con la clave correcta y devolveremos true si coinciden</p>

<pre class="ruby">
def admin?  
  session[:password] == &quot;secret&quot;  
end  
</pre>

<h3>&iexcl;Listo!</h3>

<p>Nuestra p&aacute;gina b&aacute;sica de login est&aacute; terminada. No es tan sofisticada como un sistema completo de administraci&oacute;n de usuarios como el que da Restful Authentication, pero es lo suficientemente bueno para servir para nuestro simple sitio.<sup><a href="#fn2">2</a></sup></p>

<p>Finalmente, en caso que se pregunte como le asignamos la url &#x27;/login&#x27; a la p&aacute;gina login, lo hacemos agregando estas dos rutas en <code>routes.rb</code>.</p>

<pre class="ruby">
map.connect &rsquo;login&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;create&rsquo;  
map.connect &rsquo;logout&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;destroy&rsquo;  
</pre>

<h3>Notas</h3>
<ol class="footnotes">
  <li id="fn1"><a href="http://github.com/technoweenie/restful-authentication/tree/master">http://github.com/technoweenie/restful-authentication/tree/master</a></li>
  <li id="fn2">Cabe mencionar la existencia de Devise (<a href="http://github.com/plataformatec/devise">http://github.com/plataformatec/devise</a>) que es explicado con mayor detalle en los episodios <a href="http://es.asciicasts.com/episodes/209-introduccion-a-devise">209</a> y <a href="http://es.asciicasts.com/episodes/210-personalizacion-de-devise">210</a>.</li>
</ol>