<p>Dans l'épisode précédent, nous vous avons montré comment afficher ou cacher nos liens d'administration en fonction du
statut de l'utilisateur courant. Pour ceci, on a écrit une méthode booléenne appelée <code>admin?</code> dans
<code>ApplicationController</code>. Si <code>admin?</code> retourne <code>true</code> alors les liens sont visibles,
sinon ils sont cachés. Nous avons laissé la méthode retourner <code>false</code>; ce dont on a besoin c'est de finir
d'écrire la méthode et fournir aux administrateurs un moyen de se connecter au site.</p>

<h3>Il y a plus d&#x27;une fa&ccedil;on de le faire</h3>
<p>Il y a beaucoup de fa&ccedil;ons diff&eacute;rentes d&#x27;impl&eacute;menter un syst&egrave;me de connexion. Nous pourrions impl&eacute;menter un enregistrement complet d&#x27;utilisateur avec un mod&egrave;le <code>User</code>, une page d&#x27;inscription et ainsi de suite. Si nous &eacute;tions partis pour adopter cette approche, il existe un excellent plugin appel&eacute; <code>restful_authentication</code>, qui est une version am&eacute;lior&eacute;e de <code>acts_as_authenticated</code>, disponible au t&eacute;l&eacute;chargement.<sup><a href="#fn1">1</a></sup> Une fois install&eacute;, le mod&egrave;le <code>User</code> et un contr&ocirc;leur <code>Sessions</code> peuvent &ecirc;tre g&eacute;n&eacute;r&eacute; comme ceci :</p>
<pre class="terminal">
$script/plugin install git://github.com/technoweenie/restful-authentication.git restful_authentication
$script/generate authenticated User sessions
$rake db:migrate
</pre>
<p>Nous n&#x27;allons pas utiliser Restful Authentication ici. Le plugin <code>restful_authentication</code> sera abord&eacute; plus en d&eacute;tail dans l&#x27;&eacute;pisode 67.</p>

<p>Notre site est si simple qu&#x27;un syst&egrave;me complet n&#x27;est pas n&eacute;cessaire. Nous avons seulement besoin de g&eacute;rer les &eacute;pisodes du site, donc nous allons adopter une approche plus directe qui ne n&eacute;cessite pas de mod&egrave;le <code>User</code> ou de plugins. Si nous voulions prendre une approche vraiment simple nous pourrions restreindre l&#x27;acc&egrave;s gr&acirc;ce &agrave; l&#x27;adresse IP et &eacute;crire notre m&eacute;thode <code>admin?</code> comme ceci.</p>
<pre class="ruby">
def admin
  request.remote_ip == &quot;127.0.0.1&quot;
end
</pre>
<p>Ceci est plus limit&eacute; puisque &ccedil;a implique que votre connexion internet a une adresse IP fixe et que vous voudrez toujours administrer votre site depuis le m&ecirc;me endroit. &Agrave; la place de ceci, nous alloons construire une page de connexion simple qui ne requiert qu&#x27;un mot de passe. Si le mot de passe saisi est correct alors l&#x27;utilisateur verra les liens d&#x27;administration.</p>

<img src="/system/photos/18/original/E021I01.png" width="742" height="254" />
<p class="title">Notre page de connexion basique.</p>
<p>Pour faire &ccedil;a, nous allons g&eacute;n&eacute;rer un contr&ocirc;leur <code>Sessions</code>. Le code du contr&ocirc;leur est le suivant :</p>
<pre class="ruby">
class SessionsController &lt; ApplicationController
  def new
  end

  def create
    session[:password] = params[:password]
    flash[:notice] = &rsquo;Successfully logged in&rsquo;
    redirect_to home_path
  end
  
  def destroy
    reset_session
    flash[:notice] = &rsquo;Successfully logged out&rsquo;
    redirect_to login_path
  end
end
</pre>
<p>Il y a aussi une nouvelle vue dans le dossier <code>/views/sessions</code>.</p>
<pre class="ruby">
&lt;% form_tag sessions_path do %&gt;
  Password: &lt;%= password_field_tag :password %&gt;
  &lt;%= submit_tag &quot;Login&quot; %&gt;
&lt;% end %&gt;
</pre>
<p>Le formulaire est soumis &agrave; l&#x27;action <code>create</code> qui enregistre le mot de passe dans la session puis redirige vers la page d&#x27;accueil. Dans notre m&eacute;thode <code>admin?</code> nous contr&ocirc;lons que le mot de passe en session est correct et on retourne <code>true</code> le cas &eacute;ch&eacute;ant.</p>
<pre class="ruby">
def admin?
  session[:password] == &quot;secret&quot;
end
</pre>

<h3>The end.</h3>
<p>Notre page de connexion est maintenant compl&egrave;te. Bien que pas particuli&egrave;rement sophistiqu&eacute;e compar&eacute;e &agrave; un syst&egrave;me de gestion d&#x27;utilisateur comme celui fourni par Restful Authentication, c&#x27;est un moyen suffisant pour un site simple.</p>
<p>Finalement, au cas o&ugrave; vous vous demanderiez comment on a donn&eacute; l&#x27;url <code>/login</code> &agrave; notre page de connexion, &ccedil;a se passe dans <code>routes.rb</code></p>
<pre class="ruby">
  map.connect &rsquo;login&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;create&rsquo;
  map.connect &rsquo;logout&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;destroy&rsquo;
</pre>
<h3>Notes</h3>
<ol class="footnotes">
  <li id="fn1"><a href="http://github.com/technoweenie/restful-authentication/tree/master">http://github.com/technoweenie/restful-authentication/tree/master</a></li>
</ol>
