<p>Nel precedente episodio vi abbiamo mostrato come visualizzare o nascondere link amministrativi a seconda del fatto che l&rsquo;utente correntemente loggato fosse o meno admin. Lo abbiamo fatto scrivendo un metodo booleano chiamato <code>admin?</code> nel nostro <code>ApplicationController</code>. Se il metodo <code>admin?</code> restituisce <code>true</code> allora i link sono mostrati, altrimenti no. Abbiamo lasciato il metodo in una versione banale che restituisce sempre <code>true</code>; ci&ograve; che vogliamo fare oggi &egrave; finire di scrivere il metodo e fornire un modo per permettere agli utenti amministrativi di accedere al sito.</p>

<h3>C&rsquo;&egrave; pi&ugrave; di un modo per farlo</h3>

<p>Ci sono molti modi alternativi per implementare il sistema di autenticazione. Potremmo implementare un completo sistema di registrazione utente con un modello <code>User</code>, una pagina di registrazione e cos&igrave; via. Se volessimo seguire questo approccio, c&rsquo;&egrave; un eccellente plugin chiamato <code>restful_authentication</code>, che &egrave; una versione aggiornata di <code>acts_as_authenticated</code>, disponibile per il download.<sup><a href="#fn1">1</a></sup> Una volta installato, il modello utente e un controller chiamato Sessions possono essere generati in questo modo:</p>

<pre class="terminal">
$script/plugin install git://github.com/technoweenie/restful-authentication.git restful_authentication
$script/generate authenticated User sessions
$rake db:migrate
</pre>

<p>Non useremo per&ograve; la Restful Authentication in questo caso. Il plugin <code>restful_authentication</code> sar&agrave; trattato pi&ugrave; in dettaglio nell&rsquo;episodio 67.</p>

<p>Il nostro sito &egrave; cos&igrave; semplice che non necessita di un intero sistema di autenticazione. Abbiamo solo bisogno di gestire gli episodi sul sito, per cui seguiremo direttamente l&rsquo;approccio che non necessita di un modello utente o di qualsiasi plugins. Se volessimo seguire un semplicissimo approccio, potremmo restringere l&rsquo;accesso in base all&rsquo;indirizzo IP e scrivere il nostro metodo <code>admin?</code> cos&igrave;.</p>

<pre class="ruby">
def admin
  request.remote_ip == "127.0.0.1"
end
</pre>

<p>Questo approccio &egrave; alquanto limitante poich&egrave; assume che ogni utenza, soprattutto quella amministrativa, abbia un indirizzo IP statico e che ogni amministratore voglia sempre accedere come tale al sito da una stessa postazione. Anzich&egrave; questo, creiamo una semplice pagina di login che richiede solamente una password. Se la password immessa &egrave; corretta, l&rsquo;utente vedr&agrave; i collegamenti amministartivi.</p>

<div class="imageWrapper">
  <img src="/system/photos/18/original/E021I01.png" width="742" height="254" alt=""/>
</div>
<p class="title">La nostra semplice pagina di login.</p>

<p>Per fare questo, generiamo un controller di sessioni. Eccone il codice:</p>

<pre class="ruby">
class SessionsController &lt; ApplicationController
  def new
  end

  def create
    session[:password] = params[:password]
    flash[:notice] = ’Successfully logged in’
    redirect_to home_path
  end

  def destroy
    reset_session
    flash[:notice] = ’Successfully logged out’
    redirect_to login_path
  end
end
</pre>

<p>C&rsquo;&egrave; anche una semplice vista nella cartella <code>/views/sessions</code>:</p>

<pre class="ruby">
&lt;% form_tag sessions_path do %&gt;
  Password: &lt;%= password_field_tag :password %&gt;
  &lt;%= submit_tag "Login" %&gt;
&lt;% end %&gt;
</pre>

<p>La form &egrave; mandata all&rsquo;action <code>create</code> che memorizza la password in sessione e ridirige alla home page. Nel nostro metodo <code>admin?</code> possiamo controllare la password nella sessione rispetto a quella corretta e restituire true se sono uguali.</p>

<pre class="ruby">
def admin?
  session[:password] == "secret"
end
</pre>

<h3>Fatto!</h3>
<p>La nostra semplice pagina di login &egrave; ora completa. Bench&egrave; non tanto sofisticata quanto potrebbe essere un intero sistema di login come quello fornito dalla Restful Authentication, &egrave; buono abbastanza per il nostro semplice sito.</p>

<p>Infine, nel caso vi steste chiedendo come fornire l&rsquo;url della pagina di login, ci&ograve; &egrave; fatto aggiungendo queste due linee al file <code>routes.rb</code></p>

<pre class="ruby">
  map.connect ’login’, :controller =&gt; ’sessions’, :action =&gt; ’create’
  map.connect ’logout’, :controller =&gt; ’sessions’, :action =&gt; ’destroy’
</pre>

<h3>Note</h3>
<ol class="footnotes">
  <li id="fn1">
    <a href="http://github.com/technoweenie/restful-authentication/tree/master">http://github.com/technoweenie/restful-authentication/tree/master</a>
  </li>
</ol>