<p>No epis&oacute;dio anterior mostramos-lhe como mostrar ou ocultar os links de administra&ccedil;&atilde;o, dependendo se o usu&aacute;rio atual &eacute; um administrador. N&oacute;s fizemos isso escrevendo um m&eacute;todo booleano chamado <code>admin?</code> em nosso <code>ApplicationController</code>. Se <code>admin?</code> for verdade(true), ent&atilde;o retorna os links que foram mostradas, caso contr&aacute;rio, eles retornam escondidos. Deixamos apenas o m&eacute;todo retornando true; o que precisamos fazer &eacute; terminar de escrever esse m&eacute;todo e fornecer um meio para os usu&aacute;rios da administra&ccedil;&atilde;o possam fazer logon no site.</p>

<h3>H&aacute; mais de uma maneira de se fazer</h3>
<p>H&aacute; muitas maneiras de implementar o sistema de login. Podemos implementar um sistema de registro de todos os usu&aacute;rios com um modelo de <code>usu&aacute;rio</code>, uma p&aacute;gina de registro e assim sucessivamente. Se tiv&eacute;ssemos que adotar essa abordagem h&aacute; &eacute; um excelente plugin chamado <code>restful_authentication</code>, dispon&iacute;vel para download.<sup><a href="#fn1">1</a></sup> Uma vez instalado, o modelo do usu&aacute;rio e um controlador chamado Sessions podem ser gerados como este.</p>
<pre class="terminal">
$script/plugin install git://github.com/technoweenie/restful-authentication.git restful_authentication
$script/generate authenticated User sessions
$rake db:migrate
</pre>
<p>N&oacute;s n&atilde;o estaremos utilizando o Restful Authentication aqui. O plugin <code>restful_authentication</code> ser&aacute; discutido no eps&oacute;dio 67.</p>

<p>Nosso site &eacute; t&atilde;o simples que um sistema de administra&ccedil;&atilde;o de todos os usu&aacute;rio n&atilde;o &eacute; necess&aacute;rio. N&oacute;s s&oacute; precisamos administrar os epis&oacute;dios no site, ent&atilde;o iremos para uma abordagem mais simples que n&atilde;o precisa de um modelo de utiliza&ccedil;&atilde;o ou qualquer plugins. Se quis&eacute;ssemos fazer uma abordagem realmente b&aacute;sicas, poderiam restringir o acesso por endere&ccedil;o de IP, e escrever o nosso m&eacute;todo <code>admin?</code> como este.</p>
<pre class="ruby">
def admin
  request.remote_ip == &quot;127.0.0.1&quot;
end
</pre>
<p>Isto &eacute; bastante limitando, pois sup&otilde;e que a sua conex&atilde;o com a Internet tem um endere&ccedil;o de IP est&aacute;tico e que voc&ecirc; sempre vai querer administrar seu site a partir do mesmo local. Em vez disso, vamos criar uma simples p&aacute;gina de login que s&oacute; tem uma senha. Se a senha for digitada corretamente ent&atilde;o o usu&aacute;rio ir&aacute; ver os links de administra&ccedil;&atilde;o.</p>

<img src="/system/photos/18/original/E021I01.png" width="742" height="254" alt="" />
<p class="title">Nossa p&aacute;gina b&aacute;sica de login.</p>
<p>Para fazer isso, vamos gerar um controlador de Sess&otilde;es. O c&oacute;digo do controller est&aacute; abaixo.</p>
<pre class="ruby">
class SessionsController &lt; ApplicationController
  def new
  end

  def create
    session[:password] = params[:password]
    flash[:notice] = &rsquo;Successfully logged in&rsquo;
    redirect_to home_path
  end
  
  def destroy
    reset_session
    flash[:notice] = &rsquo;Successfully logged out&rsquo;
    redirect_to login_path
  end
end
</pre>
<p>H&aacute; tamb&eacute;m uma view b&aacute;sica na pasta <code>/views/sessions</code>.</p>
<pre class="ruby">
&lt;% form_tag sessions_path do %&gt;
  Password: &lt;%= password_field_tag :password %&gt;
  &lt;%= submit_tag &quot;Login&quot; %&gt;
&lt;% end %&gt;
</pre>
<p>O formul&aacute;rio &eacute; submetido &agrave; a&ccedil;&atilde;o <code>create</code>, que armazena a senha digitada na sess&atilde;o, ent&atilde;o redirecionar&aacute; para a p&aacute;gina inicial. Em nosso m&eacute;todo <code>admin?</code>, n&oacute;s verificamos a senha na sess&atilde;o for contra a senha correta, e retornar true se eles combinam.</p>
<pre class="ruby">
def admin?
  session[:password] == &quot;secret&quot;
end
</pre>

<h3>Feito!</h3>
<p>Nossa p&aacute;gina b&aacute;sica de login j&aacute; est&aacute; conclu&iacute;do. Embora n&atilde;o t&atilde;o sofisticado como um sistema completo de gerenciamento de usu&aacute;rios como aquele fornecido por Restful Authentication, &eacute; bom o bastante para funcionar para o nosso site simples.</p>
<p>Finalmente, caso voc&ecirc; esteja se perguntando como podemos ver a p&aacute;gina de /login pela URL, &eacute; feito atrav&eacute;s da adi&ccedil;&atilde;o dessas duas rotas no arquivo <code>routes.rb</code></p>
<pre class="ruby">
  map.connect &rsquo;login&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;create&rsquo;
  map.connect &rsquo;logout&rsquo;, :controller =&gt; &rsquo;sessions&rsquo;, :action =&gt; &rsquo;destroy&rsquo;
</pre>
<h3>Notas</h3>
<ol class="footnotes">
  <li id="fn1"><a href="http://github.com/technoweenie/restful-authentication/tree/master">http://github.com/technoweenie/restful-authentication/tree/master</a></li>
</ol>