<p>En este episodio veremos todo acerca de los layouts. Los layouts son archivos de vistas (views) que definen el c&oacute;digo que rodea un template. Pueden compartirse a varias acciones y controladores.</p>

<h3>Layouts de aplicaci&oacute;n</h3>

<p>El template debajo, lista todos los proyectos.</p>

<pre class="ruby">
&lt;h2&gt;Projects&lt;/h2&gt;
&lt;ul&gt;
&lt;% for project in @projects %&gt;
    &lt;li&gt;&lt;%= project.name %&gt;&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>

<p>Esto genera una p&aacute;gina web b&aacute;sica.</p>

<img src="/system/photos/3/original/E007I01.png" title="Basic page without layout" alt="Basic page without layout" width="800" height="400" />

<p>Si deseamos agregar, por ejemplo un encabezado, un logo o un menu de  navegaci&oacute;n al sitio y deseamos que sea visible en todas las p&aacute;ginas, entonces deber&iacute;amos utilizar un layout. Los archivos de layouts se encuentran en la carpeta <code>/app/views/layouts</code> de una aplicaci&oacute;n Rails. Para crear un layout, crearemos un archivo llamado <code>application.rhtml</code><a href="#fn1"><sup>[1]</sup></a> en la carpeta layouts. Esto crear&aacute; un layout global que ser&aacute; utilizado por todos los controladores y todas las acciones. El archivo layout de nuestra aplicaci&oacute;n se ver&iacute;a as&iacute;:</p>

<pre class="ruby">
&lt;h1&gt;Application Layout!&lt;/h1&gt;  
&lt;%= yield %&gt;  
</pre>

<p>La l&iacute;nea importante del c&oacute;digo de arriba es la segunda. La palabra <code>yield</code> le indica al layout donde ubicar el contenido del template que est&aacute; utilizando el layout. Ahora, si volvemos a observar la p&aacute;gina de arriba veremos que el layout ha sido agregado.</p>

<img src="/system/photos/4/original/E007I02.png" title="Basic page with layout" alt="Basic page with layout" width="800" height="400" />

<p>El layout es global,  por lo que ser&aacute; agregado a cualquier acci&oacute;n en cualquier controlador de la aplicaci&oacute;n. La mayor&iacute;a de las veces esto ser&aacute; suficiente; pero, &iquest;y si necesitamos diferentes layouts para diferentes partes de nuestra aplicaci&oacute;n?</p>

<h3>Layouts espec&iacute;ficos por controladores</h3>

<p>Un layout puede ser hecho espec&iacute;ficamente para un controlador, nombr&aacute;ndolo como el controlador al que va a servir. Entonces, para crear un layout que ser&aacute; utilizado por todas las acciones en el controlador <code>Projects</code>, debemos crear un archivo en la carpeta layouts llamado <code>projects.rhtml</code><a href="#fn2"><sup>[2]</sup></a>. Esto significa que el layout ser&aacute; utilizado solamente por el controlador Projects.</p>

<pre class="ruby">
&lt;h1&gt;Project Layout!&lt;/h1&gt;  
&lt;%= yield %&gt; 
</pre>

<img src="/system/photos/5/original/E007I03.png" title="Basic page with controller-specific layout" alt="Basic page with controller-specific layout" width="800" height="400" />

<p>&iquest;Y si quisi&eacute;ramos compartir un layout a trav&eacute;s de un n&uacute;mero de controladores, no solo uno, por ejemplo, un layout para admin (administraci&oacute;n)? Rails permite usar el comando <code>layout</code> para especificar el nombre del layout que deber&iacute;a utilizarse dentro de un controlador.</p>

<pre class="ruby">
class ProjectsController &lt; ApplicationController  
 layout &quot;admin&quot;   
  
  def index  
    @projects = Project.find(:all)  
  end  
end  
</pre>

<h3>Layouts din&aacute;micos</h3>

<p>Los layouts pueden tambi&eacute;n utilizarse de forma din&aacute;mica. Alguna vez, podr&iacute;amos necesitar solo un layout <code>admin</code> cuando el usuario se encuentra logueado a la aplicaci&oacute;n. Esto puede realizarse pasando un s&iacute;mbolo como argumento al comando <code>layout</code> y creando un m&eacute;todo con el mismo nombre que el s&iacute;mbolo que da nombre al layout que deber&iacute;a utilizarse.</p>

<pre class="ruby">
class ProjectsController &lt; ApplicationController  
 layout :user_layout  
    def index  
    @projects = Project.find(:all)  
  end  
  
  protected  
  def user_layout  
    if current_user.admin?  
      &quot;admin&quot;   
    else  
      &quot;application&quot;   
    end  
  end  
end  
</pre>

<p>Podemos restringir un layout a una sola acci&oacute;n en un controlador con el comando <code>render</code>.</p>

<pre class="ruby">
def index  
  @projects = Project.find(:all)  
  render :layout =&gt; &#x27;projects&#x27;  
end  
</pre>

<p>El layout especificado con el comando render no tendr&aacute; en cuenta cualquier layout especificado por el controlador. Para generar una acci&oacute;n sin un layout podemos utilizar</p>

<pre class="ruby">
render :layout =&gt; false  
</pre>

<h3>Notas</h3>
<ol>
  <li>En Rails 2 y versiones superiores el archivo deber&iacute;a llamarse <code>application.html.erb</code>.</li>
  <li>Tambien, en Rails 2 y versiones superiores la extensi&oacute;n deber&iacute;a llamarse <code>.html.erb</code> en vez de <code>.rhtml</code>.</li>
</ol>