<p>Cet &eacute;pisode est enti&egrave;rement consacr&eacute; aux layouts. Les layouts sont des fichiers de vue qui d&eacute;finissent le code qui englobe un gabarit (template). Ils peuvent &ecirc;tre partag&eacute; dans beaucoup d&#x27;actions et de contr&ocirc;leurs.</p>
<h3>Les layouts applicatif</h3>
<p>Le gabarit ci-dessous liste tout les projets.</p>
<pre class="ruby">
&lt;h2&gt;Projects&lt;/h2&gt;
&lt;ul&gt;
&lt;% for project in @projects %&gt;
    &lt;li&gt;&lt;%= project.name %&gt;&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>
<p>Il g&eacute;n&egrave;re une page web assez basique :</p>
<img src="/system/photos/3/original/E007I01.png" title="Basic page without layout" alt="Basic page without layout" width="800" height="400" />
<p>Si nous voulons ajouter, disons, une ent&ecirc;te, un logo et un menu de navigation &agrave; ce site et les avoir sur chaque page alors nous devrions utiliser un layout. Les layouts sont stock&eacute;s dans le r&eacute;pertoire <code>/app/view/layouts</code> de l&#x27;application Rails. Pour en cr&eacute;er un, cr&eacute;ez un nouveau fichier nomm&eacute; <code>application.rhtml</code><a href="#fn1"><sup>[1]</sup></a> dans le dossier des layouts. Ceci cr&eacute;era un layout global qui sera utilis&eacute; par tous les contr&ocirc;leurs et toutes les actions. Le layout de notre application ressemble &agrave; &ccedil;a :</p>
<pre class="ruby">
&lt;h1&gt;Application Layout!&lt;/h1&gt;
&lt;%= yield %&gt;
</pre>
<p>La ligne importante dans le code ci-dessus est la seconde. Le mot cl&eacute; <code>yield</code> dit au layout o&ugrave; placer le contenu pour les templates qui utilisent le layout. Maintenant, si nous regardons &agrave; nouveau la page d&#x27;avant, nous pouvons voir que le layout a &eacute;t&eacute; ajout&eacute;.</p>
<img src="/system/photos/4/original/E007I02.png" title="Basic page with layout" alt="Basic page with layout" width="800" height="400" />
<p>Le layout est global, donc il sera ajout&eacute; &agrave; n&#x27;importe quelle action de n&#x27;importe quel contr&ocirc;leur de l&#x27;application. La plupart du temps ceci suffira mais que faire si nous avons besoin de layouts diff&eacute;rents pour diff&eacute;rentes parties de notre application ?</p>

<h3>Les layouts sp&eacute;cifiques &agrave; un contr&ocirc;leur</h3>
<p>Un layout peut &ecirc;tre rendu sp&eacute;cifique &agrave; un contr&ocirc;leur en donnant au layout le nom du contr&ocirc;leur. Ainsi pour faire qu&#x27;un layout qui sera utilis&eacute; par toutes les actions dans le contr&ocirc;leur <code>Projects</code>, cr&eacute;ez un fichier dans le r&eacute;pertoire <code>layouts</code> que vous nommerez <code>projects.rhtml</code><a href="#fn2"><sup>[2]</sup></a>. &Ccedil;a signifie que le layout sera utilis&eacute; uniquement par le contr&ocirc;leur <code>Projects</code>.</p>
<pre class="ruby">
&lt;h1&gt;Project Layout!&lt;/h1&gt;
&lt;%= yield %&gt;
</pre>
<img src="/system/photos/5/original/E007I03.png" title="Basic page with controller-specific layout" alt="Basic page with controller-specific layout" width="800" height="400" />
<p>Comment faire pour partager un layout avec plusieurs contr&ocirc;leur, pas uniquement pour un seul, e.g. un layout pour l&#x27;administration ? Rails vous permet d&#x27;utiliser la commande <code>layout</code> pour sp&eacute;cifier le nom du layout qui devrait &ecirc;tre utilis&eacute; au sein d&#x27;un contr&ocirc;leur..</p>
<pre class="ruby">
class ProjectsController &lt; ApplicationController
  layout "admin" 

  def index
    @projects = Project.find(:all)
  end
end
</pre>
<p class="title">Un layout sp&eacute;cifi&eacute; avec la commande <code>layout</code> surchargera n&#x27;importe quels layouts sp&eacute;cifiques &agrave; un contr&ocirc;leur ou &agrave; une application.</p>

<h3>Les layouts dynamiques</h3>
<p>Les layouts peuvent aussi &ecirc;tre utilis&eacute;s dynamiquement. Nous pourrions seulement vouloir que le layout <code>admin</code> soit utiliser quand un utilisateur est connect&eacute;. &Ccedil;a peut &ecirc;tre fait en transmettant un symbole comme argument &agrave; la commande <code>layout</code> et en cr&eacute;ant une m&eacute;thode avec le m&ecirc;me nom que le symbole qui d&eacute;termine quel layout devrait &ecirc;tre utilis&eacute;.</p>
<pre class="ruby">
class ProjectsController &lt; ApplicationController
  layout :user_layout

  def index
    @projects = Project.find(:all)
  end

  protected
  def user_layout
    if current_user.admin?
      "admin" 
    else
      "application" 
    end
  end
end    
</pre>
<p>Nous pouvons restreindre un layout &agrave; une seule action dans un contr&ocirc;leur avec la commande <code>render</code>.</p>
<pre class="ruby">
def index
  @projects = Project.find(:all)
  render :layout =&gt; "projects"
end
</pre>
<p>Le layout sp&eacute;cifi&eacute; avec la commande <code>render</code> surchargera n&#x27;importe quel layout sp&eacute;cifique &agrave; un contr&ocirc;leur. Pour rendre une action sans aucun layout, on peut utiliser :</p>
<pre class="ruby">render :layout =&gt; false</pre>

<h3>Notes</h3>
<ol class="footnotes">
  <li id="fn1">Dans Rails 2 et sup&eacute;rieur, le fichier devrait &ecirc;tre appel&eacute; <code>application.html.erb</code></li>
  <li id="fn2">&Agrave; nouveau, pour Rails 2 et sup&eacute;rieur, l&#x27;extension devrait &ecirc;tre <code>.html.erb</code> plut&ocirc;t que <code>.rhtml</code>.</li>
</ol>