<style type="text/css">.asciicast .imageWrapper { width: 900px; overflow: auto; text-align: center; }</style>

<p><a href="http://compass-style.org/">Compass</a> hace que sea mucho m&aacute;s f&aacute;cil generar hojas de estilos con SASS incorporando <em>mixins</em> &uacute;tiles, funciones, etc, y la nueva gema <a href="https://github.com/Compass/compass-rails">CompassRails</a> permite la integraci&oacute;n directa de Compass con el conducto de est&aacute;ticos de Rails.  A continuaci&oacute;n se muestra una versi&oacute;n simplificada del dise&ntilde;o del sitio de Railscasts.  Vamos a usar Compass para mejorar los estilos de la web pero manteniendo el mismo aspecto.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1086/original/E334I01.png" width="950" height="500" alt="La página del sitio de Railscasts."/>
</div>

<p>Para a&ntilde;adir Compass a una aplicaci&oacute;n Rails tan s&oacute;lo tenemos que a&ntilde;adir la gema CompassRails al grupo <code>assets</code> del <code>Gemfile</code> y luego ejecutar <code>bundle</code>.</p>

``` /Gemfile
# Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem 'sass-rails',   '~> 3.2.3'
  gem 'coffee-rails', '~> 3.2.1'

  # See https://github.com/sstephenson/execjs#readme for more supported runtimes
  # gem 'therubyracer'

  gem 'uglifier', '>= 1.0.3'
  gem 'compass-rails'
end

gem 'jquery-rails'
```

<p>Lo siguiente que haremos ser&aacute; renombrar nuestro fichero <code>application.css</code> a <code>application.css.scss</code>, que har&aacute; que pase a ser un fichero interpretado por SASS.  Es necesario que hagamos esto para poder tener un lugar desde el que cargar Compass que est&eacute; compartido entre todos los ficheros SASS de nuestra aplicaci&oacute;n.  Sprockets no da esta funcionalidad por lo que eliminaremos su manifiesto y en su lugar utilizaremos SASS para importar los ficheros necesarios.  Nuestra aplicaci&oacute;n ya tiene un fichero llamado <code>layout.css.scss</code> por lo que lo importaremos, as&iacute; como el fichero <code>compass</code>.</p>

``` /app/assets/application.css.scss
@import &quot;compass&quot;;
@import &quot;layout&quot;;
```
<p>Tendremos que reiniciar el servidor porque hemos acabado de a&ntilde;adir una gema a la aplicaci&oacute;n.  Al recargar la p&aacute;gina veremos que tiene el mismo aspecto que antes, lo cual es bueno.  La &uacute;nica diferencia es que ahora ya podemos utilizar Compass para mejorar nuestro c&oacute;digo SASS.</p>

<h3>Uso de Compass en nuestra aplicaci&oacute;n</h3>

<p>Como ya hemos a&ntilde;adido el fichero <code>compass</code> a la aplicaci&oacute;n tenemos acceso autom&aacute;ticamente a toda la funconalidad de Compass, que nos facilitar&aacute; el trabajo con CSS3, pudiendo a&ntilde;adir funcionalidades de CSS sin tener que especificar prefijos espec&iacute;ficos para cada navegador cuando usemos gradientes, sombras o bordes redondeados   La aplicaci&oacute;n de Railscasts utiliza un gradiente.  Los gradientes est&aacute;n documentados en la secci&oacute;n de <a href="http://compass-style.org/reference/compass/css3/images/">im&aacute;genes</a> de la documentaci&oacute;n de Compass. As&iacute; que usando Compass vamos a mejorar el c&oacute;digo de estilos de la barra de navegaci&oacute;n, que se encuentra en el fichero <code>layout</code>.</p>


``` /app/assets/stylesheets/layout.css.scss
#nav_bar {
  position: relative;
  padding: 8px 100px;
  margin-bottom: 15px;
  border-top: solid 1px #FFF;
  border-bottom: solid 3px #DE9F00;
  background-color: #333;
  background-image: -webkit-linear-gradient(#5c5c5c, #111111);
  background-image: -moz-linear-gradient(#5c5c5c, #111111);
  background-image: -ms-linear-gradient(#5c5c5c, #111111);
  background-image: linear-gradient(#5c5c5c, #111111);

  .nav {
    float: right;
    padding-top: 2px;
    li {
      padding-left: 25px;
      font-size: 14px;
      color: #BBB;
      a { color: #FFF; }
    }
  }
}
```

<p>En este fichero definimos los gradientes cuatro veces porque tenemos que tener en cuenta los diferentes prefijos espec&iacute;ficos para cada navegador.  Con Compass no tendremos que hacerlo, tan s&oacute;lo tenemos que utilizar una l&iacute;nea de c&oacute;digo:</p>


``` /app/assets/stylesheets/layout.css.scss
@include background-image(linear-gradient(#5c5c5c, #111111));
```

<p>Con esta l&iacute;nea Compass generar&aacute; todos los prefijos que necesitamos y al recargar la p&aacute;gina veremos que tiene el mismo aspecto pero si examinamos la CSS generada veremos todo el c&oacute;digo que Compass ha escrito por nosotros:</p>


``` /assets/application.css
/* line 69, ../../app/assets/stylesheets/layout.css.scss */
#nav_bar {
  position: relative;
  padding: 8px 100px;
  margin-bottom: 15px;
  border-top: solid 1px #FFF;
  border-bottom: solid 3px #DE9F00;
  background-color: #333;
  background-image: -webkit-gradient(linear, 50% 0%, 50% 100%, color-stop(0%, #5c5c5c), color-stop(100%, #111111));
  background-image: -webkit-linear-gradient(#5c5c5c, #111111);
  background-image: -moz-linear-gradient(#5c5c5c, #111111);
  background-image: -o-linear-gradient(#5c5c5c, #111111);
  background-image: -ms-linear-gradient(#5c5c5c, #111111);
  background-image: linear-gradient(#5c5c5c, #111111);
}
```

<h3>Uso de <em>Sprites</em> en CSS</h3>

<p>Si todo lo que buscamos en Compass son este tipo de comodidades en el uso de CSS3, nos podr&iacute;a bastar con  <a href="http://thoughtbot.com/bourbon/">Bourbon</a> tal y como vimos en el  <a href="http://railscasts.com/episodes/330-better-sass-with-bourbon">episode 330</a>.  Pero Compass va mucho m&aacute;s all&aacute;, incluyendo <em>sprites</em> en CSS.  El uso de <em>sprites</em> en CSS es una t&eacute;cnica que combina varias im&aacute;genes en una m&aacute;s grande y usar reglas CSS para mostrar s&oacute;lo una parte de dicha imagen.  En nuestra p&aacute;gina tenemos una fila de iconos que nos permiten suscribirnos a Railscasts de varias maneras, cada uno de estos iconos tiene una imagen separada lo que quiere decir que se lanza una petici&oacute;n HTTP diferente por cada uno.  Es buena pr&aacute;ctica reducir este n&uacute;mero de peticiones, por lo que si somos capaces de fusionar todas estas im&aacute;genes en una sola podr&iacute;amos utilizar CSS para mostrar cada icono escogiendo una secci&oacute;n de esta imagen.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1086/original/E334I01.png" width="950" height="500" alt="La página del sitio de Railscasts."/>
</div>

<p>Por supuesto la implementaci&oacute;n manual de esta t&eacute;cnica es bastante costosa, pero con Compass se puede hacer m&uacute;y f&aacute;cilmente.  Ahora mismo estamos cargando los iconos mediante <code>background-image</code>.</p>


``` /app/assets/stylesheets/layout.css.scss
#subscribe {
  position: absolute;
  bottom: 10px;
  right: 100px;
  li {
    position: relative;
    margin-left: 8px;
    font-size: 12px;
  }
  a {
    display: block;
    width: 34px;
    height: 34px;
  }
  .itunes   { background-image: image-url("icons/itunes.png"); }
  .twitter  { background-image: image-url("icons/twitter.png"); }
  .facebook { background-image: image-url("icons/facebook.png"); }
  .rss      { background-image: image-url("icons/rss.png"); }
}
```

<p>Primero tendremos que combinar todas las im&aacute;genes que queremos combinar y ponerlas en el mismo directorio.  Las nuestras ya est&aacute;n en  <code>/app/assets/images/icons</code> por lo que no tendremos que hacerlo.  Podemos cargar las im&aacute;genes en Compass invocando  <code>@import</code> y pas&aacute;ndole la ruta.</p> 

``` /app/assets/stylesheets/layout.css.scss
@import "icons/*.png";
```

<p>Con esto cargaremos todas las im&aacute;genes de dicho directorio y generaremos una  &uacute;nica imagen <em>sprite</em> con todos ellos.  Esto se puede hacer de varias maneras, la m&aacute;s manual es modifiando la llamada a <code>background-image</code> para cada icono.</p>

``` /app/assets/stylesheets/layout.css.scss
.itunes   { @include icons-sprite(itunes); }
.twitter  { @include icons-sprite(twitter); }
.facebook { @include icons-sprite(facebook); }
.rss      { @include icons-sprite(rss) }
```

<p>Nuevamente la p&aacute;gina sigue teniendo el mismo aspecto cuando la recargamos pero los iconos se encuentran ahora en la misma imagen de forma que se descargan todos con una &uacute;nica petic&oacute;n.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1087/original/E334I02.png" width="408" height="279" alt="Compass ha combinado todos los iconos en una única imagen."/>
</div>

<p>Pero Compass viene con una forma todav&iacute;a m&aacute;s c&oacute;moda de hacerlo.  En lugar de cargar los <em>sprites</em> individualmente podemos hacerlo todo autom&aacute;ticamente mediante Compass, pudiendo eliminar el CSS de las cuatro clases que representan los iconos e incluyendo la siguiente l&iacute;nea:</p>


``` /app/assets/stylesheets/layout.css.scss
@import "icons/*.png";
@include all-icons-sprites;
```

<p>Esto generar&aacute; autom&aacute;ticamente una clase CSS para cada imagen.  Claro est&aacute; que tendremos que cambiar el marcado HTML para que haga referencia a estas clases.  Cada icono se muestra en una lista de la siguiente manera:</p>


``` /app/views/layouts/application.html.erb
<ul id="subscribe" class="horizontal">
  <li><a class="itunes" href="/itunes"></a></li>
  <li><a class="twitter" href="/twitter"></a></li>
  <li><a class="facebook" href="/facebook"></a></li>
  <li><a class="rss" href="/rss"></a></li>
</ul>
```
<p>Tan solo tenemos que preceder el nombre de clase con el directorio, en nuestro caso <code>icons</code> y un gui&oacute;n:</p>


``` /app/views/layouts/application.html.erb
<ul id="subscribe" class="horizontal">
  <li><a class="icons-itunes" href="/itunes"></a></li>
  <li><a class="icons-twitter" href="/twitter"></a></li>
  <li><a class="icons-facebook" href="/facebook"></a></li>
  <li><a class="icons-rss" href="/rss"></a></li>
</ul>
```

<p>La p&aacute;gina tiene el mismo aspecto que antes pero la CSS generada referencia a una &uacute;nica imagen y utiliza <code>background-position</code> para mostrar la parte relevante de cada icono.</p>


``` /assets/application.css
/* line 66, icons/*.png */
.icons-sprite, .icons-facebook, .icons-itunes, .icons-rss, .icons-twitter {
  background: url(/assets/icons-s1286bd1660.png) no-repeat;
}

/* line 60, ../../../.rvm/gems/ruby-1.9.3-p125/gems/compass-0.12.1/frameworks/compass/stylesheets/compass/utilities/sprites/_base.scss */
.icons-facebook {
  background-position: 0 -102px;
}
```

<p>Podemos encontrar m&aacute;s informaci&oacute;n  <a href="http://compass-style.org/help/tutorials/spriting/">acerca de el uso de <em>sprites</em></a> en el tutorial de Compass.</p> 

<h3>Listas horizontales simples</h3>

<p>La documentaci&oacute;n de Compass es bastante buena y es recomendable dedicar un tiempo a repasar las secci&oacute;n de Ayuda y Referencia para hacernos una idea de lo que podemos hacer con Compass.  Hay muchas funciones de utilidad, <a href="http://compass-style.org/reference/compass/typography/lists/horizontal_list/">una de las cuales</a> hace que sea mucho m&aacute;s f&aacute;cil generar listas horizontales.  Las listas con frecuencia se usan para mostrar men&uacute;s de navegaci&oacute;n y podemos utilizar el <em>mixin</em>  <code>horizontal-list</code> para simplificarlas.  El sitio de Railscasts tiene una clase  <code>.horizontal</code> que hace justo eso y su c&oacute;digo SASS tiene el siguiente aspecto:</p>


``` /app/assets/stylesheets/layout.css.scss
ul.horizontal {  list-style: none;
  margin: 0;
  padding: 0;
  li {
    margin: 0;
    padding: 0;
    float: left;
  }
}
```

<p>Podemos cambiarlo por una llamada al <em>mixin</em>.</p>

`` /app/assets/stylesheets/layout.css.scss
ul.horizontal {
	@include horizontal-list;
}
```
<p>Con este marcado mucho m&aacute;s simple las listas horizontales se seguir&aacute;n mostrando de forma horizontal, aunque puede ser que tengamos que ajustar un poco los m&aacute;rgenes y el <em>padding</em> de forma individual.</p>

<h3><em>Reset</em> de hoja de estilos con Compass</h3>

<p>Los navegadores vienen con valores por defecto diferentes para el tama&ntilde;o y el espaciado de diversos elementos, pero mediante Compass podemos ajustar todo a cero para que podamos construir nuestros estilos de forma consistente entre los diferentes navegadores.  Para usarlo s&oacute;lo tenemos que importar <code>reset</code> a nuestro fichero <code>application.css.scss</code>.</p>

``` /app/assets/stylesheets/application.css.scss
@import "compass";
@import "compass/reset";
@import "layout";
```

<p>Esta es una de las escasas directivas de Compas que inserta CSS en nuestro <em>layout</em> por lo que deberemos tenerlo en cuenta, y veremos que el texto &ldquo;Welcome&rdquo; que se encuentra en un elemento <code>h1</code> aparece ahora con menor tama&ntilde;o.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1088/original/E334I03.png" width="800" height="500" alt="El texto del elemento h1 ha visto modificado sus estilos al aplicar el reset de Compass."/>
</div>

<p>En general la mayor&iacute;a de nuestras p&aacute;ginas acabar&aacute;n con peor aspecto tras aplicar este <em>reset</em> porque la mayor&iacute;a de los dise&ntilde;os dependen hasta cierto punto de los estilos por defecto que incorporan los navegadores.  Pero una vez que hayamos puesto a cero todos los estilos por defecto podemos empezar a construir nuestros propios estilos de forma consistente e independiente de l navegador.  Por ejemplo podemos declarar qu&eacute; aspecto queremos que tengan los elementos <code>h1</code>.</p>


``` /app/assets/stylesheets/layout.css.scss
h1 {
	font-size: 28px;
	font-weight: bold;
	margin: 18px 0;
}
```

<p>Veremos que nuestra p&aacute;gina tiene el mismo aspecto que antes.</p>

<p>Este tipo de ajustes de CSS no siempre sirven, pero deben tenerse en cuenta cuando necesitamos que el dise&ntilde;o sea consistente en todos los navegadores.  Hay otras alternativas al <em>reset</em> que hace Compass, como por ejemplo  <a href="http://necolas.github.com/normalize.css/">normalize.css</a>. &Eacute;ste define valores por defecto mucho m&aacute;s parecidos a los que vienen con los navegadores con lo que no tendremos que definir todos los elementos desde cero.</p>

<h3>M&aacute;s informaci&oacute;n</h3>

<p>Con esto terminamos este episodio.  Hay varias funcionalidades que no hemos cubierto, por lo que conviene repasar el sitio web de Compass para recabar m&aacute;s informaci&oacute;n.  Una de las partes que no hemos visto es <a href="http://compass-style.org/reference/blueprint/">el m&oacute;dulo de Blueprint</a>, que es un <em>framework</em> CSS completo que sirve para construir dise&ntilde;os basados en ret&iacute;culas.   Tambi&eacute;n merece la pena leer el README de CompassRails para ver otras formas posibles de integrar Compass con Rails.  Tambi&eacute;n incluye informaci&oacute;n &uacute;til para los que est&eacute;n utilizando versiones antiguas de Rails.</p>

<p>Compass ofrece mucha funcionalidad, pero tambi&eacute;n es muy modular, lo que quiere decir que tan s&oacute;lo tenemos que incluir las partes que necesitemos en nuestra aplicaci&oacute;n.</p>