<p>La extra&ntilde;a sintaxis en la l&iacute;nea del find que vemos debajo, con un ampersand y un symbol, se llama Symbol to_proc y es algo que Rails agrega a Ruby.</p>

<pre class="ruby">
class Project &lt; ActiveRecord::Base  
  has_many :tasks  
  
  def self.all_names  
    find(:all).collect(&amp;:name)  
  end  
end  
</pre>

<p>Utilizaremos <code>script/console</code> de Rails para explicar como funciona. Primero, busquemos un arreglo de <code>Project</code>s.</p>

<pre class="terminal">
Laa-Laa:todo eifion$ script/console 
Loading development environment (Rails 2.2.2) 
&gt;&gt; projects = Project.find(:all) 
=&gt; [#&lt;Project id: 1, name: &quot;Write another ASCIIcast&quot;, created_at: &quot;2008-12-29 09:32:47&quot;, updated_at: &quot;2008-12-29 09:32:47&quot;&gt;, #&lt;Project id: 2, name: &quot;Go out walking&quot;, created_at: &quot;2008-12-29 09:33:04&quot;, updated_at: &quot;2008-12-29 09:33:04&quot;&gt;]
</pre>

<p>Hay dos proyectos y queremos devolver un arreglo de todos los nombres de los proyectos. Una manera de hacerlo ser&iacute;a usando el m&eacute;todo <code>collect</code>, que toma un bloque (block), y devuelve el nombre de cada proyecto. El m&eacute;todo <code>collect</code> itera a trav&eacute;s de un arreglo, ejecuta alg&uacute;n c&oacute;digo sobre cada &iacute;tem en el arreglo, y devuelve un arreglo que contiene cada resultado del c&oacute;digo ejecutado sobre cada &iacute;tem en el arreglo original.</p>

<pre class="terminal">
&gt;&gt; projects.collect { |p| p.name } 
=&gt; [&quot;Write another ASCIIcast&quot;, &quot;Go out walking&quot;]
</pre>

<p>Symbol to_proc permite utilizar un atajo cuando se desea realizar una llamada a un m&eacute;todo contra el objeto que se env&iacute;a al bloque. Para hacer esto, se le pasa un par&aacute;metro que comienza con un ampersand (&amp;) seguido por el nombre del m&eacute;todo como s&iacute;mbolo (symbol):</p>

<pre class="terminal">
&gt;&gt; projects.collect {&amp;:name} 
=&gt; [&quot;Write another ASCIIcast&quot;, &quot;Go out walking&quot;]
</pre>

<p>Esto es m&aacute;s &uacute;til cuando se quiere combinar m&uacute;ltiples llamadas a m&eacute;todos:</p>

<pre class="terminal">
&gt;&gt; projects.collect(&amp;:name).collect(&amp;:upcase) 
=&gt; [&quot;WRITE ANOTHER ASCIICAST&quot;, &quot;GO OUT WALKING&quot;]
</pre>

<p>Esta t&eacute;cnica no se limita al m&eacute;todo <code>collect</code>; puede aplicarse a cualquier m&eacute;todo que tome un bloque. Por ejemplo, los m&eacute;todos <code>any?</code> y <code>all?</code> pueden utilizar este atajo para ver si todos (all) o cualquier proyecto (any) son v&aacute;lidos, o incluso para guardar todos nuestros proyectos.</p>

<pre class="terminal">
&gt;&gt; projects.all?(&amp;:valid?) 
=&gt; true &gt;&gt; 
projects.any?(&amp;:valid?) 
=&gt; true &gt;&gt; projects.each(&amp;:save!) 
=&gt; [#&lt;Project id: 1, name: &quot;Write another ASCIIcast&quot;, created_at: &quot;2008-12-29 09:32:47&quot;, updated_at: &quot;2008-12-29 09:32:47&quot;&gt;, #&lt;Project id: 2, name: &quot;Go out walking&quot;, created_at: &quot;2008-12-29 09:33:04&quot;, updated_at: &quot;2008-12-29 09:33:04&quot;&gt;]
</pre>

<p>A pesar de su sintaxis un poco extra&ntilde;a, symbol to_proc es muy &uacute;til cuando se necesita encadenar m&eacute;todos entre s&iacute; con bloques.</p>