<p>In unserer Serie &uuml;ber die neuen Features von Rails 3 betrachten wir in dieser Episode das Thema <em>dezentes bzw. unaufdringliches JavaScript</em> (unobtrusive Javascript). Dezentes JavaScript bedeutet, JavaScript- und HTML-Code weitestgehend zu trennen. Im ausgelieferten HTML-Dokument sollten also nach M&ouml;glichkeit keine oder so gut wie keine JavaScript-Anweisungen stehen, sondern nur in externen Dateien. Dies funktioniert analog wie die Trennung von Struktur (HTML) und Design (CSS). Bevor wir zur eigentlichen Anwendung in Rails kommen, hier ein kleines Beispiel anhand eines einfachen HTML-Dokuments.</p>

<p>Der nachfolgende Screenshot zeit eine Webseite mit einem Link darauf. Sobald der Link aufgerufen wird, wird ein JavaScript <code>alert</code> ausgef&uuml;hrt, der &ldquo;Hello world!&rdquo; ausgibt.</p>

<div class="imageWrapper">
  <img src="/system/photos/343/original/E205I01.png" width="639" height="337" alt="The alert shown by the inline JavaScript."/>
</div>

<p>Der HTML-Code f&uuml;r diese Seite sieht so aus::</p>

<pre class="ruby">
&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;UJS Example&lt;/title&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;&lt;a href=&quot;#&quot; onclick=&quot;alert(&#x27;Hello world!&#x27;); return false;&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>In dieser Seite haben wir direkt im HTML-Dokument im <code>onlick</code>-Attribut JavaScript-Code stehen. Solche Anweisungen sind also keineswegs dezent/unaufdringlich (unobtrusive eben), was nicht gerade ideal ist, da wir Verhalten und Inhalt miteinander vermischen. In den 90er Jahren wurden Webseiten sehr h&auml;ufig mit <code>&lt;font&gt;</code>-Tags gestaltet, um Schriftart und -aussehen von Texten einzustellen, da es damals noch kein CSS gab. Daraus resultierte automatisch, dass man, wenn man beispielsweise die Gr&ouml;&szlig;e aller mit <code>&lt;p&gt;</code> deklarierten Abs&auml;tze ver&auml;ndern wollte, nicht selten hunderte &uuml;ber mehrere Dateien verteilte &Auml;nderungen durchf&uuml;hren musste. Als die Browser endlich anfingen, CSS zu unterst&uuml;tzen, konnte man das Styling der Seite in Stylesheets auslagern und nur noch die Struktur und den Inhalt der Seite im HTML belassen. So wurde es deutlich einfacher, das Aussehen einer Webseite einheitlich anzupassen.</p>

<p>Dasselbe gilt f&uuml;r JavaScript: Viele kleine Codeschnipsel innerhalb des HTML-Dokuments, meistens in Attributen wie <code>onclick</code>, vermischt verschiedene Zust&auml;ndigkeiten und erschwert die Wartung nicht unerheblich. Das Herausl&ouml;sen von JavaScript in eigenst&auml;ndige Dateien, die im <code>head</code>-Bereich von HTML-Dokumenten eingebunden werden, vermeidet Code-Duplikate, erm&ouml;glicht einfache Refactorings und erleichtert die Erstellung von und die Fehlersuche in komplexen Webanwendungen.</p>

<p>Nur wie machen wir den JavaScript-Code in unserem einfachen Beispiel unaufdringlich? Der zentrale Schritt ist das Verschieben des Codes aus dem <code>onclick</code>-Attribut in eine eigene Datei und die Verwendung eines JavaScript-Frameworks, hier <em>jQuery</em>, um die Anweisungen mit den richtigen HTML-Elementen zu verbinden. Zeigen wir zuerst die umgewandelte Datei und beleuchten dann die durchgef&uuml;hrten &Auml;nderungen.</p>

<pre class="ruby">
&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;UJS Example&lt;/title&gt;
    &lt;script src=&quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot; type=&quot;text/javascript&quot; charset=&quot;UTF-8&quot;&gt;&lt;/script&gt;
    &lt;script type=&quot;text/javascript&quot;charset=&quot;UTF-8&quot;&gt;
      $(function () {
        $(&#x27;#alert&#x27;).click(function () {
          alert(&#x27;Hello, world!&#x27;);
          return false;
        })
      });
    &lt;/script&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;&lt;a href=&quot;#&quot; id=&quot;alert&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>Zuallererst f&auml;llt auf, dass wir die Anweisungen <strong>doch nicht</strong> in eine eigene Datei verschoben haben. Dies dient hier nur der besseren &Uuml;bersicht, da sich die &Auml;nderungen so leichter darstellen lassen.</p>

<p>Das <code>a</code>-Element wurde um sein <code>onclick</code>-Attribut erleichtert und hat stattdessen ein <code>id</code>-Attribut dazubekommen, damit wir dieses Element leicht vom jQuery-Code aus adressieren k&ouml;nnen. Weiterhin haben wir im <code>head</code>-Bereich der Seite die jQuery-Bibliothek eingebunden und darunter die eigentlichen Anweisungen (die selbstverst&auml;ndlich in einer eigenen Datei stehen sollten und auch mit Hilfe eines <code>script</code>-Tags eingebunden werden sollten). Das Skript beginnt mit dem Aufruf der <code>$</code>-Methode von jQuery, der eine anonyme Funktion als Parameter &uuml;bergeben wird. Diese Funktion wird ausgef&uuml;hrt, sobald das <em>DOM</em> der Seite geladen wird und enth&auml;lt die jQuery-Anweisungen, die anhand der <code>id</code> das <code>a</code>-Element finden und eine Funktion an dessen <code>click</code>-Event anh&auml;ngen. Diese Funktion wiederum f&uuml;hrt den eigentlichen <code>alert</code>-Aufruf durch und gibt <code>false</code> zur&uuml;ck, damit der Browser dem Link nicht folgt.</p>

<p>Wenn wir die Seite neu laden, verh&auml;lt sie sich immer noch genau so wie zuvor: Der <code>alert</code> wird angezeigt, sobald der Link angeklickt wird.</p>

<p>Auf den ersten Blick dr&auml;ngt sich der Eindruck auf, dass man hierf&uuml;r unverh&auml;ltnism&auml;ssig viel Arbeit investieren muss, um die Trennung durchzuf&uuml;hren, doch dieses simple Beispiel demonstriert schlicht und ergreifend auch nicht die wirklichen Vorteile, die sich mit dezentem JavaScript ergeben. Immerhin haben wir <strong>eine</strong> Zeile JavaScript-Code genommen und <strong>sechs</strong> daraus gemacht. Wie gesagt ist dieses Beispiel auch nicht daf&uuml;r geeignet, um die Vorteile aufzuzeigen, sondern dient lediglich der Demonstration, wie die Technik angewendet wird und wo sich Unterschiede ergeben. Die Vorz&uuml;ge von unaufdringlichem Code werden erst wirklich deutlich, wenn eine Anwendung viel mehr und komplexeres JavaScript einsetzt, da sich Code-Duplikate viel leichter identifizieren und beheben lassen, wenn man den gesamten Code an einer Stelle hat, anstatt &uuml;berall in der Anwendung nach einzelnen Fragmenten suchen zu m&uuml;ssen.</p>

<p>Ein gro&szlig;es Problem mit dieser Technik ist allerdings, dass der Code gew&ouml;hnlich in einer statischen JavaScript-Datei gespeichert ist. Wie kann man also dynamischen, serverseitigen Inhalt in das Skript einf&uuml;gen, wo es ja nicht mehr inline im eigentlichen <em>View</em>-Code steht?</p>

<p>In HTML 5 kann man so genannte <em>custom data attributes</em> verwenden, um zu einem bestimmten Element geh&ouml;rige Daten in der Seite speichern kann. Diese Attribute sind genau wie alle anderen HTML-Attribute, nur ihr Name beginnt immer mit <code>data-</code>. Um beispielsweise die Nachricht, die angezeigt werden soll, wenn der Link angeklickt wird, von der Rails-Applikation aus dynamisch festzulegen, schreiben wir unseren Code um:</p>

<pre class="ruby">
&lt;a href=&quot;#&quot; id=&quot;alert&quot; data-message=&quot;Hello from UJS&quot;&gt;Click Here&lt;/a&gt;
</pre>
<p>In the JavaScript we can then alter the alert to show the text from our new attribute:</p>
<pre class="javascript">
$(function () {
  $(&#x27;#alert&#x27;).click(function () {
    alert(this.getAttribute(&#x27;data-message&#x27;));
    return false;
   })
});
</pre>

<p>Nach dem Neuladen der Seite sehen wir die Nachricht aus dem <code>data-</code>Attribut.</p>

<div class="imageWrapper">
  <img src="/system/photos/344/original/E205I02.png" width="747" height="440" alt="The alert created by unobtrusive JavaScript."/>
</div>

<h3>Wie Rails 3 <code>data</code>-Attribute verwendet</h3>

<p>Rails 3 nutzt diese <em>custom data attributes</em> bei der Umsetzung von unaufdringlichem JavaScript-Code, indem Daten an JavaScript &uuml;bergeben werden k&ouml;nnen. Betrachten wir nun, wie sich das in einer Rails-Anwendung einsetzen l&auml;sst. Unser Beispiel ist eine einfache eCommerce-Anwendung, die eine Liste von Produkten hat, die durchsucht werden kann. Dar&uuml;ber hinaus gibt es noch Links zum Bearbeiten und L&ouml;schen von Produkten. Die L&ouml;schen-Links scheinen nicht mehr richtig zu funktionieren:</p>

<div class="imageWrapper">
  <img src="/system/photos/345/original/E205I03.png" width="800" height="357" alt="The product page with the non-working destroy link."/>
</div>

<p>Dies ist ein typisches Problem mit Rails 3 Anwendungen. Wenn Sie gerade eine neue Applikation aufsetzen oder von einer fr&uuml;heren Version von Rails portieren, werden Sie feststellen, dass manche Stellen der Anwendung, an denen JavaScript verwendet wird, nicht mehr funktionieren!</p>

<p>Der <code>view</code>-Code der den &ldquo;Destroy&rdquo;-Link erzeugt ist ein normaler <code>link_to_method</code>-Aufruf mit einer <code>:confirm</code>-Option, die einen JavaScript-<code>confirm</code>-Dialog anzeigt und mit einer <code>:method</code>-Option, die auf <code>:delete</code> gesetzt ist, damit der Request nicht als einfacher <em>GET</em>-Request abgesetzt wird, sondern mit dem <em>DELETE</em>-Verb.</p>


<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;
</pre>
<p>What&rsquo;s interesting here is the HTML source that this code generates:</p>
<pre class="ruby">
&lt;a href=&quot;/products/8&quot; data-confirm=&quot;Are you sure?&quot; data-method=&quot;delete&quot; rel=&quot;nofollow&quot;&gt;Destroy&lt;/a&gt;
</pre>

<p>In Rails 2 wurde durch jeden <code>link_to</code>-Aufruf, der als Resultat einen Link auf einen <em>POST</em>-, <em>DELETE</em>- oder <em>PUT</em>Request haben sollte, jede Menge inline-JavaScript-Code erzeugt, der den <code>confirm</code>-Dialog ausl&ouml;ste und den entsprechenden Request durchf&uuml;hren sollte. Im Vergleich dazu ist der von Rails 3 ausgelieferte HTML-Code erheblich &uuml;bersichtlicher und durch die Nutzung von HTML 5 lassen sich auch mehrere Attribute erzeugen, beispielsweise ein <code>data-confirm</code>-Attribut, das die Best&auml;tigungsnachricht enth&auml;lt und ein weiteres <code>data-method</code>, das die eigentliche Methode beinhaltet.</p>

<p>Der Grund, warum die Links nicht funktionieren ist, dass bisher die ben&ouml;tigten JavaScript-Dateien im <code>head</code>-Bereich der Seite geladen werden und der Link daher einen normalen <em>GET</em>-Request ausl&ouml;st, da kein JavaScript das <code>click</code>-Event ver&auml;ndert hat.</p>

<p>Um dieses Problem zu l&ouml;sen, f&uuml;gt man einfach eine weitere Zeile in den <code>head</code>-Bereich ein:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag :defaults %&gt;
&lt;%= csrf_meta_tag %&gt;
</pre>

<p>Die erste Zeile sollte bekannt sein. Sie veranlasst, dass die Standard-JavaScript-Dateien f&uuml;r Rails-Anwendungen geladen werden. Die Zweite jedoch erzeugt zwei <code>meta</code>-Tags, die das <em>authenticity-Token</em> enthalten, die n&ouml;tig sind, um <em>DELETE</em>-Requests durchf&uuml;hren zu k&ouml;nnen. Laden wir also die Seite neu und betrachten wir den ausgelieferten HTML-Code, um die Ausgaben dieser beiden Zeilen zu sehen:</p>

<pre class="ruby">
&lt;script src=&quot;/javascripts/prototype.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/effects.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/dragdrop.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/controls.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/rails.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/application.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;meta name=&quot;csrf-param&quot; content=&quot;authenticity_token&quot;/&gt;
&lt;meta name=&quot;csrf-token&quot; content=&quot;9ImdFvbeW7ih9oKqBDQ3O889q/hJ1q5uajpT4DFDAoA=&quot;/&gt;
</pre>

<p>In der Seite laden wir jetzt also alle JavaScript-Dateien, die unsere Applikation braucht und haben zus&auml;tzlich zwei <code>meta</code>-Tags, die n&ouml;tig sind, um <em>cross-site request forgery</em> zu unterbinden. Dies versichert, dass <em>PUT</em>- und <em>DELETE</em>-Requests tats&auml;chlich vom richtigen Benutzer kommen und nicht einer anderen Seite oder von einem Hacker.</p>

<p>Sobald diese Vorbedingungen erf&uuml;llt sind, sollte der Link endlich wie erwartet funktionieren:</p>

<div class="imageWrapper">
  <img src="/system/photos/346/original/E205I04.png" width="802" height="360" alt="The destroy link now works."/>
</div>

<h3>Hinzuf&uuml;gen von <em>AJAX</em>-Funktionalit&auml;t zum Suchfeld</h3>

<p>Als N&auml;chstes ver&auml;ndern wir das Suchformular auf der <code>index</code>-Seite so, dass es beim Abschicken einen <em>AJAX</em>-Aufruf verwendet anstelle des bisher verwendeten <em>GET</em>-Requests. Der Code f&uuml;r das <code>index</code>-View lautet:</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Products&quot; %&gt;

&lt;% form_tag products_path, :method =&gt; :get do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;
&lt;% end %&gt;

&lt;div id=&quot;products&quot;&gt;
  &lt;%= render @products %&gt;
&lt;/div&gt;

&lt;p&gt;&lt;%= link_to &quot;New Product&quot;, new_product_path %&gt;&lt;/p&gt;
</pre>

<p>Das Formular, das hier verwendet wird, nutzt die Technik, die in <a href="http://railscasts.com/episodes/37-simple-search-form">Episode 37</a> vorgestellt wurde. In fr&uuml;heren Versionen von Rails musste man, um <em>AJAX</em>-Funktionalit&auml;t zu erreichen, den <code>form_tag</code> durch einen <code>form_remote_tag</code> ersetzen. Diese Methode generiert allerdings sehr viel inline-JavaScript, was wir jetzt ja gerade vermeiden wollen.</p>

<p>Viele der <code>remote</code>-Hilfsfunktionen ist nicht mehr verf&uuml;gbar in Rails 3. Um sie wieder freizuschalten, k&ouml;nnte man das <a href="http://github.com/rails/prototype_legacy_helper">Prototype Legacy Helper</a> Plugin installieren, doch wir gehen hier den neuen Rails-3-Weg.</p>

<p>Als Alternative zum <code>form_remote_tag</code> bleiben wir beim <code>form_tag</code> und f&uuml;gen einen neuen Parameter <code>:remote</code> hinzu.</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;% form_tag products_path, :method =&gt; :get, :remote =&gt; true do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>Dieser neue Parameter kann auch mit anderen Hilfsfunktionen wie <code>link_to</code>, <code>button_to</code> und <code>form_for</code> verwendet werden. Laden wir die Seite neu und betrachten, wie der neue Formular-Code funktioniert:</p>

<pre class="ruby">
&lt;form action=&quot;/products&quot; data-remote=&quot;true&quot; method=&quot;get&quot;&gt;  &lt;p&gt;
    &lt;input id=&quot;search&quot; name=&quot;search&quot; type=&quot;text&quot; /&gt;
    &lt;input type=&quot;submit&quot; value=&quot;Search&quot; /&gt;
  &lt;/p&gt;
&lt;/form&gt;
</pre>

<p>Das Formular-Element ist dasselbe wie zuvor, hat aber ein neues <code>data-remote</code>-Attribut. Es gibt kein inline-JavaScript, da das neue Attribut allein schon genug ist, um mit Hilfe des Codes in <em>rails.js</em> einen <em>AJAX</em>- anstelle eines <em>GET</em>-Requests auszul&ouml;sen.</p>

<p>Als N&auml;chstes m&uuml;ssen wir noch den Code schreiben, der die Antwort des <em>AJAX</em>-Aufrufs verarbeiten kann. Die Liste mit den Produkten ist in einem <code>div</code>-Container mit der ID <code>products</code>, also m&uuml;ssen wir einfach den Inhalt dieses <code>div</code>-Elements aktualisieren, um die angeforderten Suchergebnisse anzuzeigen. Das Formular wird zur <code>index</code>-Aktion des <code>ProductController</code>s abgeschickt, also m&uuml;ssen wir einfach ein neues <em>view</em>-Template <em>index.js.erb</em> erzeugen, das JavaScript-Anfragen beantworten kann.</p>

<p>Wir k&ouml;nnen in dieser Datei beliebigen JavaScript-Code schreiben, der ausgef&uuml;hrt wird, sobald er beim Browser angekommen ist. Der Code zum Aktualisieren des Inhalts des <code>products</code>-Containers sieht beispielsweise so aus:</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">
$(&quot;products&quot;).update(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);
</pre>
<p>When we reload the page and submit the form the search will be made with an AJAX call and we can see this as the page&rsquo;s URL doesn&rsquo;t change when the search is made.</p>

<div class="imageWrapper">
  <img src="/system/photos/347/original/E205I05.png" width="801" height="409" alt="The search form working with AJAX."/>
</div>

<p>Also kann man in Rails 3 sehr einfach unaufdringlichen JavaScript-Code f&uuml;r <em>AJAX</em>-Aufrufe schreiben, indem man den <code>:remote</code>-Parameter verwendet und ein JavaScript-Template f&uuml;r die entsprechende Aktion festlegt.</p>

<h3>Auswechseln des Frameworks</h3>

<p>Zu guter letzt demonstrieren wir noch, wie man die verwendeten JavaScript-Frameworks, die in unserer Applikation verwendet werden, gegen andere austauschen kann. Unsere Applikation verwendet momentan <em>Prototype</em>, das standardm&auml;ssig bei Rails dabei ist, doch was, wenn wir stattdessen <em>jQuery</em> verwenden m&ouml;chten?</p>

<p>Zuerst m&uuml;ssen wir die Einbindung im Hauptlayout</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag :defaults %&gt;
</pre>

<p>mit der folgenden Anweisung ersetzen:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag &quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot;, &quot;jquery.rails.js&quot; %&gt;
</pre>

<p>Die erste Datei in er Liste ist die neueste jQuery-Version frisch vom Google-Server. Das alleine gen&uuml;gt allerdings noch nicht, da wir ein &Auml;quivalent zur <em>rails.js</em>-Datei ben&ouml;tigen, die wir schon zuvor verwendet haben, um das Rails-spezifische JavaScript zu verarbeiten. Auf Github gibt es das offizielle <a href="http://github.com/rails/jquery-ujs">jquery-ujs Projekt</a>. Es beinhaltet eine <em>rails.js</em>-Datei, die heruntergeladen werden und in unseren Projekten verwendet werden kann. Wir haben die Datei heruntergeladen und im Ordner <em>/public/javascripts</em> abgelegt und es in <em>jquery.rails.js</em> umbenannt.</p>

<p>Jetzt m&uuml;ssen wir noch s&auml;mtliche Skripte, die in unserer Anwendung vorkommen, von <em>Prototype</em> auf <em>jQuery</em> umschreiben, da sich die Syntax der beiden Frameworks unterscheidet. Dies bringt also ein paar &Auml;nderungen in <em>index.js.erb</em> mit sich, beispielsweise <code>#products</code> als Selektor f&uuml;r das <code>div</code>-Element anstelle von <code>products</code> oder das Austauschen der <code>update</code>-Methode von <em>Prototype</em> durch die <em>jQuery</em>-Methode <code>html</code>.</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">
$(&quot;#products&quot;).html(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);
</pre>

<p>Unsere Anwendung wird sich jetz exakt so verhalten wie zuvor, nur dass unter der Motorhaube jQuery anstatt Prototype verwendet wird.</p>

<h3>Stilles Zur&uuml;ckfallen auf nicht-JavaScript-Funktionalit&auml;t</h3>

<p>Wenn ein Benutzer unsere Anwendung verwenden m&ouml;chte, dessen Browser kein JavaScript aktiviert hat, wird sich das Suchformular wie gehabt verhalten und beim Abschicken einen normalen <em>GET</em>-Aufruf ausf&uuml;hren. L&ouml;schen von Produkten wird jedoch nicht funktionieren. Dies ist ein gel&auml;ufiges Problem, da Rails JavaScript nutzt, um <em>DELETE</em> oder <em>PUT</em> zu simulieren, weil HTML-Links keine anderen als <em>GET</em>-Requests ausl&ouml;sen k&ouml;nnen. Eine m&ouml;gliche L&ouml;sung ist, den Link mit einem Button zu ersetzen, indem man <code>button_to</code> verwendet. Dummerweise k&ouml;nnen Buttons nur schwer in das Layout der Seite eingef&uuml;gt werden, weswegen in den meisten F&auml;llen nur ein Link in Frage kommt. Eine weitere Technik wurde bereits in <a href="http://railscasts.com/episodes/77-destroy-without-javascript">Episode 77</a> gezeigt, wobei eine eigene Best&auml;tigungs-Seite gezeigt wird, bevor die eigentliche L&ouml;schung vorgenommen wird.</p>
