<p>En esta nueva entrega de la serie en la que estamos repasando las nuevas funcionalidades de Rails 3 vamos a ver c&oacute;mo escribir Javascript no intrusivo.  El objetivo del Javascript no intrusivo es separar el comportamiento de una aplicaci&oacute;n web de su contenido, de manera similar a como CSS permite separar presentaci&oacute;n de contenido. Antes de empezar a escribir Javascript no intrusivo en Rails veremos un ejemplo con un documento sencillo.</p>

<p>La captura de pantalla de abajo muestra una p&aacute;gina web que contiene un enlace . Cuando se hace clic en dicho enlace aparece una alerta Javascript que dice &quot;Hello world!&quot;.</p>

<div class="imageWrapper">
  <img src="/system/photos/343/original/E205I01.png" alt="El mensaje de alerta que se muestra desde Javascript." height="337" width="639" />
</div>

<p>El HTML de esta p&aacute;gina es el siguiente:</p>
<pre class="ruby">
&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;UJS Example&lt;/title&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;&lt;a href=&quot;#&quot; onclick=&quot;alert(&#x27;Hello world!&#x27;); return false;&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>En esta p&aacute;gina tenemos un enlace con un atributo <code>onclick</code> que contiene algo de c&oacute;digo Javascript.  Est&aacute; al estilo intrusivo dado que el <em>script</em> est&aacute; incluido dentro del HTML, lo cual no es deseable porque estamos mezclando contenido y comportamiento.  All&aacute; por los a&ntilde;os 90 las p&aacute;ginas web se dise&ntilde;aban utilizando el elemento <code>&lt;font&gt;</code> para establecer la tipograf&iacute;a, tama&ntilde;o y color del texto porque a&uacute;n no ten&iacute;amos CSS.  Esto significaba que si quer&iacute;amos cambiar el tama&ntilde;o de todos los textos en p&aacute;rrafos de un sitio web tendr&iacute;amos que hacer potencialmente cientos de cambios. Cuando los navegadores empezaron a soportar CSS pudimos pasar esta informaci&oacute;n a las hojas de estilos y por tanto el aspecto de los sitios web se hizo mucho m&aacute;s f&aacute;cil de mantener.</p>

<p>Lo mismo ocurre con Javascript  Si ponemos peque&ntilde;os fragmentos de Javascript en los atributos de los elementos HTML de una p&aacute;gina se mezclan dos funcionalidades que hacen m&aacute;s dif&iacute;ciles de mantener el c&oacute;digo.  Si se movemos este Javascript a archivos separados se reduce la duplicaci&oacute;n, se facilita la refactorizaci&oacute;n y hace que sea mucho m&aacute;s sencillo escribir y depurar aplicaciones web complejas.</p>

<p>&iquest;C&oacute;mo podr&iacute;amos convertir en no intrusivo el Javascript de nuestro sencillo ejemplo anterior?  El paso principal es mover el Javascript que est&aacute; en el atributo <code>onclick</code> a un archivo separado y utilizar un framework Javascript (en este caso jQuery) para conectar estos scripts
con eventos sobre los elementos.  Veamos c&oacute;mo queda la p&aacute;gina con estos cambios:</p>

<pre class="ruby">
&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;UJS Example&lt;/title&gt;
    &lt;script src=&quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot; type=&quot;text/javascript&quot; charset=&quot;UTF-8&quot;&gt;&lt;/script&gt;
    &lt;script type=&quot;text/javascript&quot;charset=&quot;UTF-8&quot;&gt;
      $(function () {
        $(&#x27;#alert&#x27;).click(function () {
          alert(&#x27;Hello, world!&#x27;);
          return false;
        })
      });
    &lt;/script&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;&lt;a href=&quot;#&quot; id=&quot;alert&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>Lo primero que notamos es que a pesar de lo que dijimos m&aacute;s arriba no hemos trasladado el Javascript a su propio fichero, pero esto es s&oacute;lo para que los cambios sean m&aacute;s f&aacute;ciles de ver.</p>

<p>Hemos eliminado el atributo <code>onclick</code> del enlace y lo hemos cambiado por un <code>id</code> de forma que podamos localizar el enlace desde el c&oacute;digo jQuery.  Hemos a&ntilde;adido en la cabecera una referencia a la librer&iacute;a jQuery y justo despu&eacute;s el <em>script</em> que deber&iacute;a escribirse en el fichero externo.  Dicho <em>script</em> empieza invocando la funci&oacute;n <code>$</code> de jQuery con otra funci&oacute;n como argumento. Dicha funci&oacute;n se invocar&aacute; cuando termine de cargar el DOM de la p&aacute;gina y el c&oacute;digo en &eacute;l contiene una l&iacute;nea de c&oacute;digo jQuery que encuentra el enlace por el identificador y asocia al evento de clic una funci&oacute;n que muestra una alerta y devuelve <code>false</code> de forma que no se siga el enlace.</p>

<p>Si ahora recargamos la p&aacute;gina se comportar&aacute; como antes, mostrandose la alerta cuando se hace clic en el enlace.</p>

<p>Dado que hemos tomado  una l&iacute;nea de c&oacute;digo Javascript en l&iacute;nea y la hemos cambiado por seis bien podr&iacute;amos pensar que hemos hecho mucho trabajo a cambio de m&aacute;s bien poco.  El problema es que con un ejemplo tan sencillo como el que  hemos visto no podemos apreciar realmente la ventaja del Javascript no intrusivo: pretend&iacute;amos m&aacute;s bien ver c&oacute;mo se hace y compararlo. No empezaremos a comprobar realmente los beneficios de este estilo no intrusivo hasta que nuestra aplicaci&oacute;n tenga mucho m&aacute;s c&oacute;digo porque s&oacute;lo entonces veremos que es mucho m&aacute;s ventajoso tener todo el Javascript en su propio archivo separado.</p>

<p>El problema que tenemos con este enfoque es que el Javascript aparece normalmente un un fichero Javascript est&aacute;tico.  &iquest;C&oacute;mo podemos insertar contenido din&aacute;mico generado desde el servidor en este Javascript ahora que no podemos incluirlo en l&iacute;nea?</p>

<p>En HTML 5 podemos utilizar atributos de datos personalizados para guardar datos relacionados con cualquier elemento de una p&aacute;gina. Son iguales que cualquier otro atributo pero el nombre debe empezar por <code>data-</code>.  Podemos almacenar el mensaje que se mostrar&aacute; al hacer clic en el enlace de esta manera:</p>

<pre class="ruby">
&lt;a href=&quot;#&quot; id=&quot;alert&quot; data-message=&quot;Hello from UJS&quot;&gt;Click Here&lt;/a&gt;
</pre>

<p>Y luego en el Javascript podemos alterar la alerta para mostrar el texto a partir de este nuevo atributo:</p>

<pre class="javascript">
$(function () {
  $(&#x27;#alert&#x27;).click(function () {
    alert(this.getAttribute(&#x27;data-message&#x27;));
    return false;
   })
});
</pre>

<p>Si volvemos a cargar la p&aacute;gina veremos el mensaje recuperado del atributo <code>data-message</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/344/original/E205I02.png" alt="El mensaje de alerta creado usando Javascript no intrusivo." height="440" width="747" />
</div>

<h3>C&oacute;mo se usan los atributos de datos en Rails 3</h3>

<p>Rails 3 puede utilizar estos atributos con datos personalizados como forma de pasar datos a Javascript.  Vamos a ver c&oacute;mo se aplica esto a una aplicaci&oacute;n Rails.  Supongamos que tenemos una aplicaci&oacute;n sencilla de comercio electr&oacute;nico que tiene una lista de productos sobre los que se pueden realizar b&uacute;squedas.  Tambi&eacute;n hay enlaces para editar y destruir productos y es cuando destruimos un producto cuando nos encontramos con el primer problema porque el enlace parece no funcionar.</p>

<div class="imageWrapper">
  <img src="/system/photos/345/original/E205I03.png" alt="La p&aacute;gina de producto con el enlace que no funciona." height="357" width="800" />
</div>

<p>Este problema es frecuente en aplicaciones Rails 3. Si estamos creando o migrando un aplicaci&oacute;n a partir de una versi&oacute;n antigua de Rails podemos encontrarnos con que hay partes de la aplicaci&oacute;n que usan Javascript que han dejado de funcionar.</p>

<p>El c&oacute;digo de la vista que genera el enlace &ldquo;Destroy&rdquo; es el m&eacute;todo <code>link_to</code> con la opci&oacute;n <code>:confirm</code> para mostrar una alerta Javascript y la opci&oacute;n <code>:method</code> con el valor <code>:delete</code> de forma que la petici&oacute;n se env&iacute;a como una petici&oacute;n DELETE en lugar de GET.</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;
</pre>

<p>Aqu&iacute; lo interesante es ver el c&oacute;digo fuente HTML generado por este c&oacute;digo:</p>

<pre class="ruby">
&lt;a href=&quot;/products/8&quot; data-confirm=&quot;Are you sure?&quot; data-method=&quot;delete&quot; rel=&quot;nofollow&quot;&gt;Destroy&lt;/a&gt;
</pre>

<p>En Rails 2, si usamos el m&eacute;todo <code>link_to</code> para crear un enlace de borrado se generar&aacute; una gran cantidad de c&oacute;digo Javascript para crear el di&aacute;logo de confirmaci&oacute;n y un formulario para simular una petici&oacute;n DELETE o PUT.  En comparaci&oacute;n, el c&oacute;digo generado por Rails 3 es mucho m&aacute;s limpio y crea dos atributos de datos de HTML5: uno llamado <code>data-confirm</code> que contiene el mensaje de confirmaci&oacute;n y otro llamado <code>data-method</code> que contiene el m&eacute;todo propiamente dicho.</p>

<p>El motivo por el que el enlace no funciona es que no estamos haciendo referencia a los ficheros Javascript en la cabecera de la p&aacute;gina por lo que el m&eacute;todo se comportar&aacute; como un enlace normal y efectuar&aacute; una petici&oacute;n GET dado que nadie le est&aacute; diciendo que haga otra cosa.</p>

<p>Para arreglar esto tan s&oacute;lo tenemos que a&ntilde;adir las dos l&iacute;nea siguientes a la secci&oacute;n <code>head</code> del fichero de <em>layout</em> de nuestra aplicaci&oacute;n:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag :defaults %&gt;
&lt;%= csrf_meta_tag %&gt;
</pre>

<p>La primera l&iacute;nea ya deber&iacute;a resultarnos familiar: incluye los archivos Javascript est&aacute;ndar en una aplicaci&oacute;n Rails.  La segunda l&iacute;nea crea dos etiquetas <code>meta</code> donde se guarda el <em>token</em> de autenticaci&oacute;n que es necesario para hacer peticiones DELETE. Si recargamos la p&aacute;gina y vemos el c&oacute;digo fuente comprobaremos el HTML generado por estas dos l&iacute;neas.</p>

<pre class="ruby">
&lt;script src=&quot;/javascripts/prototype.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/effects.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/dragdrop.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/controls.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/rails.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/application.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;meta name=&quot;csrf-param&quot; content=&quot;authenticity_token&quot;/&gt;
&lt;meta name=&quot;csrf-token&quot; content=&quot;9ImdFvbeW7ih9oKqBDQ3O889q/hJ1q5uajpT4DFDAoA=&quot;/&gt;
</pre>

<p>Con esto estamos incluyendo todos los ficheros Javascript que necesita nuestra aplicaci&oacute;n y definiendo  las dos etiquetas <code>meta</code> que hacen falta para evitar peticiciones XSS falsas, que garantizan que las peticiones PUT y DELETE vienen del usuario correcto y no de un <em>hacker</em> u otro lugar.</p>

<p>Con estos dos elementos en su lugar nuestro enlace de borrado ya funciona como ser&iacute;a de esperar:</p>

<div class="imageWrapper">
  <img src="/system/photos/346/original/E205I04.png" alt="Ahora funciona el enlace de borrado." height="360" width="802" />
</div>

<h3>Formulario de b&uacute;squeda con AJAX</h3>

<p>A continuaci&oacute;n vamos a modificar el formulario de b&uacute;squeda de la p&aacute;gina principal para que utilice AJAX en lugar de hacer una petici&oacute;n GET normal. Veamos el c&oacute;digo de la vista <code>index</code> que contiene el formulario:</p>


<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Products&quot; %&gt;

&lt;% form_tag products_path, :method =&gt; :get do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;
&lt;% end %&gt;

&lt;div id=&quot;products&quot;&gt;
  &lt;%= render @products %&gt;
&lt;/div&gt;

&lt;p&gt;&lt;%= link_to &quot;New Product&quot;, new_product_path %&gt;&lt;/p&gt;
</pre>

<p>El formulario que hemos usado para las b&uacute;squedas utiliza la t&eacute;cnica vista en el <a href="http://railscasts.com/episodes/37-simple-search-form">episodio 37</a>. En las versiones anteriores de Rails para que el formulario funcionase con AJAX cambi&aacute;bamos <code>form_tag</code> por <code>form_remote_tag</code>. Este m&eacute;todo genera demasiado Javascript en l&iacute;nea, que es precisamente lo que queremos evitar.</p>

<p>Muchos de los m&eacute;todos <em>helper</em> remotos ya no est&aacute;n disponibles en Rails 3.  Podemos recuperarlos instalando el <em>plugin</em> <a 
href="http://github.com/rails/prototype_legacy_helper">Prototype Legacy Helper</a> pero en vez de esto vamos a utilizar el nuevo enfoque de Rails 3, que consiste en seguir utilizando <code>form_tag</code> en lugar de <code>form_remote_tag</code>, pero a&ntilde;adiendo un nuevo par&aacute;metro llamado <code>:remote</code>.</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre style="display: none;" class="ruby">
&lt;% form_tag products_path, :method =&gt; :get, :remote =&gt; true do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>El par&aacute;metro <code>:remote</code> tambi&eacute;n se puede usar con otros m&eacute;todos como <code>link_to</code>, <code>button_to</code> y <code>form_for</code>. Si recargamos la p&aacute;gina y miramos el c&oacute;digo fuente veremos c&oacute;mo funciona el nuevo c&oacute;digo del formulario.</p>

<pre class="ruby">
&lt;form action=&quot;/products&quot; data-remote=&quot;true&quot; method=&quot;get&quot;&gt;  &lt;p&gt;
  &lt;input id=&quot;search&quot; name=&quot;search&quot; type=&quot;text&quot; /&gt;
    &lt;input type=&quot;submit&quot; value=&quot;Search&quot; /&gt;
  &lt;/p&gt;
&lt;/form&gt;
</pre>

<p>El elemento <code>form</code> es el mismo que antes pero ahora tiene un nuevo atributo llamado <code>data-remote</code>. No hay Javascript en l&iacute;nea bastar&aacute; con el nuevo atributo para decirle a Javascript en <code>rails.js</code> que el formulario debe enviarse usando AJAX.</p>

<p>El listado de productos aparece en un <code>div</code> con un <code>id</code> llamado <code>products</code> de forma que podemos actualizar este <code>div</code> para mostrar los resultados apropiados.  El formulario se env&iacute;a a la acci&oacute;n <code>index</code> de <code>ProductController</code> y lo &uacute;nico que tenemos que hacer es a&ntilde;adir una nueva vista para las peticiones Javascript llamada <code>index.js.erb</code>.</p>

<p>En esta vista podemos escribir el Javascript que queramos que se ejecute cuando sea devuelta al navegador.  El c&oacute;digo de esta nueva plantilla actualiza los contenidos de la capa con productos con el listado de productos.</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">
$(&quot;products&quot;).update(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);
</pre>

<p>Si recargamos la p&aacute;gina y hacemos una b&uacute;squeda, &eacute;sta se har&aacute; con una llamada AJAX y veremos que la URL de la p&aacute;gina no cambia cuando se realice dicha b&uacute;squeda.</p>


<div class="imageWrapper">
  <img src="/system/photos/347/original/E205I05.png" alt="El formulari de b&uacute;squeda con AJAX." height="409" width="801" />
</div>

<p>Como vemos en Rails 3 es f&aacute;cil de hacer AJAX de forma no obtrusiva utilizando el par&aacute;metro <code>:remote</code> y ejecutando el Javascript devuelto por el servidor.</p>


<h3>Cambio de <em>Frameworks</em></h3>

<p>Terminaremos este episodio viendo c&oacute;mo cambiar el <em>framework</em> Javascript utilizado por nuestra aplicaci&oacute;n.  Ahora mismo estamos usando
Prototype, que viene por defecto con Rails pero, &iquest;y si queremos usar jQuery?</p>

<p>En primer lugar tendremos que cambiar esta l&iacute;nea en el <em>layout</em> de nuestra aplicaci&oacute;n:</p>


<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag :defaults %&gt;
</pre>

<p>por esta:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;%= javascript_include_tag &quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot;, &quot;jquery.rails.js&quot; %&gt;
</pre>

<p>El primer fichero de la lista es la &uacute;ltima versi&oacute;n de jQuery servida desde Google.  Esto por s&iacute; solo no es suficiente porque necesitamos el equivalente del fichero <code>rails.js</code> que hemos usado antes para manejar el Javascript no intrusivo.  Podemos obtener
la versi&oacute;n oficial del proyecto <a href="http://github.com/rails/jquery-ujs">jquery-ujs en Github</a>. Este proyecto publica un archivo <code>rails.js</code> podemos descargar y utilizar en nuestros pryectos.  Lo hemos puesto en el directorio <code>/public/javascripts</code> de nuestra aplicaci&oacute;n y lo hemos renombrado como <code>jquery.rails.js</code>. Este fichero gestinar&aacute; todo el Javascript no intrusivo de Rails.</p>

<p>A continuaci&oacute;n tenemos que modificar todo el c&oacute;digo Javascript que hemos escrito para utilizar c&oacute;digo compatible con jQuery.  Tendremos que hacer un par de peque&ntilde;os cambios en el c&oacute;digo de <code>index.js.erb</code> utilizando <code>#products</code> en lugar de <code>products</code> com el selector de la capa de productos y cambiando el m&eacute;todo <code>update</code> de Prototype por su equivalente jQuery <code>html</code>.</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">
$(&quot;#products&quot;).html(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);
</pre>

<p>Ahora nuestra aplicaci&oacute;n funcionar&aacute; igual que antes pero utilizando jQuery en lugar de Prototype.</p>

<h3>Degradaci&oacute;n gr&aacute;cil</h3>

<p>Si un usuario carga nuestra aplicaci&oacute;n utilizando un navegador que no tiene Javascript activado el formulario degradar&aacute; gr&aacute;cilmente y ejecutar&aacute; una petici&oacute;n GET normal al enviarse.  No funcionar&aacute; por tanto el borrado de productos porque los enlaces HTML s&oacute;lo pueden realizar peticiones GET (este es el motivo por el que Rails utiliza Javascript para simular la petici&oacute;n DELETE).  Una soluci&oacute;n a esto es cambiar el enlace con un bot&oacute;n utilizando <code>button_to</code> pero esto puede quedar poco atractivo por lo que preferimos seguir con un enlace.  Una t&eacute;cnica preferible es la descrita en el <a href="http://railscasts.com/episodes/77-destroy-without-javascript">episodio 77</a> que muestra una p&aacute;gina de confirmaci&oacute;n separada antes de borrar un elemento con un navegador que tiene desactivado Javascript.</p>