<p>Rails 3 &ouml;zelliklerini inceledi&#x11F;imiz serinin bu b&ouml;l&uuml;m&uuml;nde unobstrusive 
Javascript&#x27;in kullan&#x131;m&#x131;n&#x131; inceleyece&#x11F;iz. Unobtrusive Javascript ile web 
uygulamas&#x131;nda javascript kod ile i&ccedil;eri&#x11F;i birbirinden CSS de oldu&#x11F;u gibi 
ayr&#x131;l&#x131;r. Unobtrusive Javascript&#x27;i Rails&#x27;de kullanmaya ba&#x15F;lamadan &ouml;nce basit 
bir HTML d&ouml;k&uuml;man i&ccedil;inde kullanal&#x131;m.</p>

<p>A&#x15F;a&#x11F;&#x131;daki ekran g&ouml;r&uuml;nt&uuml;s&uuml; &uuml;zerinde bir link olan bir web sayfas&#x131;n&#x131; 
g&ouml;steriyor. Link t&#x131;kland&#x131;&#x11F;&#x131;nda Javascript alarm popup a&ccedil;&#x131;l&#x131;r ve &quot;Hello world!&quot; 
mesaj&#x131; verir.</p>

<div class="imageWrapper">
  <img src="/system/photos/343/original/E205I01.png" alt="The alert shown by the inline JavaScript." height="337" width="639">
</div>

<p>Bu sayfan&#x131;n HTML kodu &#x15F;una benzer:</p>
<pre class="ruby">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
      &lt;title&gt;UJS Example&lt;/title&gt;
  &lt;/head&gt;
  &lt;body&gt;
      &lt;h1&gt;&lt;a href=&quot;#&quot; onclick=&quot;alert(&#x27;Hello world!&#x27;); return false;&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>Sayfada bir linkimiz var ve onclick &ouml;zelli&#x11F;ine de bir Javascript kod
yaz&#x131;lm&#x131;&#x15F;. Script HTML i&ccedil;inde birle&#x15F;ik oldu&#x11F;undan unobtrusive de&#x11F;ildir
ve iyi bir &#x15F;ey de&#x11F;ildir, &ccedil;&uuml;nk&uuml; i&ccedil;erik ve kod birbirine kar&#x131;&#x15F;&#x131;yor.
1990&#x27;lar&#x131;n sayfalar&#x131;nda CSS olmad&#x131;&#x11F;&#x131; i&ccedil;in &lt;font&gt; tag&#x27;i ile yaz&#x131;
g&ouml;r&uuml;n&uuml;m&uuml; de&#x11F;i&#x15F;tirilirdi, sayfada y&uuml;zlerce bunlardan olurdu. Taray&#x131;c&#x131;lar
CSS kullanmaya ba&#x15F;lay&#x131;nca stil bilgileri stylesheet dosyalar&#x131;nda
toplanmaya ba&#x15F;lad&#x131; ve hem de&#x11F;i&#x15F;iklik yap&#x131;lmas&#x131; kolayla&#x15F;t&#x131; hem daha
anla&#x15F;&#x131;l&#x131;r oldu.</p>

<p>Ayn&#x131;s&#x131; Javascript&#x27;e de uygulanabilir. K&uuml;&ccedil;&uuml;k k&uuml;&ccedil;&uuml;k Javascript kod
par&ccedil;alar&#x131; HTML taglar&#x131;n &ouml;zellikleri i&ccedil;inde yaz&#x131;l&#x131;rsa de&#x11F;i&#x15F;iklik yapmak
zorla&#x15F;&#x131;r. Javascript&#x27;i ayr&#x131; bir dosyaya koyunca tekrarlayan kodlar
azal&#x131;r, d&uuml;zenlemeler kolayla&#x15F;&#x131;r ve karma&#x15F;&#x131;k uygulamalar&#x131; &uuml;retmek ve
debug kolayla&#x15F;&#x131;r.</p>

<p>&Ouml;rne&#x11F;imizi nas&#x131;l unobtrusive yapaca&#x11F;&#x131;z? Ana ad&#x131;m, onclick
&ouml;zelli&#x11F;indeki Javascript&#x27;i ayr&#x131; bir dosyaya ta&#x15F;&#x131;mak ve bunun i&ccedil;in bir
Javascript framework kullanaca&#x11F;&#x131;z. Burada JQuery ile elemanlar&#x131;n
olaylar&#x131;n&#x131; alg&#x131;layaca&#x11F;&#x131;z. &Ouml;nce sayfan&#x131;n de&#x11F;i&#x15F;mi&#x15F;ini
bir g&ouml;relim sonra a&ccedil;&#x131;klayal&#x131;m.</p>

<pre class="ruby">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;UJS Example&lt;/title&gt;
    &lt;script src=&quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot; type=&quot;text/javascript&quot; charset=&quot;UTF-8&quot;&gt;&lt;/script&gt;
    &lt;script type=&quot;text/javascript&quot;charset=&quot;UTF-8&quot;&gt;
      $(function () {
        $(&#x27;#alert&#x27;).click(function () {
          alert(&#x27;Hello, world!&#x27;);
          return false;
        })
      });
    &lt;/script&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;&lt;a href=&quot;#&quot; id=&quot;alert&quot;&gt;Click Here&lt;/a&gt;&lt;/h1&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>&#x130;lk Dikkat &ccedil;eken nokta Javascript&#x27;i daha &ouml;nce s&ouml;yledi&#x11F;imiz gibi ayr&#x131;
bir dosyaya &ccedil;&#x131;karmad&#x131;k. Bunu sadece burda g&ouml;sterim i&ccedil;in yapt&#x131;k.</p> 

<p>Body i&ccedil;indeki eleman&#x131;n <code>onclick</code> &ouml;zelli&#x11F;ini kald&#x131;r&#x131;p ona bir <code>id</code>
verdik. Bu sayede hedefe JQuery &uuml;zerinden bir ba&#x11F;lant&#x131; yapabiliriz.
Daha sonra head b&ouml;l&uuml;m&uuml;nde JQuery k&uuml;t&uuml;phanesini y&uuml;kl&uuml;yoruz ve bunun
alt&#x131;nda d&#x131;&#x15F; dosyaya koyaca&#x11F;&#x131;m&#x131;z script g&ouml;r&uuml;n&uuml;yor. Script JQuery&#x27;nin <span style="font-weight: bold;">$</span>
fonksiyonunu bir fonksiyon arg&uuml;man&#x131; ile &ccedil;a&#x11F;&#x131;r&#x131;yor. Arg&uuml;mandaki bu
fonksiyon sayfa DOM y&uuml;klemesinde &ccedil;a&#x11F;r&#x131;l&#x131;r. Bu fonksiyon JQuery ile
eleman&#x131; id&#x27;sinden bulur ve click olay&#x131;na bir fonksiyon ba&#x11F;lar. Ba&#x11F;lanan
fonksiyon ise bir alert ile mesaj verir ve geriye false d&ouml;nerek link
ba&#x11F;lant&#x131;s&#x131;na gidilmesini engeller.</p>

<p>E&#x11F;er sayfay&#x131; &#x15F;imdi tazelersek aynen bir &ouml;ncekinin yapt&#x131;&#x11F;&#x131;n&#x131;
yapacakt&#x131;r. T&#x131;klan&#x131;nca bir alarm verecektir.</p> 

<p>Burda &ccedil;ok i&#x15F; yapmam&#x131;za ra&#x11F;men kar&#x15F;&#x131;l&#x131;&#x11F;&#x131;nda
pek bir &#x15F;ey elde etmedik. Burada Unobtrusive Javascript avantajlar&#x131;n&#x131;
pek g&ouml;remedik tek sat&#x131;r Javascript yerine 6 sat&#x131;r oldu. Bu &ouml;rnek sadece
Unobtrusive Javascript&#x27;in mant&#x131;&#x11F;&#x131;n&#x131; anlatmak i&ccedil;in yap&#x131;ld&#x131;. Unobtrusive
Javascript&#x27;in avantaj&#x131; sayfadaki Javascript say&#x131;s&#x131; artt&#x131;k&ccedil;a ortaya
&ccedil;&#x131;kmaya ba&#x15F;lar. T&uuml;m Javascript kodlar&#x131;n&#x131; ayr&#x131; bir dosyada tutmak
sayesinde tekrarlamalar&#x131;n &ouml;n&uuml;ne ge&ccedil;ilmeye ba&#x15F;lan&#x131;r.</p>

<p>Bu yakla&#x15F;&#x131;m&#x131;n bir sorunu var. JavaScript genellikle statik bir
dosyaya yaz&#x131;l&#x131;yor. Bu durumda sat&#x131;r i&ccedil;ine yazmad&#x131;&#x11F;&#x131;m&#x131;za g&ouml;re nas&#x131;l
server taraf&#x131; dinamik JavaScript ekleyebilece&#x11F;iz?</p> 

<p>HTML 5 ile birlikte art&#x131;k &#x131;smarlama verileri ilgili eleman tag i&ccedil;ine
&ouml;zellik olarak koyabiliyoruz. Bunlar ayn&#x131; di&#x11F;er &ouml;zellikler gibi
yaz&#x131;l&#x131;yor, tek farklar&#x131; <code>data-</code> ile ba&#x15F;lamalar&#x131;. Mesela
t&#x131;klan&#x131;nca verilecek mesaj&#x131; &ouml;zellikte saklamak i&ccedil;in &#x15F;&ouml;yle yaz&#x131;n:</p>

<pre class="ruby">&lt;a href=&quot;#&quot; id=&quot;alert&quot; data-message=&quot;Hello from UJS&quot;&gt;Click Here&lt;/a&gt;<br>
</pre>
<p>JavaScript&#x27;de alert sat&#x131;r&#x131;n&#x131; mesaj&#x131; bu yeni &ouml;zellikten alacak
&#x15F;ekilde de&#x11F;i&#x15F;tirelim:</p>
<pre class="javascript">$(function () {
  $(&#x27;#alert&#x27;).click(function () {
    alert(this.getAttribute(&#x27;data-message&#x27;));
    return false;
   })
});
</pre>
<p>E&#x11F;er sayfay&#x131; tazelersek linki t&#x131;klay&#x131;nca &ouml;zeliikten gelen mesaj&#x131;
alabiliriz.</p>

<div class="imageWrapper">
  <img src="/system/photos/344/original/E205I02.png" alt="The alert created by unobtrusive JavaScript." height="440" width="747">
</div>

<h3>Rails 3 Data &Ouml;zelliklerini Nas&#x131;l Kullan&#x131;r</h3>

<p>Rails 3 bu &#x131;smarlama data &ouml;zellikler ile veriyi JavaScript&#x27;e
g&ouml;nderir. &#x15E;imdi bunun bir Rails 3 uygulamas&#x131;nda nas&#x131;l olaca&#x11F;&#x131;n&#x131;
inceleyelim. Uygulamam&#x131;z i&ccedil;inde arama yap&#x131;labilecek &uuml;r&uuml;nlerin listesi
bulunan basit bir e-al&#x131;&#x15F;veri&#x15F; uygulamas&#x131;. Ayr&#x131;ca &uuml;r&uuml;n&uuml; d&uuml;zenlemek ve
silmek i&ccedil;in de linkler var , ama silmek i&ccedil;in olan &ccedil;al&#x131;&#x15F;m&#x131;yor gibi.</p>

<div class="imageWrapper">
  <img src="/system/photos/345/original/E205I03.png" alt="The product page with the non-working destroy link." height="357" width="800">
</div>

<p>Bu Rails 3 uygulamalar&#x131;nda s&#x131;k kar&#x15F;&#x131;la&#x15F;&#x131;lan bir sorundur. E&#x11F;er eski
bir versiyon uygulamay&#x131; upgrade ediyorsan&#x131;z, JavaScript&#x27;lerin
&ccedil;al&#x131;&#x15F;mamas&#x131; &ccedil;ok kar&#x15F;&#x131;la&#x15F;&#x131;lan bir durumdur.</p>

<p>G&ouml;rsel dosyas&#x131;ndaki kod &quot;Destroy&quot; linkini standart link_to metodunu
kullanarak &uuml;retir. :confirm opsiyonu ile bir JavaScript <code>confirm</code> 
alarm&#x131; &uuml;retilir ve <code>:method</code> opsiyonu da <code>:delete</code> 
olarak ayarlanm&#x131;&#x15F;t&#x131;r. B&ouml;ylece link t&#x131;klan&#x131;nca GET yerine DELETE
metoduna &ccedil;a&#x11F;r&#x131; yap&#x131;lacakt&#x131;r.</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">&lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;<br></pre>
<p>Burada enteresan olan bu kodun &uuml;retti&#x11F;i HTML kod:</p>
<pre class="ruby">&lt;a href=&quot;/products/8&quot; data-confirm=&quot;Are you sure?&quot; data-method=&quot;delete&quot; rel=&quot;nofollow&quot;&gt;Destroy&lt;/a&gt;<br></pre>

<p>Rails 2&#x27;de destroy link olu&#x15F;turmak i&ccedil;in <code>link_to</code> kullan&#x131;nca 
bir s&uuml;r&uuml; JavaScript ile <code>confirm</code> diyalo&#x11F;u olu&#x15F;turuluyor ve bir form ile DELETE ya da PUT &ccedil;a&#x11F;r&#x131;s&#x131;
yap&#x131;l&#x131;yordu. Rails 3 koduna bakarsan&#x131;z daha temiz ve daha &ouml;nce
g&ouml;rd&uuml;&#x11F;&uuml;m&uuml;z HTML 5 data &ouml;zelliklerini kullan&#x131;yor. Onay mesaj&#x131;n&#x131; i&ccedil;eren
bir <code>data-confirm</code>  ve metodu saklayan bir data-method
&ouml;zelli&#x11F;i.</p>

<p>Linkin &ccedil;al&#x131;&#x15F;mama sebebi head b&ouml;l&uuml;m&uuml;nde JavaScript fonksiyon
tan&#x131;mlanmad&#x131;&#x11F;&#x131; i&ccedil;in , standart bir GET &ccedil;a&#x11F;r&#x131;s&#x131; yap&#x131;lacak ve silme
i&#x15F;lemi DELETE &ccedil;a&#x11F;r&#x131;lmad&#x131;&#x11F;&#x131; i&ccedil;in ger&ccedil;ekle&#x15F;meyecektir.</p>

<p>Bunu d&uuml;zeltmek i&ccedil;in uygulaman&#x131;n layout dosyas&#x131;na a&#x15F;a&#x11F;&#x131;daki iki
sat&#x131;r&#x131; eklemeliyiz:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= javascript_include_tag :defaults %&gt;<br>
&lt;%= csrf_meta_tag %&gt;<br>
</pre>

<p>Yukardaki ilk sat&#x131;r tan&#x131;d&#x131;k gelecektir. Bir Rails uygulamas&#x131; i&ccedil;in
standart JavaScript dosyalar&#x131; y&uuml;kl&uuml;yor. &#x130;kinci sat&#x131;r DELETE i&#x15F;lemlerini
ger&ccedil;ekle&#x15F;tirmek i&ccedil;in gerekli yetkilendirme bilgilerini ta&#x15F;&#x131;yan iki
metatag &uuml;retir. De&#x11F;i&#x15F;im sonras&#x131; sayfay&#x131; tazelersek &uuml;retilen iki sat&#x131;r&#x131;
g&ouml;rece&#x11F;iz.</p>

<pre class="ruby">&lt;script src=&quot;/javascripts/prototype.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/effects.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/dragdrop.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/controls.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/rails.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;script src=&quot;/javascripts/application.js?1268677667&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;
&lt;meta name=&quot;csrf-param&quot; content=&quot;authenticity_token&quot;/&gt;
&lt;meta name=&quot;csrf-token&quot; content=&quot;9ImdFvbeW7ih9oKqBDQ3O889q/hJ1q5uajpT4DFDAoA=&quot;/&gt;
</pre>

<p>&#x15E;imdi sayfada t&uuml;m JavaScript dosyalara eri&#x15F;im ve cross-site
sald&#x131;r&#x131;lara kar&#x15F;&#x131; t&uuml;m &ouml;nlemler mevcuttur. B&ouml;ylece PUT ve DELETE
&ccedil;a&#x11F;r&#x131;lar&#x131;n&#x131;n bir hacker taraf&#x131;ndan de&#x11F;il do&#x11F;ru ki&#x15F;iden geldi&#x11F;inden emin
olabiliriz.</p> 

<p>Bu iki sat&#x131;rla beraber bizim destroy linkimiz beklendi&#x11F;i gibi
&ccedil;al&#x131;&#x15F;acakt&#x131;r.</p>

<div class="imageWrapper">
  <img src="/system/photos/346/original/E205I04.png" alt="The destroy link now works." height="360" width="802">
</div>

<h3>Bir Arama Formuna AJAX Eklemek</h3>

<p>Sonra index sayfas&#x131;ndaki arama formunu de&#x11F;i&#x15F;tirerek GET &ccedil;a&#x11F;r&#x131;s&#x131;
yerine AJAX kullanmas&#x131;n&#x131; sa&#x11F;l&#x131;yaca&#x11F;&#x131;z. <code>Index</code> g&ouml;rselindeki form i&ccedil;in kod
a&#x15F;a&#x11F;&#x131;da g&ouml;steriliyor:</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">&lt;% title &quot;Products&quot; %&gt;

&lt;% form_tag products_path, :method =&gt; :get do %&gt;
  &lt;p&gt;    
  &lt;%= text_field_tag :search, params[:search] %&gt;
  &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;
&lt;% end %&gt;

&lt;div id=&quot;products&quot;&gt;
  &lt;%= render @products %&gt;
&lt;/div&gt;

&lt;p&gt;&lt;%= link_to &quot;New Product&quot;, new_product_path %&gt;&lt;/p&gt;
</pre>

<p>Burada kullan&#x131;lan form <a href="http://railscasts.com/episodes/37-simple-search-form">episode 37</a>. 
 de g&ouml;sterilen teknikle arama yapmak i&ccedil;indir. Rails&#x27;in &ouml;nceki
versiyonlar&#x131;nda formun AJAX ile &ccedil;al&#x131;&#x15F;mas&#x131; i&ccedil;in&nbsp;<code>form_tag</code> ile 
<code>form_remote_tag</code> de&#x11F;i&#x15F;tirilirdi. Bu metod &#x15F;imdi
sak&#x131;nmaya &ccedil;al&#x131;&#x15F;t&#x131;&#x11F;&#x131;m&#x131;z sat&#x131;r i&ccedil;i JavaScript&#x27;ten bir s&uuml;r&uuml; &uuml;retecektir.</p>

<p>Rails 3 ile beraber bir&ccedil;ok remote helper metod art&#x131;k kullan&#x131;lamaz
oldu. E&#x11F;er kullanmak istersek 
<a href="http://github.com/rails/prototype_legacy_helper">Prototype Legacy Helper</a> 
 plugin install etmeliyiz.</p>

<p>Bunu <code>form_remote_tag</code> ile yapmak yerine yine <code>form_tag</code>, 
kullan&#x131;yoruz ama yeni bir parametre ile  <code>:remote</code>.</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>

<pre class="ruby">&lt;% form_tag products_path, :method =&gt; :get, :remote =&gt; true do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search&quot;, :name =&gt; nil %&gt;
  &lt;/p&gt;<br>&lt;% end %&gt;
</pre>

<p>Bu <code>:remote</code> parametresi ayr&#x131;ca <code>link_to</code>, 
<code>button_to</code> ve <code>form_for</code> gibi di&#x11F;er helper metodlarla 
da kullan&#x131;labilir. E&#x11F;er sayfay&#x131; tazeleyip kayna&#x11F;&#x131; incelersek yeni form kodumuzun 
nas&#x131;l &ccedil;al&#x131;&#x15F;t&#x131;&#x11F;&#x131;n&#x131; g&ouml;r&uuml;r&uuml;z.</p>

<pre class="ruby">&lt;form action=&quot;/products&quot; data-remote=&quot;true&quot; method=&quot;get&quot;&gt;  &lt;p&gt;
    &lt;input id=&quot;search&quot; name=&quot;search&quot; type=&quot;text&quot; /&gt;
    &lt;input type=&quot;submit&quot; value=&quot;Search&quot; /&gt;
  &lt;/p&gt;<br>&lt;/form&gt;
</pre>

<p>Form eleman&#x131; ayn&#x131; ama bu sefer yeni bir <code>data-remote</code>
&ouml;zelli&#x11F;i var. Sat&#x131;r i&ccedil;i JavaScript yok, yeni &ouml;zellik&nbsp; <code>rails.js</code>
i&ccedil;indeki JavaScript&#x27;e formun AJAX yoluyla g&ouml;nderildi&#x11F;ini anlatmaya
yeter.</p>

<p>S&#x131;rada AJAX &ccedil;a&#x11F;r&#x131;s&#x131;n&#x131; i&#x15F;leyecek kodu yazmak var. &Uuml;r&uuml;nlerin listesi
bir&nbsp; <code>div</code> i&ccedil;ersinde bulunuyor. Bu&nbsp; <code>div</code>&nbsp;
i&ccedil;eri&#x11F;ini update ederek sadece aranan &uuml;r&uuml;nleri g&ouml;sterebiliriz.
Form&nbsp; <code>ProductController</code>&rsquo;in
<code>index</code> eylemine g&ouml;nderiliyor ve t&uuml;m ihtiyac&#x131;m&#x131;z olan
JavaScript isteklerini i&#x15F;leyecek bir&nbsp; <code>index.js.erb</code>
dosyas&#x131; eklemek<code>.</code></p>

<p>Bu kal&#x131;p dosyaya taray&#x131;c&#x131;ya d&ouml;n&uuml;ld&uuml;&#x11F;&uuml;nde &ccedil;al&#x131;&#x15F;mas&#x131;n&#x131; bekledi&#x11F;imiz
herhangi bir JavaScript kodu yazabiliriz. Yeni kal&#x131;p dosyam&#x131;zdaki kod
div i&ccedil;eri&#x11F;ini sonuca g&ouml;re update edecek.</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">$(&quot;products&quot;).update(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);<br>
</pre>

<p>Sayfay&#x131; tazeledi&#x11F;imizde ve formun g&ouml;nderme d&uuml;&#x11F;mesine t&#x131;klad&#x131;&#x11F;&#x131;m&#x131;zda
arama AJAX &ccedil;a&#x11F;r&#x131;s&#x131; ile yap&#x131;lacak ve URL de&#x11F;i&#x15F;meyecektir.</p>

<div class="imageWrapper">
  <img src="/system/photos/347/original/E205I05.png" alt="The search form working with AJAX." height="409" width="801">
</div>

<p>&#x130;&#x15F;te b&ouml;yle, Rails 3 ile unobtrusive JavaScript sadece :remote
parametresi kullanarak yap&#x131;l&#x131;yor. AJAX &ccedil;a&#x11F;r&#x131;s&#x131;na bir server bir
JavaScript ile d&ouml;n&uuml;&#x15F; yap&#x131;yor ve o da div i&ccedil;eri&#x11F;ini de&#x11F;i&#x15F;tiriyor.</p>

<h3>Frameworklar&#x131; De&#x11F;i&#x15F;tirmek</h3>

<p>Bu b&ouml;l&uuml;m&uuml; uygulamam&#x131;z&#x131;n kulland&#x131;&#x11F;&#x131; JavaScript Framework&#x27;u nas&#x131;l
de&#x11F;i&#x15F;tirce&#x11F;imizi g&ouml;stererek kapataca&#x11F;&#x131;z. Uygulamam&#x131;z &#x15F;u anda Prototype
kullan&#x131;yor, bu Rails&#x27;in par&ccedil;as&#x131; olarak geliyor , fakat JQuery kullanmak
istiyorsak ne olacak?</p>

<p>&#x130;lk&ouml;nce uygulama layout&#x27;da yer alan &#x15F;u sat&#x131;r&#x131; de&#x11F;i&#x15F;tirmeliyiz.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= javascript_include_tag :defaults %&gt;<br>
</pre>
<p>&#x15F;&ouml;yle de&#x11F;i&#x15F;tirin:</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= javascript_include_tag &quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot;, &quot;jquery.rails.js&quot; %&gt;<br></pre>

<p>Listedeki ilk dosya Google &uuml;zerinden JQuery&#x27;nin son versiyonu. Bu tek 
ba&#x15F;&#x131;na yeterli de&#x11F;il <code>rails.js</code>  dosyas&#x131;n&#x131;n JQuery e&#x15F;leni&#x11F;ini 
de y&uuml;klememiz gerekiyor, yoksa unobtrusive uygulamalar&#x131;m&#x131;z &ccedil;al&#x131;&#x15F;maz. Bu 
dosyan&#x131;n orjinalini&nbsp; <a href="http://github.com/rails/jquery-ujs">jquery-ujs project on Github</a>
adresinde bulabilirsiniz. Bu projede indirip projemizde kullanabilece&#x11F;imiz 
bir <code>rails.js</code> dosyas&#x131; vard&#x131;r. Bu dosyay&#x131; indirip uygulamam&#x131;z&#x131;n&nbsp; 
<code>/public/javascripts</code> klas&ouml;r&uuml;ne koyal&#x131;m ve ad&#x131;n&#x131; <code>jquery.rails.js</code> 
yapal&#x131;m ve bu dosya uygulamam&#x131;z&#x131;n Rails taraf&#x131;ndan kullan&#x131;lan unobtrusive 
JavaScript i&#x15F;lerini ger&ccedil;ekle&#x15F;tirir.</p>

<p>&#x15E;imdi daha &ouml;nce uygulamam&#x131;za bizim ekledi&#x11F;imiz Prototype&#x27;a g&ouml;re olan
JavaScript&#x27;imizi JQuery&#x27;ye uygun olacak &#x15F;ekilde de&#x11F;itirmek zorunday&#x131;z.
Daha &ouml;nce &uuml;retti&#x11F;imiz <code>index.js.erb</code>
dosyas&#x131;nda k&uuml;&ccedil;&uuml;k bir de&#x11F;i&#x15F;iklik yapaca&#x11F;&#x131;z. Div se&ccedil;icisi olarak <code>products</code>
yerine <code>#products</code> kullanarak ve Prototype&#x27;&#x131;n <code>update</code> 
metodu yerine JQuery e&#x15F;leni&#x11F;i olan <code>html</code> kullanarak.</p>

<p class="codeFilePath">/app/views/products/index.js.erb</p>
<pre class="javascript">$(&quot;#products&quot;).html(&quot;&lt;%= escape_javascript(render(@products))%&gt;&quot;);<br>
</pre>

<p>Uygulamam&#x131;z art&#x131;k kaputun alt&#x131;nda Prototype yerine JQuery kullan&#x131;yor.</p>

<h3>Esteti&#x11F;in Kaybolmas&#x131;</h3>

<p>E&#x11F;er bir kullan&#x131;c&#x131; JavaScript izin verilmeyen bir taray&#x131;c&#x131;
kullanarak uygulamam&#x131;z&#x131; a&ccedil;arsa biraz estetik kayb&#x131; olacakt&#x131;r. Buton
normal bir GET &ccedil;a&#x11F;r&#x131;s&#x131; yapacakt&#x131;r. &Uuml;r&uuml;n silme linki de &ccedil;al&#x131;&#x15F;mayacakt&#x131;r.
Bu genel bir problemdir, HTML linkleri sadece GET &ccedil;a&#x11F;r&#x131;lar&#x131; yapabilir,
bu y&uuml;zden Rails DELETE i&ccedil;in biraz JavaScript kullan&#x131;r. Bunun &ouml;n&uuml;ne
ge&ccedil;mek i&ccedil;in bir y&ouml;ntem <code>button_to</code>
kullanmakt&#x131;r ama &ccedil;irkin g&ouml;r&uuml;necektir, bu y&uuml;zden link olarak kalmal&#x131;. Tercih 
edilebilecek bir teknik olarak  <a href="http://railscasts.com/episodes/77-destroy-without-javascript">episode
77</a> &nbsp; de JavaScript izin verilmeyen taray&#x131;c&#x131;larda silme i&#x15F;lemi i&ccedil;in 
ba&#x15F;ka sayfa a&ccedil;an &ouml;rnek var.</p>
