<p><a href="http://github.com/tobi/delayed_job/tree/master">Delayed_job plugin</a>&#x662F;&#x4E00;&#x4E2A;&#x5065;&#x58EE;&#x7684;&#x7A33;&#x5B9A;&#x7684;&#x7528;&#x4E8E;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p> 

<p>&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x90AE;&#x4EF6;&#x7FA4;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x505A;&#x6F14;&#x793A;&#x3002;&#x5982;&#x4E0B;&#x56FE;,&#x70B9;&#x51FB;&#x27;deliver&#x27;&#x540E;,&#x5C06;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x90AE;&#x4EF6;.&#x4F8B;&#x5B50;&#x4E2D;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x5927;&#x6982;&#x9700;&#x8981;10&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x6267;&#x884C;,&#x5BF9;&#x4F7F;&#x7528;&#x8005;&#x6765;&#x8BF4;,&#x70B9;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x8981;&#x7B49;&#x5F85;10&#x591A;&#x79D2;&#x663E;&#x7136;&#x592A;&#x4E45;&#x4E86;.</p> 

<div class="imageWrapper">
  <img src="/system/photos/148/original/E171I01.png" width="814" height="365" alt="The index page of our mailings application."/>
</div>
 
<p>&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#x7684;&#x8BF7;&#x6C42;,&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x653E;&#x5230;&#x540E;&#x53F0;&#x6267;&#x884C;.&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F7F;&#x7528;Delayed_job&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p> 

<h3>&#x5B89;&#x88C5;</h3>

<p>&#x5B98;&#x65B9;&#x53D1;&#x5E03;&#x7684;Delayed_job&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;<a href="http://github.com/tobi/delayed_job/tree/master">tobi&rsquo;s Github pages</a> &#xFF0C;&#x8FD9;&#x4E0A;&#x9762;&#x6709;&#x8BB8;&#x591A;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x6700;&#x597D;&#x9009;&#x62E9;&#x7531;<a href="http://github.com/collectiveidea/delayed_job/tree/master">collectiveidea</a>&#x63D0;&#x4F9B;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x529F;&#x80FD;&#x66F4;&#x65B0;&#x4E5F;&#x66F4;&#x5B8C;&#x5584;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x811A;&#x672C;&#xFF0C;&#x7528;&#x4E8E;&#x521B;&#x5EFA;Delayed_job&#x9700;&#x8981;&#x7684;&#x8868;&#x3002;</p>

<p>&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x5B89;&#x88C5;Delayed_job</p>
<pre class="terminal">
script/plugin install git://github.com/collectiveidea/delayed_job.git  
</pre>
<p>&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x540E; &#x8FD0;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x811A;&#x672C;&#x521B;&#x5EFA;Migration(&#x53EA;&#x6709;collectiveidea&#x7684;&#x5206;&#x652F;&#x624D;&#x6709;&#x6B64;&#x529F;&#x80FD;)</p>
<pre class="terminal">
script/generate delayed_job  
  create  script/delayed_job  
  exists  db/migrate  
  create  db/migrate/20090720195941_create_delayed_jobs.rb  
</pre>
<p>&#x4E4B;&#x540E;</p> 
<pre class="terminal">
rake db:migrate
</pre>

<p>&#x521B;&#x5EFA;delayed job&#x7684;&#x6570;&#x636E;&#x8868;</p>

<p>&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x5C06;&#x542F;&#x52A8;&#x4EFB;&#x52A1;&#x8FDB;&#x7A0B;&#x3002;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x4EFB;&#x52A1;&#x8FDB;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x5E94;&#x7528;&#x4E3A;production&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x7684;script&#x547D;&#x4EE4;&#x6765;&#x542F;&#x52A8;&#x8FDB;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5C06;&#x76D1;&#x89C6;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x5F53;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x662F;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x7684;RAKE&#x547D;&#x4EE4;&#x6765;&#x5F00;&#x542F;&#x4EFB;&#x52A1;&#x3002;</p>

<pre class="terminal">
rake jobs:work  
</pre>

<p>&#x7531;&#x6B64;&#x547D;&#x4EE4;&#x5F00;&#x542F;&#x7684;&#x4EFB;&#x52A1;&#x5C06;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x76F4;&#x5230;&#x6211;&#x4EEC;ctrl+c&#x53D6;&#x6D88;&#x5B83;&#xFF0C;&#x4FBF;&#x4E8E;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x8C03;&#x8BD5;&#x3002;</p> 

<h3>&#x4F7F;&#x7528;delayed_job&#x6765;&#x5904;&#x7406;&#x90AE;&#x4EF6;&#x7FA4;&#x53D1;&#x7A0B;&#x5E8F;</h3>

<p>&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x597D;&#x4E86;delayed_job&#xFF0C;&#x8BE5;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x8BA9;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x5728;MailingController&#x4E2D;&#x7684;<code>deliver</code>&#x65B9;&#x6CD5;</p>

<p class="codeFilePath">/app/controllers/mailings_controller.rb</p>
<pre class="ruby">
def deliver    
  mailing = Mailing.find(params[:id])    
  mailing.deliver    
  flash[:notice] = &quot;Mailing delivered&quot;    
  redirect_to mailings_url    
end    
</pre>

<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x662F;Mailing&#x4E2D;&#x7684;<code>deliver</code>&#x65B9;&#x6CD5;&#x8D1F;&#x8D23;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B83;&#x5F71;&#x54CD;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>send_later</code>&#x628A;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x653E;&#x5230;&#x540E;&#x53F0;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;model&#x4E2D;&#x4EE5;</p> 

<pre class="ruby">
mailing.send_later(:deliver)    
</pre>

<p>&#x7684;&#x5F62;&#x5F0F;&#x8BF7;&#x6C42;&#x3002;&#x53C2;&#x6570;&#x5373;&#x662F;&#x8981;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x548C;ruby&#x7684;<code>send</code>&#x65B9;&#x6CD5;&#x5F88;&#x50CF;&#xFF0C;&#x4F46;<code>send_later</code>&#x65B9;&#x6CD5;&#x4F1A;&#x628A;&#x4EFB;&#x52A1;&#x79FB;&#x52A8;&#x5230;&#x540E;&#x53F0;&#x7684;&#x961F;&#x5217;&#x91CC;&#x6267;&#x884C;&#x3002;&#x73B0;&#x5728;&#x4FEE;&#x6539;deliver&#x65B9;&#x6CD5;&#x6765;&#x770B;&#x770B;<code>send_later</code>&#x662F;&#x600E;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4FEE;&#x6539;&#x4E86;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x3002;</p>

<p class="codeFilePath">/app/controllers/mailings_controller.rb</p>
<pre class="ruby">
def deliver    
   mailing = Mailing.find(params[:id])    
   mailing.send_later(:deliver)    
   flash[:notice] = &quot;Mailing is being delivered.&quot;    
   redirect_to mailings_url    
end    
</pre>

<p>&#x73B0;&#x5728;&#xFF0C;&#x70B9;&#x51FB;deliver&#x540E;&#x7ACB;&#x5373;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x54CD;&#x5E94;&#x4FE1;&#x606F;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/149/original/E171I02.png" width="808" height="405" alt="The deliver link now returns a response straightaway."/>
</div> 
 
<p>&#x7A0D;&#x5019;&#x51E0;&#x79D2;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7B2C;&#x4E8C;&#x5C01;&#x90AE;&#x4EF6;&#x4E5F;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x4E86;</p> 

<div class="imageWrapper">
  <img src="/system/photos/150/original/E171I03.png" width="808" height="405" alt="The second mailing is shown as delivered."/>
</div>
 
<p>&#x5728;&#x8FD0;&#x884C;&#x4E86;<code>rake jobs:work</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B; &#x53EF;&#x4EE5;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x770B;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x4EFB;&#x52A1;&#x4FE1;&#x606F;</p>

<pre class="terminal">
1 jobs processed at 0.0993 j/s, 0 failed ...  
</pre>

<h3>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;</h3>

<p><code>send_later</code>&#x65B9;&#x6CD5;&#x4F7F;&#x5F97;&#x4EFB;&#x52A1;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x53D8;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x505A;&#x66F4;&#x591A;&#x5C31;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E13;&#x7528;&#x4E8E;&#x540E;&#x53F0;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x7C7B;&#x3002;&#x5728;<code>/lib</code> &#x76EE;&#x5F55;&#x4E0B;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;ruby&#x6587;&#x4EF6;&quot;<code>mailing_job.rb</code>&quot;&#x4E0B;&#x9762;&#x662F;&#x76F8;&#x5173;&#x4EE3;&#x7801;</p>

<p class="codeFilePath">/lib/mailing_job.rb</p>
<pre class="ruby">
class MailingJob &lt; Struct.new(:mailing_id)    
   def perform    
     mailing = Mailing.find(mailing_id)    
     mailing.deliver    
   end    
end    
</pre>

<p>&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x65E0;&#x53C2;&#x7684;<code>perform</code>&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4EE5;<code>mailing_id</code>&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x6765;&#x4F20;&#x9012;&#x9700;&#x8981;&#x88AB;&#x53D1;&#x9001;&#x7684;&#x90AE;&#x4EF6;&#x7684;<code>mailing_id</code>&#x3002; 
&#x4E60;&#x60EF;&#x4E0A;&#x5728;&#x7528;delayed_job&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x8BA9;&#x7C7B;&#x7EE7;&#x627F;struct&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7C7B;&#x62E5;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x521D;&#x59CB;&#x5316;<code>MailingJob</code>&#x7684;&#x65F6;&#x5019;<code>mailing_id</code>&#x4F1A;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x6070;&#x597D;&#x63D0;&#x4F9B;&#x4E86;<code>mailing_id</code>&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6216;&#x662F;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x3002;</p> 

<p>&#x73B0;&#x5728;&#xFF0C;MailingController&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;</p>

<p class="codeFilePath">/app/controllers/mailings_controller.rb</p>
<pre class="ruby">    
def deliver    
  Delayed::Job.enqueue(MailingJob.new(params[:id]))    
  flash[:notice] = &quot;Mailing is being delivered.&quot;    
  redirect_to mailings_url    
end  
</pre>

<p>&#x65B9;&#x6CD5;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x5305;&#x63FD;&#x4E86;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#xFF1A;&#x4EE5;&#x60F3;&#x8981;&#x53D1;&#x9001;&#x7684;&#x90AE;&#x4EF6;&#x7684;<code>id</code>&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x521B;&#x5EFA;<code>MailingJob</code>&#x5B9E;&#x4F8B;&#x5BF9;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x52A0;&#x5165;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x3002;</p>

<p>&#x4F7F;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5728;&#x4F20;&#x9012;&#x9644;&#x52A0;&#x53C2;&#x6570;&#x7ED9;<code>Delayed::Job.enqueue</code>&#x7684;&#x65F6;&#x5019;&#x5229;&#x7528;&#x4E00;&#x4E9B;<code>delayed_job</code>&#x7684;&#x7279;&#x6027;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;0&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F20;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7684;&#x503C;&#x8FC7;&#x53BB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x5C06;&#x4F1A;&#x4F18;&#x5148;&#x4E8E;&#x90A3;&#x4E9B;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;</p>

<pre class="ruby">
Delayed::Job.enqueue(MailingJob.new(params[:id]), 3)    
</pre>

<p>&#x540C;&#x7406;&#xFF0C;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x66F4;&#x4F4E;&#x7684;&#x503C;&#x5C06;&#x4F7F;&#x5F97;&#x8BE5;&#x4EFB;&#x52A1;&#x5EF6;&#x540E;&#x4E8E;&#x9ED8;&#x8BA4;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;</p> 

<pre class="ruby"> 
Delayed::Job.enqueue(MailingJob.new(params[:id]), -3)    
</pre>

<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x8BBE;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x542F;&#x52A8;&#x65F6;&#x95F4;</p> 

<pre class="ruby">
Delayed::Job.enqueue(MailingJob.new(params[:id]), 3, 3.days.from_now)   
</pre>

<p>&#x8FD9;&#x6837;&#x8BBE;&#x7F6E;&#x540E;&#xFF0C;3&#x5929;&#x4E4B;&#x5185;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x5C06;&#x4E0D;&#x88AB;&#x89C6;&#x4E3A;&#x5728;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x3002;</p> 

<h3>&#x81EA;&#x52A8;&#x91CD;&#x8BD5;</h3>
<p>delayed_job&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x63D0;&#x53CA;&#x7684;&#x7279;&#x6027;&#x5C31;&#x662F;&#x81EA;&#x52A8;&#x91CD;&#x8BD5;&#x529F;&#x80FD;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x629B;&#x51FA;&#x4E86;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x4F1A;&#x88AB;&#x6355;&#x83B7;&#xFF0C;&#x4E4B;&#x540E;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6700;&#x591A;&#x91CD;&#x590D;25&#x6B21;&#xFF0C;&#x6B21;&#x6570;&#x8D8A;&#x591A;&#x91CD;&#x8BD5;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5C31;&#x8D8A;&#x957F;&#x3002;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x4E2D;&#x9014;&#x51FA;&#x9519;&#xFF0C;&#x5E94;&#x8BE5;&#x786E;&#x8BA4;&#x662F;&#x4ECE;&#x53D1;&#x9001;&#x5931;&#x8D25;&#x7684;&#x90A3;&#x5C01;&#x90AE;&#x4EF6;&#x5F00;&#x59CB;&#x91CD;&#x8BD5;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x3002;</p>

<p>&#x8FD9;&#x4E9B;&#x5C31;&#x662F;delayed_job&#x7684;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x76F8;&#x5F53;&#x5B8C;&#x6574;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x521B;&#x5EFA;&#x540E;&#x53F0;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x4E4B;&#x4E00;</p>