<p>Ya ha sido liberada la segunda versi&oacute;n beta de Rails 3.0 y uno de los cambios m&aacute;s significativos es la forma en la que se gestionan los bloques en las vistas.  En este episodio veremos qu&eacute; es l que ha cambiado.</p>

<h3>Actualizaci&oacute;n de Ruby y Rails</h3>

<p>Antes de actualizarnos a la nueva beta de Rails 3 vamos a actualizar primero nuestra versi&oacute;n de Ruby a 1.9.2  En el episodio 200 [<a href="http://railscasts.com/episodes/200-rails-3-beta-and-rvm">verlo</a>, <a href="http://es.asciicasts.com/episodes/200-rails-3-beta-y-rvm">leerlo</a>] vimos c&oacute;mo utilizar rvm para instalar Ruby 1.9.1 pero esta versi&oacute;n tiene algunos errores y la 1.9.2 parece m&aacute;s robusta (aun cuando sigue estando en desarrollo).</p>

<p>Con rvm tenemos que ejecutar este comando para instalar Ruby 1.9.2:</p>

<pre class="terminal">
rvm install ruby-head
</pre>

<p>Con esto se descargar&aacute; la &uacute;ltima versi&oacute;n de Ruby 1.9.2, que a&uacute;n est&aacute; en desarrollo.  Una vez que rvm haya instalado la nueva versi&oacute;n podemos cambiar a ella con</p>

<pre class="terminal">
rvm ruby-head --default
</pre>

<p>N&oacute;tese que hemos utilizado la opci&oacute;n <code>--default</code> para que 1.9.2 sea la versi&oacute;n por defecto de Ruby, lo que quiere decir que si abrimos otras ventanas de terminal tambi&eacute;n tendr&aacute;n como versi&oacute;n de Ruby la 1.9.2.</p>

<p>La beta 2 de Rails 3 requiere que tengamos RubyGems 1.3.6 as&iacute; que antes de instalarlo tendremos que hacer</p>

<pre class="terminal">
gem -v
</pre>

<p>para ver qu&eacute; versi&oacute;n tenemos instalado.  Si tenemos una anterior a la 1.3.6 podemos hacer</p>

<pre class="terminal">
gem update --system
</pre>

<p>Ya podemos instalar Rails 3.0 beta 2 con:</p>

<pre class="terminal">
gem install rails --pre
</pre>

<h3>Actualizando las aplicaciones</h3>

<p>Podemos actualizar cualquier aplicaci&oacute;n que hayamos desarrollado con la anterior beta de Rails simplemente cambiando el n&uacute;mero de versi&oacute;n que figura en el Gemfile de <code>3.0.0.beta</code> a <code>3.0.0.beta2</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &quot;rails&quot;, &quot;3.0.0.beta2&quot;
</pre>

<p>Tras esto podemos ejecutar <code>bundle install</code> para que se resuelvan todas las dependencias.</p>

<h3>Los cambios en erb</h3>

<p>Hay dos tipos de etiquetas que se usan en los ficheros erb.  Si el c&oacute;digo aparece entre etiquetas 
<code>&lt;%= %&gt;</code> en la vista aparecer&aacute; lo que devuelva la evaluaci&oacute;n del c&oacute;digo Ruby insertado entre ellas.  Si omitimos el signo de igualdad el c&oacute;digo se interpretar&aacute; pero su salida ser&aacute; descartada.   Se trata de un concepto muy com&uacute;n en erb que ha sido extendido en Rails 3 para que funcione dentro de bloques.</p>

<p>Esto aparece frecuentemente en los formularios.  Abajo figura una plantilla erb correspondiente al formulario de un modelo <code>Product</code>.</p>


<p class="codeFilePath">/app/views/products/_form.html.erb</p>
<pre class="ruby">
&lt;% form_for @product do |f| %&gt;
  &lt;%= f.error_messages %&gt;
  &lt;p&gt;
    &lt;%= f.label :category_id %&gt;&lt;br /&gt;
    &lt;%= f.collection_select :category_id, Category.all, :id, :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :name %&gt;&lt;br /&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :price %&gt;&lt;br /&gt;
    &lt;%= f.text_field :price %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :description %&gt;&lt;br /&gt;
    &lt;%= f.text_area :description %&gt;
  &lt;/p&gt;
  &lt;p&gt;&lt;%= f.submit &quot;Submit&quot; %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>En la primera l&iacute;nea de este c&oacute;digo hemos utilizado <code>form_for</code>, que insertar&aacute; etiquetas de formulario en la vista rodeando el contenido del bloque... pero en las etiqueta erb no aparece el signo igual, lo que viola la regla de que los bloques erb que devuelven marcado en la vista deber&iacute;an utilizar <code>&lt;%= %&gt;</code> y ha hecho que sea dif&iacute;cil trabajar dentro de <code>form_for</code> en versiones anteriores de Rails.  A partir de la nueva beta ya podemos utilizar signos de igual como con cualquier otro c&oacute;digo erb que genera texto en HTML.</p>

<p class="codeFilePath">/app/views/products/_form.html.erb</p>
<pre class="ruby">
&lt;%= form_for @product do |f| %&gt;
  &lt;!-- rest of form --&gt;
&lt;% end %&gt;
</pre>

<p>Estamos usando el s&iacute;mbolo de igualdad aunque le estemos pasando un bloque a <code>form_for</code> (si bien hay que tener en cuenta que la etiqueta de cierre <code>end</code> no lo lleva) Esto insertar&aacute; la etiqueta <code>form</code> y los contenidos del formulario correctamente, y sirve tambi&eacute;n para arreglar el interior de <code>form_for</code>, como veremos en breve.</p>

<p>Cabr&iacute;a preguntarse cu&aacute;ndo hace falta utilizar el s&iacute;mbolo de igualdad y cuando no.  Ech&eacute;mosle un vistazo a un par de ejemplos empezando por <a href="http://api.rubyonrails.org/classes/ActionView/Helpers/RecordTagHelper.html#M001643">div_for</a>:</p>

<pre class="ruby">
&lt;%= div_for @product do %&gt;

&lt;% end %&gt;
</pre>

<p>En versiones anteriores de Rails no hac&iacute;a falta usar el s&iacute;mbolo de igualdad pero ahora es necesario porque estamos devolviendo contenido alrededor del bloque (en este caso una etiqueta <code>div</code>).  De hecho la mayor&iacute;a de los <em>helpers</em> de Rails ahora exigen este s&iacute;mbolo porque siempre escriben algo rodeando el bloque que aceptan.</p>

<p>Sin embargo a&uacute;n quedan algunos casos en los que no es necesario este s&iacute;mbolo.  Por ejemplo cualquier cosa que utilice el m&eacute;todo <code>each</code>:</p>

<pre class="ruby">
&lt;% @comments.each do |c|%&gt;

&lt;% end %&gt;
</pre>

<p>El m&eacute;todo <code>each</code> no devuelve nada que queramos sacar en la vista, por tanto no se debe utilizar el s&iacute;mbolo de igualdad dado que lo que devuelve este m&eacute;todo no se visualiza.</p>

<p>Otro ejemplo es el m&eacute;todo <code>content_for</code>.</p>

<pre class="ruby">
&lt;% content_for :side do %&gt;

&lt;% end %&gt;
</pre>

<p>Aqu&iacute; tampoco se usa el s&iacute;mbolo de igualdad porque la llamada a <code>content_for</code> guarda el contenido del bloque en una variable que se utilizar&aacute; m&aacute;s tarde.  Nada se muestra en la vista, por tanto no hay que usar el s&iacute;mbolo de igualdad.</p>

<p>Por desgracia hay una excepci&oacute;n a esta regla: el m&eacute;todo <code>cache</code>.  Idealmente, <code>cache</code> deber&iacute;a utilizar un s&iacute;mbolo de igualdad porque podr&iacute;a devolver cierto contenido en la vista pero no lo hace debido a su funcionamiento interno.</p>

<pre class="ruby">
&lt;% cache do %&gt;

&lt;% end %&gt;
</pre>

<h3>Uso de bloques en m&eacute;todos <em>helper</em></h3>

<p>Estos cambios pueden parecer un poco confusos al principio pero una vez que nos acostumbremos cobrar&aacute;n m&aacute;s sentido.  El motivo principal de este cambio es que con &eacute;l se reorganiza el c&oacute;digo interno.  En el <a href="http://railscasts.com/episodes/40-blocks-in-view">episodio 40</a> ve&iacute;amos c&oacute;mo utilizar bloques en las vistas en las versiones anteriores de Rails.  Era necesario utilizar el m&eacute;todo <code>concat</code> para poder poner texto por delante o por detr&aacute;s del bloque, lo que hac&iacute;a un poco d&iacute;ficil el trabajo.</p>

<pre class="ruby">
def admin_area(&amp;block)
  concat(&#x27;&lt;div class=&quot;admin&quot;&gt;&#x27;, block.binding)
  block.call
  concat(&quot;&lt;/div&gt;&quot;, block.binding)
end
</pre>

<p>Vamos a ver, como demostraci&oacute;n de que como es mucho m&aacute;s f&aacute;cil utilizar ahora bloques en los m&eacute;todos, una sencilla aplicaci&oacute;n de tienda que debe mostrar un n&uacute;mero de enlaces pero que s&oacute;lo ser&aacute;n visibles a los administradores.</p>

<div class="imageWrapper">
  <img src="/system/photos/358/original/E208I01.png" width="800" height="339" alt="La ficha de un producto mostrando los enlaces del administrador."/>
</div>

<p>Queremos que los enlaces &ldquo;Edit&rdquo;, &ldquo;Destroy&rdquo; y &ldquo;View All&rdquo; s&oacute;lo sean visibles por el administrador y tambi&eacute;n queremos rodear los enlaces de una etiqueta <code>div</code>.  Los enlaces se crear&aacute;n en la vista con el siguiente c&oacute;digo:</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;p&gt;
  &lt;%= link_to &quot;Edit&quot;, edit_product_path(@product) %&gt; | 
  &lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt; | 
  &lt;%= link_to &quot;View All&quot;, products_path %&gt;
&lt;/p&gt;
</pre>

<p>Vamos a reemplazar las etiquetas del p&aacute;rrafo con un nuevo m&eacute;todo <em>helper</em> que llamaremos <code>admin_area</code>:</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;%= admin_area do %&gt;
  &lt;%= link_to &quot;Edit&quot;, edit_product_path(@product) %&gt; | 
  &lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt; | 
  &lt;%= link_to &quot;View All&quot;, products_path %&gt;
&lt;% end %&gt;
</pre>

<p>Este m&eacute;todo <code>admin_area</code> a&ntilde;adir&aacute; la etiqueta <code>div</code> y mostrar&aacute; u ocultar&aacute; los enlaces seg&uacute;n el usuario registrado sea o no administrador.  Obs&eacute;rvese que debido a que nuestro m&eacute;todo env&iacute;a salida a la vista hemos utilizado un s&iacute;mbolo de igualdad en la etiqueta de apertura.</p>

<p>Vamos a definir el m&eacute;todo en <code>application_helper</code>  Lo mejor de esta nueva forma de trabajar con bloques en los <em>helpers</em> es que se comporta exactamente como ser&iacute;a de esperar, de forma que si el m&eacute;todo s&oacute;lo devuelve una cadena, eso es lo que se mostrar&aacute; en la vista.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def admin_area(&amp;block)
    &quot;OH HAI!&quot;
  end
end
</pre>

<p>Si ahora recargamos la p&aacute;gina el contenido del bloque ser&aacute; reemplazado por la cadena devuelta por el m&eacute;todo <code>admin_area</code>.  Los enlaces no se muestran dado que no estamos ejecutando el bloque en el m&eacute;todo.</p>

<div class="imageWrapper">
  <img src="/system/photos/359/original/E208I02.png" width="800" height="339" alt="The contents of the block are replaced by the string."/>
</div>

<p>Para ejecutar el bloque y devolver el contenido tenemos que llamar a un nuevo m&eacute;todo
denominado <code>with_output_buffer</code> y pasarle el bloque. Esto har&aacute; que se eval&uacute;e el bloque
en un <em>buffer</em> distinto de salida de forma que el contenido no se muestre directamente
en la vista.  Podemos asignar dicha salida a una variable y luego hacer lo que queramos con ella.  
En este caso queremos rodear el contenido de un <code>div</code> con una <code>class</code> llamada
<code>admin</code> por lo que vamos a modificar nuestro m&eacute;todo <code>admin_area</code> as&Iacute;:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content = with_output_buffer(&amp;block)
  content_tag(:div, content, :class =&gt; &#x27;admin&#x27;)
end
</pre>

<p>Cuando recarguemos la p&aacute;gina veremos los enlaces de administraci&oacute;n rodeados de un <code>div</code>. 
Como y ahemos creado un estilo para la clase <code>admin</code> en la hoja de estilos de la 
aplicaci&oacute;n, dichos estilos se aplicar&aacute;n sobre esta capa.</p>


<div class="imageWrapper">
  <img src="/system/photos/360/original/E208I03.png" width="800" height="339" alt="El bloque queda rodeado de una elemento div."/>
</div>

<p>Examinando el c&oacute;digo fuente de la p&aacute;gina veremos el <code>div</code> rodeando los enlaces.</p>

<pre class="html">
&lt;div class=&quot;admin&quot;&gt;
  &lt;a href=&quot;/products/1/edit&quot;&gt;Edit&lt;/a&gt; | 
  &lt;a href=&quot;/products/1&quot; data-confirm=&quot;Are you sure?&quot; data-method=&quot;delete&quot; rel=&quot;nofollow&quot;&gt;Destroy&lt;/a&gt; | 
  &lt;a href=&quot;/products&quot;&gt;View All&lt;/a&gt;
&lt;/div&gt;
</pre>

<p>Por tanto podemos usar el m&eacute;todo <code>with_output_buffer</code> para obtener el contenido evaluado de un bloque en una vista.  Dicho esto, el c&oacute;digo que hemos escrito en nuestro <em>helper</em> no era m&aacute;s que un ejemplo sencillo y de hecho existe una forma m&aacute;s eficiente de hacer lo mismo.</p>

<p>El m&eacute;todo <code>content_tag</code> puede recibir un bloque como argumento, lo que significa que podemos reescribir nuestro <em>helper</em> as&iacute;:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content_tag(:div, :class =&gt; &#x27;admin&#x27;, &amp;block)
end
</pre>

<p>Por supuesto para que este m&eacute;todo sea totalmente funcional querremos mostrar la salida s&oacute;lo si el usuario es administrador, lo que podemos conseguir utilizando un m&eacute;todo que devuelva un valor booleano.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content_tag(:div, :class =&gt; &#x27;admin&#x27;, &amp;block) if admin?
end
</pre>

<p>Eso es todo por este episodio.  Es posible que tardemos un poco en acostumbrarnos a utilizar signos de igualdad con bloques en nuestras vistas, pero a largo plazo veremos que tiene m&aacute;s sentido, porque estos bloques devuelven contenido.  Y adem&aacute;s esto redunda en una mejora de la implementaci&oacute;n del c&oacute;digo de las vistas en Rails.</p>

<p>Por &uacute;ltimo, un truco final.  En versiones anteriores de Rails pod&iacute;amos a&ntilde;adir un s&iacute;mbolo de sustracci&oacute;n al principio o final de una etiqueta erb para eliminar los espacios en blanco, para que el marcado quedase un poco m&aacute;s limpio.  En Rails 3 esto ya no es necesario y si una etiqueta erb no devuelve salida ser&aacute; autom&aacute;ticamente eliminada, por lo que dicha etiqueta no generar&aacute; espacios en blanco innecesarios.</p>