<p>La seconda versione beta di Rails 3.0 &egrave; stata appena rilasciata. Una delle modifiche pi&ugrave; significative di questa release &egrave; il modo in cui i blocchi vengono gestiti a livello di viste. In questo episodio daremo uno sguardo a cosa &egrave; cambiato.</p>

<h3>Aggiornare Ruby e Rails</h3>

<p>Prima di aggiornarci alla nuova versione beta di Rails , aggiorniamo la nostra versione di Ruby alla 1.9.2. Nell&rsquo;episodio 200 [<a href="http://railscasts.com/episodes/200-rails-3-beta-and-rvm">guardalo</a>, <a href="http://it.asciicasts.com/episodes/200-rails-3-beta-e-rvm">leggilo</a>] abbiamo usato rvm per installare Ruby 1.9.1, ma Ruby 1.9.1 &egrave; un po&rsquo; bacato, mentre la versione 1.9.2 sembra pi&ugrave; solida, bench&egrave; sia ancora in fase di sviluppo.</p>

<p>Per installare Ruby 1.9.2 con rvm, dobbiamo lanciare questo comando:</p>

<pre class="terminal">
rvm install ruby-head
</pre>

<p>Dal momento che Ruby 1.9.2 non &egrave; ancora uscito (nel momento in cui scriviamo), prendiamo l&rsquo;ultima versione di head. Cos&igrave; facendo, lavoriamo con la versione di sviluppo di Ruby, ma Ruby 1.9.2 &egrave; prossimo al rilascio, per cui siamo abbastanza tranquilli sul fatto di usare una versione comunque piuttosto stabile. Una volta che rvm ha installato la nuova versione,  possiamo passare a quella:</p>

<pre class="terminal">
rvm ruby-head --default
</pre>

<p>Si noti che &egrave; stata usata l&rsquo;opzione <code>--default</code> per rendere la versione 1.9.2 quella di default. Questo significa che ogni nuovo terminale che apriremo user&agrave; Ruby 1.9.2 come interprete Ruby.</p>

<p>Rails 3.0 beta 2 ha bisogno di RubyGems in versione 1.3.6, per cui, prima di installarlo, lanciamo un:</p>
<pre class="terminal">
gem -v
</pre>

<p>per vedere quale versione stiamo usando al momento. Se abbiamo una versione antecedente alla 1.3.6, possiamo lanciare:</p>
<pre class="terminal">
gem update --system
</pre>
<p>per aggiornarla. Ora possiamo installare Rails 3.0 beta 2 con:</p>

<pre class="terminal">
gem install rails --pre
</pre>

<h3>Aggiornare le applicazioni</h3>

<p>Tutte le applicazioni sviluppate con la prima versione beta di Rails 3.0 possono essere aggiornate semplicemente cambiando il numero di versione all&rsquo;interno del Gemfile di applicazione da <code>3.0.0.beta</code> a <code>3.0.0.beta2</code>:</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &quot;rails&quot;, &quot;3.0.0.beta2&quot;
</pre>

<p>Poi possiamo lanciare <code>bundle install</code> per assicurarci che tutte le dipendenze siano risolte.</p>

<h3>Cos&rsquo;&egrave; cambiato in erb</h3>

<p>Ora che abbiamo installato Rails 3.0 beta 2, cominciamo a guardare cosa &egrave; cambiato. Ci sono due tipi di tag usati nei file erb. Se il codice &egrave; racchiuso in tag <code>&lt;%= %&gt;</code>, allora qualsiasi cosa sia restituita da tale codice Ruby viene messo in output nella vista. Se si omette il segno uguale, allora il codice &egrave; interpretato, ma l&rsquo;output viene scartato. Questo &egrave; un concetto comune in erb e in Rails 3 &egrave; stato esteso per funzionare in questo modo all&rsquo;interno di blocchi.</p>

<p>L&rsquo;esempio pi&ugrave; comune dove ritroviamo un simile comportamento &egrave; enlle form. Sotto &egrave; riportato un template erb per una form per un modello di tipo <code>Product</code>:</p>

<p class="codeFilePath">/app/views/products/_form.html.erb</p>
<pre class="ruby">
&lt;% form_for @product do |f| %&gt;
  &lt;%= f.error_messages %&gt;
  &lt;p&gt;
    &lt;%= f.label :category_id %&gt;&lt;br /&gt;
    &lt;%= f.collection_select :category_id, Category.all, :id, :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :name %&gt;&lt;br /&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :price %&gt;&lt;br /&gt;
    &lt;%= f.text_field :price %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :description %&gt;&lt;br /&gt;
    &lt;%= f.text_area :description %&gt;
  &lt;/p&gt;
  &lt;p&gt;&lt;%= f.submit &quot;Submit&quot; %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>Nella prima linea di questo codice si usa il <code>form_for</code>. Questo comando inserisce i tag form nella vista attorno al contenuto presente le blocco, ma non c&rsquo;&egrave; alcun segno uguale nel tag erb. Questo stile infrange la regola secondo cui i blocchi erb che emettono dell&rsquo;output nella vista debbano usare il tag <code>&lt;%= %&gt;</code> ed ha reso difficile lavorare con le parti interne a <code>form_for</code> nelle precedenti versioni di Rails. Dalla nuova versione beta in avanti, comunque, useremo un segno uguale qui, come faremmo in qualunque altro codice erb che genera output:</p>

<p class="codeFilePath">/app/views/products/_form.html.erb</p>
<pre class="ruby">
&lt;%= form_for @product do |f| %&gt;
  &lt;!-- rest of form --&gt;
&lt;% end %&gt;
</pre>

<p>Anche se stiamo passando un blocco, usiamo ora il tag con l&rsquo;uguale con il <code>form_for</code>, anche se il tag di chiusura  <code>end</code> rimane come prima (senza). Questo codice inserir&agrave; il tag <code>form</code> ed il contenuto correttamente. Questa sintassi pulir&agrave; anche un po&rsquo; il codice all&rsquo;interno del blocco, come vi mostreremo fra poco.</p>

<p>Potreste domandarvi quando sia necessario usare il segno uguale e quando no. Guardiamo un paio di esempi. Per primo, il <a href="http://api.rubyonrails.org/classes/ActionView/Helpers/RecordTagHelper.html#M001643">div_for</a>:</p>

<pre class="ruby">
&lt;%= div_for @product do %&gt;

&lt;% end %&gt;
</pre>

<p>Nelle prime versioni di Rails non avremmo usato il segno = in questo caso, ma ora &egrave; richiesto, in quanto stiamo producendo del contenuto introno al blocco, in questo caso un tag <code>div</code>. Praticamente, la maggior parte degli helpers di Rails ora necessita del segno uguale, perch&egrave; producono un qualcosa attorno al blocco che accettano.</p>

<p>Ci sono ancora casi in cui non va messo il segno uguale, comunque. Un esempio &egrave; il caso di tutto ci&ograve; che usa il metodo <code>each</code>:</p>

<pre class="ruby">
&lt;% @comments.each do |c|%&gt;

&lt;% end %&gt;
</pre>

<p>Il metodo <code>each</code> non produce nulla, di per s&egrave;, che si deve mostrare nella vista, per cui questo non necessiter&agrave;, come di fatto era gi&agrave; nelle precedenti versioni, del segno di uguale nel tag erb.</p>

<p>Un altro esempio &egrave; il metodo <code>content_for</code>:</p>
<pre class="ruby">
&lt;% content_for :side do %&gt;

&lt;% end %&gt;
</pre>

<p>Anche in questo caso il segno uguale non si usa, perch&egrave; la chiamata <code>content_for</code> salva il contenuto del blocco in una variabile da usare in un secondo tempo, nel layout. Nulla &egrave; prodotto nella vista da questo metodo di per s&egrave;, per cui il segno uguale non ci vuole.</p>

<p>Sfortunatamente c&rsquo;&egrave; un&rsquo;eccezione a questa regola: il metodo <code>cache</code>. Teoricamente <code>cache</code> dovrebbe richiedere il segno uguale dal momento che potrebbe restituire del contenuto alla vista, proveniente dalla cache, ma a causa di come funziona internamente, non va usato:</p> 

<pre class="ruby">
&lt;% cache do %&gt;

&lt;% end %&gt;
</pre>

<h3>Utilizzo dei blocchi nei metodi helper</h3>

<p>In un primo momento tutto ci&ograve; pu&ograve; sembrare molto complicato, ma una volta che ci si &egrave; abituati al concetto di fondo, fare le modifiche assume un senso ben chiaro. La ragione principale di queste modifiche &egrave; che ripuliscono le parti interne del codice. L&rsquo;<a href="http://railscasts.com/episodes/40-blocks-in-view">episodio 40</a> ci ha mostrato come usare i blocchi nelle viste nelle prime versioni di Rails. Era poi necessario usare il metodo <code>concat</code> per mettere del testo prima o dopo il blocco con cui era un po&rsquo; difficile lavorare:</p>

<pre class="ruby">
def admin_area(&amp;block)
  concat(&#x27;&lt;div class=&quot;admin&quot;&gt;&#x27;, block.binding)
  block.call
  concat(&quot;&lt;/div&gt;&quot;, block.binding)
end
</pre>

<p>Per farvi vedere come sia pi&ugrave; semplice usare i blocchi coi metodi helper, ora useremo una semplice applicazione store che ha una serie di collegamenti che dovrebbero essere visibili solo agli amministratori di sistema:</p>

<div class="imageWrapper">
  <img src="/system/photos/358/original/E208I01.png" width="800" height="339" alt="La pagina di dettaglio per un prodotto che mostra i link amministrativi."/>
</div>

<p>Vogliamo che i link &ldquo;Edit&rdquo;, &ldquo;Destroy&rdquo; e &ldquo;View All&rdquo; siano visibili solo agli amministratori e vogliamo anche racchiudere i collegamenti in un <code>div</code>. I link vengono creati nella vista dal seguente codice:</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;p&gt;
  &lt;%= link_to &quot;Edit&quot;, edit_product_path(@product) %&gt; | 
  &lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt; | 
  &lt;%= link_to &quot;View All&quot;, products_path %&gt;
&lt;/p&gt;
</pre>

<p>Cambiamo il tag di paragrafo in cui sono racchiusi i link con un nuovo metodo helper chiamato <code>admin_area</code> tipo questo:</p>

<p class="codeFilePath">/app/views/products/show.html.erb</p>
<pre class="ruby">
&lt;%= admin_area do %&gt;
  &lt;%= link_to &quot;Edit&quot;, edit_product_path(@product) %&gt; | 
  &lt;%= link_to &quot;Destroy&quot;, @product, :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt; | 
  &lt;%= link_to &quot;View All&quot;, products_path %&gt;
&lt;% end %&gt;
</pre>

<p>Il metodo <code>admin_area</code> aggiunger&agrave; il tag <code>div</code> e mostrer&agrave; o nasconder&agrave; i link a seconda del ruolo dell&rsquo;utente correntemente autenticato. Si noti che dal momento che il nostro metodo helper genera codice HTML sulla vista, abbiamo usato il segno uguale nel suo tag di apertura.</p>

<p>Definiamo il metodo all&rsquo;interno dell&rsquo;helper di applicazione. Ci&ograve; che &egrave; bello di questo nuovo modo di lavorare coi blocchi nei metodi helper &egrave; che il tutto si comporta esattamente come ci si aspetterebbe per cui se il metodo restituisce semplicemente una stringa, quella stringa verr&agrave; messa cos&igrave; com&rsquo;&egrave; nella vista:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def admin_area(&amp;block)
    &quot;OH HAI!&quot;
  end
end
</pre>

<p>Se ricarichiamo la pagina ora, il contenuto del blocco sar&agrave; sostituito dalla stringa che ha restituito il metodo <code>admin_area</code>. I link non vengono mostrati siccome non stiamo eseguendo il blocco da nessuna parte nel metodo:</p>

<div class="imageWrapper">
  <img src="/system/photos/359/original/E208I02.png" width="800" height="339" alt="Il contenuto del blocco &egrave; sostituito dalla stringa."/>
</div>

<p>Per eseguire il blocco e restituire il contenuto, dobbiamo chiamare un nuovo metodo chiamato <code>with_output_buffer</code> e passargli il blocco. Questo chiamer&agrave; il blocco in un buffer di output separato in modo che il contenuto non sia renderizzato direttamente nella vista. Possiamo assegnare l&rsquo;output ad una variabile e poi farne ci&ograve; che vogliamo. Noi vogliamo racchiudere il contenuto in un elemento <code>div</code> con <code>class</code> di <code>admin</code>, per cui cambieremo il nostro metodo <code>admin_area</code> nel modo seguente:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content = with_output_buffer(&amp;block)
  content_tag(:div, content, :class =&gt; &#x27;admin&#x27;)
end
</pre>

<p>Quando ora ricarichiamo la pagina vediamo i link di amministrazione racchiusi in un div. Poich&egrave; abbiamo gi&agrave; creato uno stile per la classe admin nel foglio di stile dell&rsquo;applicazione, il div avr&agrave; quello stile applicato.</p>

<div class="imageWrapper">
  <img src="/system/photos/360/original/E208I03.png" width="800" height="339" alt="Il blocco &egrave; ora contenuto in un div."/>
</div>

<p>Guardando al sorgente HTML, possiamo vedere il div intorno ai link.</p>

<pre class="html">
&lt;div class=&quot;admin&quot;&gt;
  &lt;a href=&quot;/products/1/edit&quot;&gt;Edit&lt;/a&gt; | 
  &lt;a href=&quot;/products/1&quot; data-confirm=&quot;Are you sure?&quot; data-method=&quot;delete&quot; rel=&quot;nofollow&quot;&gt;Destroy&lt;/a&gt; | 
  &lt;a href=&quot;/products&quot;&gt;View All&lt;/a&gt;
&lt;/div&gt;
</pre>

<p>Per cui, se mai avessimo bisogno di caricare i contenuti di un blocco in una vista, potremmo usare il metodo <code>with_output_buffer</code> e passargli il blocco e quello restituirebbe il contenuto del blocco. Detto ci&ograve;, il codice che abbiamo scritto nel nostro metodo helper era principalmente dimostrativo ed esiste un modo pi&ugrave;efficiente per fare la stessa cosa.</p> 

<p>Il metodo <code>content_tag</code> pu&ograve; ricevere un blocco come argomento e quello gestir&agrave; il buffer di output cambiando automaticamente. Questo significa che il nostro metodo helper pu&ograve; essere riscritto cos&igrave;:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content_tag(:div, :class =&gt; &#x27;admin&#x27;, &amp;block)
end
</pre>

<p>Naturalmente, per far s&igrave; che il metodo helper funzioni appieno, vorremmo che il tag fosse prodotto sulla vista solo se l&rsquo;utente &egrave; un amministratore, e lo possiamo fare usando un metodo che restituisce un valore booleano a seconda del fatto che l&rsquo;utente corrente sia amministratore:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
def admin_area(&amp;block)
  content_tag(:div, :class =&gt; &#x27;admin&#x27;, &amp;block) if admin?
end
</pre>

<p>Tutto quello che &egrave; stato mostrato &egrave; pi&ugrave; che sufficiente per questo episodio. Usando il segno uguale con i blocchi nelle viste pu&ograve; inizialmente essere difficile da digerire, ma alla lunga si rivela pi&ugrave; sensato, poich&egrave; questi blocchi generano dei contenuti. Con una pi&ugrave; pulita implementazione dietro le quinte, poi, tutto ci&ograve; rappresenta un moglioramento del codice delle viste di Rails.</p>

<p>Come bonus, eccovi un suggerimento extra. Nelle prime versioni di Rails si poteva metter un segno meno all&rsquo;inizio o alla fine di un tag erb per aiutare a togliere gli spazi in modo che il markup risultasse un po&rsquo; pi&ugrave; pulito. In Rails 3 questo non &egrave; pi&ugrave; necessario. Se un tag erb non genera output, viene comunque automaticamente tolto, per cui non ci sono spazi non necessari al posto del contenuto del tag erb.</p>
