<p>Como desarrolladores, el escribir <em>copys</em> no es siempre plato de buen gusto.  N&oacute;tese por ejemplo el texto en la parte superior de la p&aacute;gina que sigue a continuaci&oacute;n.  &iquest;Deber&iacute;a decir &laquo;Explore nuestro cat&aacute;logo&raquo;, &laquo;Listado de productos&raquo; o quiz&aacute; &laquo;Productos&raquo;?</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1094/original/E336I01.png" width="800" height="381" alt="La página principal de nuestra aplicación."/>
</div>

<p>Un cliente nos puede pedir que cambiemos los textos de este titular, o quiz&aacute; la descripci&oacute;n que aparece debajo, y no se trata de un texto f&aacute;cil de cambiar.  Se encuentra escrito a fuego en la plantilla de la vista, y cualquiera que lo desee cambiar precisar&aacute; tener acceso al c&oacute;digo fuente para poder editar esta plantilla y desplegar la aplicaci&oacute;n, tan s&oacute;lo para cambiar este texto.  Ser&iacute;a mucho m&aacute;s f&aacute;cil si existiese una interfaz sencilla de administraci&oacute;n a donde se pueda dirigir al cliente para que edite este tipo de textos.  <a href="https://copycopter.com/">Copycopter</a> hace precisamente esto, proporcionando una interfaz donde los usuarios pueden editar los textos que muestra una aplicaci&oacute;n Rails.  Copycoter tambi&eacute;n trae una gema Ruby que hace que sea muy sencillo integrarlo en nuestras aplicaci&oacute;n.  Se trataba de un servicio de pago pero Thoughtbot ha publicado el c&oacute;digo con licencia abierta por lo que su uso es gratuito y en este episodio lo utilizaremos para poder editar el titular y la descripci&oacute;n.</p>

<h3>Instalaci&oacute;n de un servidor de Copycopter</h3>

<p>Primero tendremos que configurar el <a href="https://github.com/copycopter/copycopter-server">servidor de Copycopter</a>, que consiste en una aplicaci&oacute;n Rails completa que proporciona la interfaz para editar los textos.  No se trata de un <em>engine</em> que podamos montar sobre nuestra aplicaci&oacute;n.   <a href="http://www.heroku.com/">Heroku</a> es un buen sitio para instalarlo, y Copycopter tan s&oacute;lo necesita un dyno por lo que podremos alojarlo sin coste por el momento.  Darse de alta es gratuito, tras hacerlo tenemos que instalar las <a href="https://toolbelt.heroku.com/">herramientas de Heroku </a> que incluyen una interfaz de l&iacute;nea de &oacute;rdenes para gestionar nuestras aplicaciones.  Tras descargar e instalar el paquete, tendremos acceso a una nueva orden, <code>heroku</code>, en cualquier ventana de terminal que abramos.  A continuaci&oacute;n usaremos esta orden para identificarnos con nuestra cuenta de Heroku.</p>

``` terminal
$ heroku login
Enter your Heroku credentials.
Email: eifion@asciicasts.com
Password: 
Authentication successful.
```

<p>Con esto ya podemos desplegar Copycopter Server en Heroku.  La documentaci&oacute;n en Github incluye algunas instrucciones para hacerlo, as&iacute; que las seguiremos.  Primero tenemos que clonar el proyecto en nuestra m&aacute;quina local.</p>


``` terminal
$ git clone git://github.com/copycopter/copycopter-server.git
```

<p>Luego tendremos que mover la aplicaci&oacute;n a su directorio y empezaremos con el despliegue en Heroku.  Primero crearemos una nueva aplicaci&oacute;n de Heroku.</p>

``` terminal
$ cd copycopter-server/
$ heroku create --stack cedar
```

<p>Seg&uacute;n la configuraci&oacute;n que tengamos puede ser que veamos un error al lanzar esta orden.  Podemos corregirlo ejecutando <code>bundle install</code>.  Lo mejor es lanzar esta orden sin el entorno de tests para reducir el n&uacute;mero de dependencias que hay que instalar.</p>

``` terminal
$ bundle install --without=test
```

<p>Tras hacer esto deber&iacute;amos poder ejecutar <code>heroku create</code> sin errores.  Los despliegues en Heroku se hacen mediante Git y ya podemos desplegar nuestra aplicaci&oacute;n s&oacute;lo usando <code>git push</code>.</p>

``` terminal
$ git push heroku master
```

<p>Podemos lanzar las migraciones de base de datos en el servidor con la siguiente orden:</p>

``` terminal
$ heroku run rake db:migrate
```

<p>Cuando esto haya terminado tenemos que ejecutar <code>heroku restart</code>.  Ya podemos crear un proyecto dentro de nuestra instalaci&oacute;n de Copycopter con la siguiente orden (obviamente habr&aacute; que cambiar los valores de <code>NAME</code>, <code>USERNAME</code>, y <code>PASSWORD</code>).</p>


``` terminal
$ heroku run rake copycopter:project NAME=Store USERNAME=eifion PASSWORD=secret
```

<p>Con esto podemos ya ver el sitio que acabamos de crear ejecutando <code>heroku open</code> que abrir&aacute; la aplicaci&oacute;n de Heroku en el navegador.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1095/original/E336I02.png" width="800" height="610" alt="Nuestro servidor de Copycopter."/>
</div>

<p>Si hacemos clic en el enlace &ldquo;Store&rdquo; se nos preguntar&aacute; por el nombre y la clave que utilizamos cuando creamos el proyecto en Copycopter.  Tras introducir estas credenciales iremos a la p&aacute;gina del proyecto donde se nos indicar&aacute; que no tenemos una aplicaci&oacute;n Rails para este proyecto.  La p&aacute;gina incuye instrucciones para hacerlo: tenemos que a&ntilde;adir una gema a la aplicaci&oacute;n y configurar un inicializador para cargar el cliente de Copycopter.</p>

<h3>Configuraci&oacute;n de la aplicaci&oacute;n Rails para que use Copycopter</h3>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1096/original/E336I03.png" width="800" height="374" alt="Instrucciones para añadir Copycopter a la aplicación."/>
</div>

<p>Con estas instrucciones vamos a a&ntilde;adir Copycopter a nuestra aplicaci&oacute;n de tienda.  Primero a&ntilde;adiremos la gema al <code>Gemfile</code> y luego ejecutaremos <code>bundle</code> para instalarla.</p>


``` /Gemfile
gem 'copycopter_client', '2.0.0'
```
<p>A continuaci&oacute;n crearemos el inicializador, que contiene el c&oacute;digo de configuraci&oacute;n que enganchar&aacute; nuestra aplicaci&oacute;n al servidor de Copycopter que acabamos de desplegar.</p>

``` /config/initializers/copycopter.rb
CopycopterClient.configure do |config|
  config.api_key = 'f5a22cf0acffc7010db99951be3c5d0d'
  config.host = 'sharp-window-4901.herokuapp.com'
end
```

<p>Ya podemos hacer que el titular y la descripci&oacute;n de la portada de nuestra web sean editables mediante Copycopter.  Para esto tenemos que ir a la plantilla de la p&aacute;gina y cambiar los fragmentos de texto por una llamada al m&eacute;todo <code>t</code> pas&aacute;ndole una clave identificativa &uacute;nica, as&iacute; como un valor por defecto en caso de que no est&eacute; definido en Copycopter.</p>


``` /app/views/products/index.html.erb
<h1><%= t "products.headline", default: "Browse Products" %></h1>

<em><%= t ".tagline", default: "We have what you need at a great low price." %></em>
```

<p>El m&eacute;todo <code>t</code> es el m&eacute;todo de internacionalizaci&oacute;n incluido en Rails lo que quiere decir que podemos utilizar Copycopter para internacionalizar un sitio.  N&oacute;tese que para la segunda l&iacute;nea el identificador empieza con un punto, lo que hace que sea una clave relativa: la clave ser&aacute; precedida por la ruta de la plantilla.</p>

<p>Tendremos que reiniciar nuestro servidor de aplicaci&oacute;n para cargar Copycopter, cuando lo hagamos la p&aacute;gina deber&iacute;a tener exactamente el mismo aspecto que antes porque cada llamada a <code>t</code> incluye como valor por defecto el texto que hab&iacute;a antes.  Sin embargo, cuando visitemos nuestro servidor de Copycopter, veremos una caja de b&uacute;squeda que nos permite buscar claves, y si buscamos la clave  &ldquo;headline&rdquo; veremos que ya aparece la clave <code>products.headline</code>.  Si hacemos clic en ella iremos a una p&aacute;gina donde podemos editar el texto correspondiente.  En concreto, cambiaremos la frase  &ldquo;Browse Products&rdquo; por &ldquo;Browse Our Products&rdquo;</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1097/original/E336I04.png" width="800" height="602" alt="Editando el texto con Copycopter."/>
</div>

<p>Tenemos la posibilidad de hacer que los cambios queden en modo borrador o bien publicarlo al entorno de producci&oacute;n.  Lo dejaremos como borrador y guardaremos nuestros cambios.  Al recargar la aplicaci&oacute;n veremos que el texto ha cambiado.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1098/original/E336I05.png" width="800" height="280" alt="El texto de la aplicación se ve modificado."/>
</div>

<p>Podemos cambiar la entradilla de la misma manera, en este caso tendr&aacute; la clave  <code>products.index.tagline</code> porque este texto fue configurado con una clave relativa en nuestra aplicaci&oacute;n.  Podemos a&ntilde;adir estilos en el texto editable y tambi&eacute;n podemos establecer el texto para los diferentes idiomas si queremos traducir el texto de nuestra p&aacute;gina a otras lenguas.</p>

<p>Tambi&eacute;n merece la pena mencionar que con un &uacute;nico servidor de Copycopter podemos gestionar varios proyectos por lo que si tenemos otro sitio que queramos incluir basta con a&ntilde;adir <code>heroku run rake copycopter:project</code> de nuevo con diferente nombre de proyecto.</p>