<p>Si nuestra aplicaci&oacute;n maneja fechas, con frecuencia tendremos que mostrar un calendario en la interfaz de usuario.  A los usuarios  les ser&aacute; mucho m&aacute;s f&aacute;cil introducir fechas en un campo concreto escogiendolas de un calendario en una ventana emergente que de una serie de listas desplegables o escribi&eacute;ndolas directamente en una campo de texto.  Adem&aacute;s, si nuestra aplicaci&oacute;n tiene muchos registros con un campo de fecha podemos proporcionar una vista de calendario que permita mostrar estos elementos .  Veremos como hacer todo esto en este episodio. 

	<p>La aplicaci&oacute;n con la que vamos a trabajar es una aplicaci&oacute;n de <em>blog</em> sencilla que tiene varios art&iacute;culos, pero esto nos podr&iacute;a servir para casi cualquier aplicaci&oacute;n que requiera en alg&uacute;n punto introducir fechas.  Cuando creemos o editemos un art&iacute;culo podemos escoger una fecha de publicaci&oacute;n utilizando el selector de fechas cl&aacute;sico de Rails.  Vamos a cambiar esto para que podamos utilizar un calendario emergente como forma alternativa de escoger la fecha.</p>

<div class="imageWrapper">
  <img src="/system/photos/379/original/E213I01.png" width="804" height="539" alt="La página de edición de un artículo con los desplegables de fecha."/>
</div>

<p>Es complicado programar una vista de calendario desde el principio pero hay varias soluciones disponibles que nos permiten hacer casi cualquier cosa que queramos con calendarios y fechas.  Una de ellas es <a href="http://github.com/timcharper/calendar_date_select">calendar_date_select plugin</a> que proporciona un m&eacute;todo <em>helper</em> que funciona con la librer&iacute;a Prototype para mostrar un calendario usando JavaScript.   Pero no lo vamos a hacer as&iacute;, en sulugar utilizaremos una soluci&oacute;n diferente que utiliza JavaScript no intrusivo y utiliza jQuery.  Aunque no se trata de una soluci&oacute;n espec&iacute;fica de Rails la hemos escogido porque permite mostrarnos de forma sencila c&oacute;mo a&ntilde;adir el calendario a un campo de fecha.</p>

<p>La librer&iacute;a <a href="http://jqueryui.com/">jQuery UI</a> proporciona un <a href="http://jqueryui.com/demos/datepicker/">selector de fechas</a> que se puede adjuntar de forma no intrusiva a cualquier campo de texto de una p&aacute;gina.  Cuando dicho campo recibe el foco (bien porque el usuario hace clic o porque lo selecciona con la tecla de tabulaci&oacute;n) muestra una ventana emergente con el calendairo y se puede escoger una fecha tras lo cual su valor queda en el campo de texto.  Este calendario se puede personalizar usando <a href="http://jqueryui.com/themeroller/">Themeroller</a> para darle casi cualquier aspecto que queramos.  Si nos interesa ponernos manos a la obra r&aacute;pidamente podemos utilizar los ficheros JavaScript y las hojas de estilo alojadas en los servidores de Google para incluir el c&oacute;digo de jQuery y uno de los temas por defecto.  S&oacute;lo tenemos que hacer referencia a los archivos apropiados en la cabecera de nuestra vista de <em>layout</em>.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot; xml:lang=&quot;en&quot; lang=&quot;en&quot;&gt;
&lt;head&gt;
  &lt;meta http-equiv=&quot;Content-Type&quot; content=&quot;text/html; charset=utf-8&quot;/&gt;
  &lt;%= stylesheet_link_tag &quot;http://ajax.googleapis.com/ajax/libs/jqueryui/1.7.2/themes/redmond/jquery-ui.css&quot;, &quot;application&quot; %&gt;
  &lt;%= javascript_include_tag &quot;http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js&quot;, &quot;http://ajax.googleapis.com/ajax/libs/jqueryui/1.8.1/jquery-ui.min.js&quot;, &quot;application&quot; %&gt;
  &lt;title&gt;&lt;%= yield :title %&gt;&lt;/title&gt;
&lt;/head&gt;
</pre>

<p>N&oacute;tese que la aplicaci&oacute;n con la que estamos trabajando est&aacute; escrita en Rails 2.  Si estuvi&eacute;semos utilizando Rails 3 tendr&iacute;amos que a&ntilde;adir la versi&oacute;n compatible con jQuery del fichero <code>rails.js</code> tal y como vimos en el episodio 205
 [<a href="http://railscasts.com/episodes/205-unobtrusive-javascript">verlo</a>, <a href="http://es.asciicasts.com/episodes/205-javascript-no-intrusivo">leerlo</a>].</p>

<p>Ahora que hemos incluido las librer&iacute;as jQuery y jQueryUI podemos empezar a modificar nuestra aplicaci&oacute;n para que funcione con el selector de fechas.  Lo primero que tneemos que hacer es modificar el campo <code>published_on</code> en el formulario del art&iacute;culo para que utilice un  <code>text_field</code> en lugar de <code>date_select</code>.</p>

<p class="codeFilePath">/app/views/articles/_form.html.erb</p>
<pre class="ruby">
&lt;%= f.label :published_on %&gt;
&lt;%= f.text_field :published_on %&gt;
</pre>

<p>A continuaci&oacute;n a&ntilde;adiremos de forma no instrusiva el calendario.  Esto lo podemos hacer a&ntilde;adiendo un poco de JavaScript al fichero <code>application.js</code>.</p>

<p class="codeFilePath">/public/javascripts/application.js</p>
<pre class="javascript">
$(function (){
	$(&#x27;#article_published_on&#x27;).datepicker();
});
</pre>

<p>Este c&oacute;digo se activar&aacute; cuando el DOM est&eacute; listo y a&ntilde;adir&aacute; el selector de fecha a cualquier elemento cuyo <code>id</code> sea <code>article_published_at</code>.  Si recargamos la p&aacute;gina de edici&oacute;n de art&iacute;culo y hacemos clic en el campo de texto de <code>published_on</code> veremos el calendario desplegado y podremos escoger una fecha en &eacute;l.</p>

<div class="imageWrapper">
  <img src="/system/photos/380/original/E213I02.png" width="804" height="539" alt="The dropdowns have now been replaced by a textbox with a calendar popup."/>
</div>

<p>Si ahora enviamos el formulario, Rails obtendr&aacute; la fecha a partir del valor de la caja de texto y actualizar&aacute; el valor de <code>published_on</code> en la tabla de art&iacute;culos de la base de datos.</p>

<h3>Una vista de Calendario</h3>

<p>Ahora que tenemos funcionando nuestro selector de fechas pasemos al otro uso de calendarios de que habl&aacute;bamos: mostrar una vista de calendario de todos los art&iacute;culos de nuestra aplicaci&oacute;n.  Probablemente no sea la forma m&aacute;s eficiente de mostrar los art&iacute;culos de un blog pero nos servir&aacute; para mostrar una forma alternativa de ver dichos art&iacute;culo.</p>

<p>Hay varias soluciones posibles para este problema, y encontrar la correcta depende de las necesidades de nuestra aplicaci&oacute;n.  Si tenemos que mostrar registros que se extienden durante varios d&iacute;as merece la pena ver el plugin <a href="http://github.com/elevation/event_calendar">event_calendar</a> que puede mostrar eventos que ocupen varios d&iacute;as.   Si, por el contrario, no necesitamos esta funcionalidad <a href="http://github.com/p8/table_builder">table_builder</a> es una buena alternativa.   Este <em>plugin</em> ofrece un m&eacute;todo <em>helper</em> llamado <code>calendar_for</code> que facilita el agrupamiento de varios registros sobre los d&iacute;as de un calendario.  Esto se adapta mejor a nuestras necesidades, as&iacute; que lo usaremos para nuestro ejemplo.</p>

<p>Podemos instalar table_builder con el siguiente comando:</p>

<pre class="terminal">
script/plugin install git://github.com/p8/table_builder.git
</pre>

<p>Una vez que haya finalizado la instalaci&oacute;n podemos empezar a trabajar en nuestra vista de calendario cambiando la v&iacute;sta  <code>index</code> en el controlador de art&iacute;culos.  Ahora mismo tiene este aspecto:</p>

<p class="codeFilePath">/app/views/articles/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Articles&quot; %&gt;
&lt;div id=&quot;articles&quot;&gt;
&lt;% @articles.each do |article| %&gt;
  &lt;h2&gt;
    &lt;%= link_to h(article.title), article %&gt;
    &lt;span class=&quot;comments&quot;&gt;(&lt;%= pluralize(article.comments.count, &#x27;comment&#x27;) %&gt;)&lt;/span&gt;
  &lt;/h2&gt;
  &lt;div class=&quot;author&quot;&gt;from &lt;%=h article.author %&gt; on &lt;%= article.written_date.strftime(&#x27;%b %d, %Y&#x27;) %&gt;&lt;/div&gt;
  &lt;div class=&quot;content&quot;&gt;&lt;%= h(article.content) %&gt;&lt;/div&gt;
&lt;% end %&gt;
&lt;/div&gt;
&lt;p&gt;&lt;%= link_to &quot;New Article&quot;, new_article_path %&gt;&lt;/p&gt;
</pre>

<p>Vamos a cambiar el c&oacute;digo que itera sobre todos los art&iacute;culos y los muestra por una llamada a <code>calendar_for</code> para mostrar la vista de calendario.</p>


<p class="codeFilePath">/app/views/articles/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Articles&quot; %&gt;

&lt;div id=&quot;calendar&quot;&gt;
  &lt;% calendar_for @articles do |calendar| %&gt;
    &lt;% calendar.day(:day_method =&gt; :published_on) do |date, articles| %&gt;
      &lt;%= date.day %&gt;
    &lt;% end %&gt;
  &lt;% end %&gt;
&lt;/div&gt;
</pre>

<p>Invocamos a <code>calendar_for</code> y le pasamos nuestra colecci&oacute;n de art&iacute;culos.  El bloque se ejecuta una vez y recibe un objeto <code>calendar</code> para que podamos usar <code>calendar.day</code> para iterar sobre cada d&iacute;a.  Tenemos que especificar qu&eacute; propiedad del art&iacute;culo devuelve la fecha sobre la que queremos agrupar, as&iacute; que en nuestro caso pasaremos el par&aacute;metro <code>:day_method</code> con valor <code>:published_on</code>.  El bloque tiene dos par&aacute;metros: una fecha y una lista de art&iacute;culos publicados ese d&iacute;a.  Podemos poner el c&oacute;digo que queramos dentro de este bloque, pero por ahora simplemente nos limitaremos a mostrar el d&iacute;a del mes de esa fecha.</p>

<p>Si recargamos la p&aacute;gina no veremos el listado de art&iacute;culos pero un su lugar veremos un conjunto de fechas que empiezan a parecerse a un calendario.</p>

<div class="imageWrapper">
  <img src="/system/photos/381/original/E213I03.png" width="800" height="289" alt="Una vista de calendario rudimentaria generada con table_builder."/>
</div>

<p>Todav&iacute;a no tiene muy buen aspecto, pero podemos a&ntilde;adir una <a href="http://github.com/ryanb/railscasts-episodes/blob/master/episode-213/blog/public/stylesheets/application.css">CSS</a> para mejorar el aspecto.</p>

<div class="imageWrapper">
  <img src="/system/photos/382/original/E213I04.png" width="842" height="460" alt="El calendario con una hoja de estilos."/>
</div>

<p>Podemos mejorar la usabilidad del calendario a&ntilde;adiendo los nombres de los d&iacute;as, empleando el m&eacute;todo <code>calendar.head</code> .</p>

<p class="codeFilePath">/app/views/articles/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Articles&quot; %&gt;

&lt;div id=&quot;calendar&quot;&gt;
  &lt;% calendar_for @articles do |calendar| %&gt;
    &lt;%= calendar.head(&#x27;Sunday&#x27;, &#x27;Monday&#x27;, &#x27;Tuesday&#x27;, &#x27;Wednesday&#x27;, &#x27;Thursday&#x27;, &#x27;Friday&#x27;, &#x27;Saturday&#x27;)%&gt;
    &lt;% calendar.day(:day_method =&gt; :published_on) do |date, articles| %&gt;
      &lt;%= date.day %&gt;
    &lt;% end %&gt;
  &lt;% end %&gt;
&lt;/div&gt;
</pre>

<p>Si recargamos la p&aacute;gina veremos que se han a&ntilde;adido los d&iacute;as de la semana a la parte superior del calendario.</p>


<div class="imageWrapper">
  <img src="/system/photos/383/original/E213I05.png" width="842" height="460" alt="En el calendario aparecen los días de la semana."/>
</div>

<p>En su estado actual el calendario tan s&oacute;lo muestra fechas del mes actual, as&iacute; que lo siguiente que haremos ser&aacute; a&ntilde;adir un selector de mes que muestre el mes actual con enlaces para navegar al mes anterior o siguiente.</p>

<p>Empezaremos con la acci&oacute;n <code>index</code> del controlador de art&iacute;culos donde crearemos una variable que guardar&aacute; la fecha del mes que queraos mostrar.  Por ahora dejaremos la fecha actual.</p>

<p class="codeFilePath">/app/controllers/articles_controller.rb</p>
<pre class="ruby">
def index
  @articles = Article.all
  @date = Date.today
end
</pre>
<p>A continuaci&oacute;n modificaremos la vista para que se muestren el mes y los enlaces.</p>


<p class="codeFilePath">/app/controllers/articles_controller.rb</p>
<pre class="ruby">
&lt;% title &quot;Articles&quot; %&gt;

&lt;div id=&quot;calendar&quot;&gt;
  &lt;h2 id=&quot;month&quot;&gt;
    &lt;%= link_to &quot;&lt;&quot;, :month =&gt; (@date.beginning_of_month-1).strftime(&quot;%Y-%m-01&quot;) %&gt;
    &lt;%= h @date.strftime(&quot;%B %Y&quot;) %&gt;
    &lt;%= link_to &quot;&gt;&quot;, :month =&gt; (@date.end_of_month+1).strftime(&quot;%Y-%m-01&quot;) %&gt;
  &lt;/h2&gt;
  &lt;% calendar_for @articles, :year =&gt; @date.year, :month =&gt; @date.month do |calendar| %&gt;
    &lt;%= calendar.head(&#x27;Sunday&#x27;, &#x27;Monday&#x27;, &#x27;Tuesday&#x27;, &#x27;Wednesday&#x27;, &#x27;Thursday&#x27;, &#x27;Friday&#x27;, &#x27;Saturday&#x27;) %&gt;
    &lt;% calendar.day(:day_method =&gt; :published_on) do |date, articles| %&gt;
      &lt;%= date.day %&gt;
    &lt;% end %&gt;
  &lt;% end %&gt;
&lt;/div&gt;
</pre>

<p>Los enlaces apuntan ambos a la acci&oacute;n actual <code>index</code> pero a&ntilde;aden un par&aacute;metro a la cadena de consulta llamado <code>month</code> que especifica el mes anterior o el siguiente.  Ya podemos volver al c&oacute;digo del controlador y comprobar la existencia de dicho par&aacute;metro y utilizarlo para establecer el valor de la variable <code>@date</code>.</p>

<p class="codeFilePath">/app/controllers/articles_controller.rb</p>
<pre class="ruby">
def index
  @articles = Article.all
  @date = params[:month] ? Date.parse(params[:month) ? Date.today
end
</pre>

<p>Si recargamos la p&aacute;gina veremos el mes sobre el calendario y con las flechas a su lado podremos navegar a otros meses.</p>


<div class="imageWrapper">
  <img src="/system/photos/384/original/E213I06.png" width="842" height="460" alt="Ya hemos añadido los enalces para cambiar el mes"/>
</div>

<p>Nuestra vista de calendario goza de buen aspecto pero a&uacute;n no muestra los art&iacute;culos que existen en una determinada fecha.  Ya tenemos acceso a los art&iacute;culos de un d&iacute;a en el bloque  <code>calendar.day</code> por lo que podremos iterar sobre esta colecci&oacute;n y mostrar un enlace a cada art&iacute;culo en una lista.</p>

<p class="codeFilePath">/app/views/articles/index.html.erb</p>
<pre class="ruby">
&lt;% calendar_for @articles, :year =&gt; @date.year, :month =&gt; @date.month do |calendar| %&gt;
  &lt;%= calendar.head(&#x27;Sunday&#x27;, &#x27;Monday&#x27;, &#x27;Tuesday&#x27;, &#x27;Wednesday&#x27;, &#x27;Thursday&#x27;, &#x27;Friday&#x27;, &#x27;Saturday&#x27;)%&gt;
  &lt;% calendar.day(:day_method =&gt; :published_on) do |date, articles| %&gt;
    &lt;%= date.day %&gt;
    &lt;ul&gt;
      &lt;% for article in articles %&gt;
        &lt;li&gt;&lt;%= link_to h(article.title), article %&gt;&lt;/li&gt;
      &lt;% end %&gt;
    &lt;/ul&gt;
  &lt;% end %&gt;
&lt;% end %&gt;
</pre>

<p>Si recargamos la p&aacute;gina por &uacute;ltima vez veremos listados los art&iacute;culos de cada d&iacute;a y podemos hacer clic en los enlaces para visitar los art&iacute;culos.</p>

<div class="imageWrapper">
  <img src="/system/photos/385/original/E213I07.png" width="842" height="488" alt="Los artículos aparecen listados en el calendario."/>
</div>

<p>Y con esto termina nuestro episodio.  Tal y como hemos visto es muy sencilllo tuilizar calendarios para seleccionar fechas o mostrar una lista de registros ordenados por un campo de fecha.  Es muy recomendable utilizar una vista de calendario como esta cuando se adapte a los datos de nuestra aplicaci&oacute;n.</p>
