<p>En los pr&oacute;ximos tres episodios mostraremos como agregar administraci&oacute;n a su sitio web.</p>

<div class="imageWrapper">
  <img src="/system/photos/15/original/E019I01.png" width="709" height="458" alt="The ASCIIcasts homepage."/>
</div>

<p>Arriba vemos una captura de pantalla de una versi&oacute;n inicial del sitio ASCIIcasts, de antes que tuviera funciones de administraci&oacute;n escritas. No exist&iacute;a forma de editar o agregar episodios excepto utilizando <code>script/console</code> o editando manualmente la base de datos. Lo que quisi&eacute;ramos hacer es agregar una secci&oacute;n admin al sitio para poder realizar cambios a los episodios a trav&eacute;s del sitio.</p>

<p>La &#x27;antigua&#x27; forma de hacerlo hubiera sido generar un scaffold para los episodios dentro de un m&oacute;dulo admin.</p>

<pre class="terminal">
script/generate scaffold episode &quot;admin/episodes&quot;  
</pre>

<p>Esto nos hubiera dado un set de p&aacute;ginas administrativas que nos permitieran administrar nuestros episodios.</p>

<div class="imageWrapper">
  <img src="/system/photos/16/original/E019I02.png" width="654" height="326" alt="The admin page for editing episodes." />
</div>

<p>Esta idea funciona, pero no es la ideal ya que estar&iacute;amos duplicando funcionalidad. Ya tenemos una p&aacute;gina que nos muestra un listado de nuestros episodios: la p&aacute;gina principal de nuestro sitio. En vez de escribir una secci&oacute;n administrativa completamente por separado, podr&iacute;amos ubicar nuestros links de administraci&oacute;n en una l&iacute;nea en el sitio p&uacute;blico (Solamente vamos a querer que nuestros links administrativos sean visibles por los administradores logueados).</p>

<h3>Implementaci&oacute;n de los links de administraci&oacute;n</h3>

<p>Los res&uacute;menes de los episodios en la p&aacute;gina index son creados dentro de un partial. Vamos a editar ese partial para agregar los links de edici&oacute;n (edit) y borrado (destroy).</p>

<pre class="ruby">
&lt;li&gt;  
    &lt;p class=&quot;episodeId&quot;&gt;&lt;%= episode.episode_id %&gt;&lt;/p&gt;  
    &lt;h3&gt;&lt;%= link_to episode.title, episode_path(episode.identifier) %&gt;&lt;/h3&gt;  
    &lt;p class=&quot;summary&quot;&gt;&lt;%= episode.summary %&gt;&lt;/p&gt;  
    &lt;p class=&quot;tagList&quot;&gt;Tags: &lt;% episode.tags.each do |tag| %&gt; &lt;%= link_to tag.title, tag_path(tag.title) %&gt; &lt;% end %&gt;&lt;/p&gt;  
    &lt;p class=&quot;adminActions&quot;&gt;  
      &lt;%= link_to &quot;Edit&quot;, edit_episode_path(episode) %&gt;  
      &lt;%= link_to &quot;Destroy&quot;, episode_path(episode), :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;  
    &lt;/p&gt;  
&lt;/li&gt;  
</pre>
<p class="title">El partial del episodio con los links <code>destroy</code> y <code>edit</code>.</p>

<p>En la parte de abajo de la p&aacute;gina index  vamos a agregar un link para crear un nuevo episodio:</p>

<pre class="ruby">
&lt;%= link_to &ldquo;New&rdquo;, new_episode_path %&gt;  
</pre>

<p>Ahora nuestra p&aacute;gina index tiene los links de administraci&oacute;n, pero tenemos dos problemas. Primero, los links no hacen nada, ya que todav&iacute;a no hemos escrito las acciones new, edit o destroy. Segundo, los links pueden ser vistos por cualquier persona. El primer problema es de f&aacute;cil soluci&oacute;n y se resuelve escribiendo el c&oacute;digo apropiado para las acciones <code>new</code>, <code>edit</code>, <code>update</code>, etc. y veremos la soluci&oacute;n al segundo problema en el siguiente episodio.</p>

<div class="imageWrapper">
  <img src="/system/photos/17/original/E019I03.png" width="663" height="558" alt="The homepage with the admin links in place." />
</div>