<p>Au travers des 3 prochains &eacute;pisodes, nous allons vous montrer une excellente fa&ccedil;on d&#x27;ajouter une aadministration &agrave;
votre site.</p>
<img src="/system/photos/15/original/E019I01.png" width="709" height="458"/>
<p>Ci-dessus une repr&eacute;sentation d&#x27;ASCIIcasts avant qu&#x27;il n&#x27;y ait ses fonctions d&#x27;administration. Il n&#x27;y avait aucune
fa&ccedil;on d&#x27;&eacute;crire les &eacute;pisodes sans utiliser <code>script/console</code> ou en modifiant manuellement la base de donn&eacute;es.
Ce que nous aimerions faire, c&#x27;est ajout&eacute; une interface d&#x27;administration au site pour pouvoir faire nos changements via
le site.</p>
<p>L&#x27;ancienne fa&ccedil;on de faire aurait &eacute;t&eacute; de g&eacute;n&eacute;rer un ensemble de fichier pour chaque &eacute;pisode via le module
d&#x27;administration.</p>
<pre class="ruby">
script/generate scaffold episode &quot;admin/episodes&quot;
</pre>
<p>Ceci fournira un ensemble de pages d&#x27;administration pour nous permettre de g&eacute;rer nos &eacute;pisodes.</p>
<img src="/system/photos/16/original/E019I02.png" width="654" height="326" />
<p>Cette approche fonctionne mais elle n&#x27;est pas id&eacute;ale vu que nous dupliquons des fonctionnalit&eacute;s. Nous avons d&eacute;j&agrave; une
page qui liste nos &eacute;pisodes : la page d&#x27;accueil du site. Au lieu d&#x27;&eacute;crire une section d&#x27;administration enti&egrave;rement
s&eacute;par&eacute;e, nous pouvons placer nos liens d&#x27;administration dans le site public. (Bien s&ucirc;r, nous ne voudrons que nos liens
ne soient visibles que par les administrateurs connect&eacute;s !)</p>

<h3>Impl&eacute;menter les liens d&#x27;administration</h3>
<p>Les r&eacute;sum&eacute;s des &eacute;pisodes dans la page d&#x27;index sont rendues via une vue partielle (partial).</p>
<pre class="ruby">
&lt;li&gt;
	&lt;p class=&quot;episodeId&quot;&gt;&lt;%= episode.episode_id %&gt;&lt;/p&gt;
	&lt;h3&gt;&lt;%= link_to episode.title, episode_path(episode.identifier) %&gt;&lt;/h3&gt;
	&lt;p class=&quot;summary&quot;&gt;&lt;%= episode.summary %&gt;&lt;/p&gt;
	&lt;p class=&quot;tagList&quot;&gt;Tags: &lt;% episode.tags.each do |tag| %&gt; &lt;%= link_to tag.title, tag_path(tag.title) %&gt; &lt;% end %&gt;&lt;/p&gt;
	&lt;p class=&quot;adminActions&quot;&gt;
	  &lt;%= link_to &quot;Edit&quot;, edit_episode_path(episode) %&gt;
	  &lt;%= link_to &quot;Destroy&quot;, episode_path(episode), :confirm =&gt; &quot;Are you sure?&quot;, :method =&gt; :delete %&gt;
	&lt;/p&gt;
&lt;/li&gt;
</pre>
<p class="title">La vue partielle <code>episode</code> avec les liens <code>edit</code> et <code>destroy</code> qjout&eacute;s.</p>
  
<p>En bqs de la page d&#x27;index nous allons ajouter un lien pour cr&eacute;er un nouvel &eacute;pisode :</p>
<pre class="ruby">
&lt;%= link_to &ldquo;New&rdquo;, new_episode_path %&gt;
</pre>
<p>Maintenant, notre page d&#x27;index a les liens d&#x27;administration mais nous avons deux probl&egrave;mes. D&#x27;abord, les liens ne
font puisque nous n&#x27;avons pas les actions new, edit et destroy pour le moment; Ensuite, les liens peuvent &ecirc;tre vus par
n&#x27;importe qui. Le premier probl&egrave;me peut &ecirc;tre r&eacute;solu facilement en &eacute;crivant le code appropri&eacute; pour les actions
<code>new</code>, <code>edit</code>, <code>update</code>. Nous aborderons le deuxi&egrave;me probl&egrave;me dans le prochain &eacute;pisode.</p>
<img src="/system/photos/17/original/E019I03.png" width="663" height="558" />
