<p>Esta semana tenemos un episodio un poco diferente.  Se trata de un ejercicio de refactorizaci&oacute;n que mostrar&aacute; una divertida t&eacute;cnica de Ruby que hemos bautizado como el Delegador Din&aacute;mico.</p>

<p>Como demostraci&oacute;n de esta t&eacute;cnica utilizaremos una aplicaci&oacute;n que es una tienda sencilla, con un modelo 
<code>Product</code> que tiene su controlador asociado, <code>ProductsController</code>. La acci&oacute;n <code>index</code> de este controlador permite filtra la lista de productos por nombre y precio.  Si pasamos en la URL uno o varios par&aacute;metros llamados <code>name</code>, <code>price_lt</code> y <code>price_gt</code> se pueden hacer b&uacute;squedas de productos que coincidan con ese nombre y precios, por ejemplo, todos los productos cuyo nombre contiene &ldquo;video&rdquo; y cuestan m&aacute;s de &pound;50.</p>

<div class="imageWrapper">
  <img src="/system/photos/377/original/E212I01.png" width="800" height="315" alt="Filtro de la lista de productos."/>
</div>

<p>Antes de refactorizar la acci&oacute;n <code>index</code>, ech&eacute;mosle un vistazo para ver qu&eacute; es lo que hace.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
class ProductsController &lt; ApplicationController
  def index
    @products = Product.scoped
    @products = @products.where(&quot;name like ?&quot;, &quot;%&quot; + params[:name] + &quot;%&quot;) if params[:name]
    @products = @products.where(&quot;price &gt;= ?&quot;, params[:price_gt]) if params[:price_gt]
    @products = @products.where(&quot;price &lt;= ?&quot;, params[:price_lt]) if params[:price_lt]
  end

  # Other actions
end
</pre>

<p>Se trata de una aplicaci&oacute;n Rails 3, as&iacute; que estamos usando el m&eacute;todo <code>where</code> para agregar condiciones a la consulta si recibimos los par&aacute;metros correspondientes pero antes de hacerlo utilizamos <code>Product.scoped</code> para recuperar todos los productos.  Puede que no estemos familiarizados con este m&eacute;todo, pero en esencia no es m&aacute;s que otra forma de decir <code>Product.all</code>, la diferencia estriba en que el m&eacute;todo <code>all</code> realizar&aacute; una consulta a la base de datos tan pronto como sea ejecutado y devolver&aacute; un <em>array</em> de productos. No queremos que esto ocurra hasta que no hayamos aplicado nuestros filtros por lo que usando <code>scoped</code> podremos a&ntilde;adir condiciones a la consulta antes de ejecutarla.</p>

<p>Veamos c&oacute;mo refactorizar esta acci&oacute;n.  El primer paso que vamos a dar ser&aacute; sacar la l&oacute;gica del controlador, ya que no pertenece ah&iacute;.  En cualquier lenguaje orientado a objetos, si descubrimos que desde un objeto llamamos a muchos m&eacute;todos de otro por lo general esto quiere decir que deber&iacute;amos mover esa l&oacute;gica al otro objeto.  En este caso en la acci&oacute;n <code>index</code> de la clase <code>ProductController</code>  estamos invocando cuatro m&eacute;todos del modelo <code>Product</code> lo que sugiere que este c&oacute;digo deber&iacute;a estar en el modelo.</p>


<p>Quitaremos el c&oacute;digo de la acci&oacute;n <code>index</code> y en su lugar pondremos una llamada a un nuevo m&eacute;todo de clase en el modelo <code>Product</code>, llamada <code>search</code>, pas&aacute;ndole el <em>hash</em> de par&aacute;metros para que sepa qu&eacute; es lo que tiene que buscar.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
class ProductsController &lt; ApplicationController
  def index
    @products = Product.search(params)
  end

  # Other actions
end
</pre>

<p>A continuaci&oacute;n escribiremos este m&eacute;todo en el modelo <code>Product</code>.  Queremos que este m&eacute;todo sea de clase, asi que lo definiremos como <code>self.search</code>.  Este c&oacute;digo ser&aacute; el mismo que ten&iacute;amos en el controlador pero en lugar de la variable de instancia que ten&iacute;amos en el controlador aqu&iacute; tendremos una variable local que devolveremos al salir del m&eacute;todo.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  belongs_to :category
  
  def self.search(params)
    products = scoped
    products = products.where(&quot;name like ?&quot;, &quot;%&quot; + params[:name] + &quot;%&quot;) if params[:name]
    products = products.where(&quot;price &gt;= ?&quot;, params[:price_gt]) if params[:price_gt]
    products = products.where(&quot;price &lt;= ?&quot;, params[:price_lt]) if params[:price_lt]    
    products
  end 

end
</pre>

<p>Si recargamos la p&aacute;gina veremos que parece que no hemos roto nada.</p>

<div class="imageWrapper">
  <img src="/system/photos/377/original/E212I01.png" width="800" height="315" alt="La p&aacute;gina sigue funcionando."/>
</div>

<p>Est&aacute; claro que al recargar la p&aacute;gina s&oacute;lo hemos comprobado que los cambios del c&oacute;digo funcionan para estos par&aacute;metros espec&iacute;f&iacute;cos.   Es en este tipo de escenarios en los que es mejor aplicar el Desarrollo Basado en Tests: cada vez se nos har&aacute; m&aacute;s tedioso ir recargando la p&aacute;gina y no nos ser&aacute; f&aacute;cil ir comprobando todos y cada uno de los caminos que puede seguir el c&oacute;digo seg&uacute;n los par&aacute;metros recibidos.  Es buena idea, sobre todo cuando estamos rfactorizando nuestro c&oacute;digo, tener una bater&iacute;a de tests lo m&aacute;s completa posible para poder estar seguros de que no hemos introducido ning&uacute;n efecto lateral.</p>

<p>Adem&aacute;s al haber llevado el c&oacute;digo al modelo tenemos la ventaja adicional de que &eacute;ste ser&aacute; m&aacute;s f&aacute;cil de probar porque s&oacute;lo nos va a hacer falta escribir un test unitario contra el c&oacute;digo del modelo en lugar de hacer un escenario completo de integraci&oacute;n.</p>

<h3>Introducci&oacute;n al Delegador Din&aacute;mico</h3>

<p>Ya hemos refactorizado un poco el c&oacute;digo moviendo la l&oacute;gica de b&uacute;squeda al modelo, y vamos a ir un poco m&aacute;s lejos eliminando la necesidad de reasignar la variable <code>products</code> cada vez que a&ntilde;adimos una condici&oacute;n.  Se trata de un patr&oacute;n com&uacute;n cuando trabajamos con par&aacute;metros de b&uacute;squeda y si se da mucho en nuestras aplicaciones deber&iacute;amos considerar la t&eacute;cnica que vamos a presentar, que nosotros hemos llamado el Delegador Din&aacute;mico.</p>

<p>En vez de explicar c&oacute;mo funciona el delegador din&aacute;mico, veremos c&oacute;mo podemos utilizar uno para refactorizar el c&oacute;digo de nuestra b&uacute;squeda.  Empezaremos creando una clase de delegador din&aacute;mico en el directorio  <code>/lib</code> de nuestra aplicaci&oacute;n.</p>

<p class="codeFilePath">/lib/dynamic_delegator.rb</p>
<pre class="ruby">
class DynamicDelegator
  def initialize(target)
    @target = target
  end  
  
  def method_missing(*args, &amp;block)
    @target.send(*args, &amp;block)
  end
end
</pre>

<p>La clase <code>DynamicDelegator</code> recibe un argumento en su inicializador, un objeto destino, y pone una variable local apuntando a dicho objeto.  Tambi&eacute;n sobrecarga <code><a href="http://ruby-doc.org/core/classes/Kernel.html#M005925">method_missing</a></code>, por lo que cualquier llamada a este objeto que no est&eacute; soportada ser&aacute; enviada al objeto destino con los mismos argumentos y el mismo bloque (si lo hubiera).</p>

<p>Podemos ver nuestro <code>DynamicDelegator</code> como un objeto proxy que pasa cualquier m&eacute;todo que sea invocado sobre &eacute;l al objeto de destino, y esto significa que podemos usarlo donde queramos, as&iacute; que podemos cambiar el objeto <code>scoped</code> en el m&eacute;todo <code>search</code> del modelo <code>Product</code> por un <code>DynamicDelegator</code> que recibe dicho objeto como argumento.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  belongs_to :category
  
  def self.search(params)
    products = DynamicDelegator(scoped)
    products = products.where(&quot;name like ?&quot;, &quot;%&quot; + params[:name] + &quot;%&quot;) if params[:name]
    products = products.where(&quot;price &gt;= ?&quot;, params[:price_gt]) if params[:price_gt]
    products = products.where(&quot;price &lt;= ?&quot;, params[:price_lt]) if params[:price_lt]    
    products
  end 

end
</pre>

<p>Se puede comprobar que esto funciona recargando la p&aacute;gina y veremos los mismos resultados.</p>

<div class="imageWrapper">
  <img src="/system/photos/377/original/E212I01.png" width="800" height="315" alt="La p&aacute;gina sigue funcionando."/>
</div>

<p>En este punto tal vez nos preguntemos el sentido de utilizar un <code>DynamicDelegator</code> en lugar del objeto <code>scoped</code>, y la ventaja del delegador es que podemos hacer lo que queramos dentro de  <code>method_missing</code>.  En lugar de delegar siempre al mismo objeto de destino podemos modificar dicho destino y hacerlo m&aacute;s din&aacute;mico.</p>

<p>Por ejemplo podr&iacute;amos querer capturar el resultado de la llamado al m&eacute;todo en <code>method_missing</code> y si devuelve un objeto de la misma clase que el objeto destino, hacer que el nuevo destino pase a ser el resultado.</p>

<p class="codeFilePath">/lib/dynamic_delegator.rb</p>
<pre class="ruby">
class DynamicDelegator
  def initialize(target)
    @target = target
  end  
  
  def method_missing(*args, &amp;block)
    result = @target.send(*args, &amp;block)
    @target = result if result.kind_of? @target.class
    result
  end
end
</pre>

<p>Con esto ya podemos quitar el c&oacute;digo que reinicia la variable <code>products</code> en cada l&iacute;nea del m&eacute;todo <code>search</code> en el modelo <code>Product</code>.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  belongs_to :category
  
  def self.search(params)
    products = DynamicDelegator.new(scoped)
    products.where(&quot;name like ?&quot;, &quot;%&quot; + params[:name] + &quot;%&quot;) if params[:name]
    products.where(&quot;price &gt;= ?&quot;, params[:price_gt]) if params[:price_gt]
    products.where(&quot;price &lt;= ?&quot;, params[:price_lt]) if params[:price_lt]    
    products
  end 

end
</pre>

<p>Esto se puede hacer porque siempre que invoquemos el m&eacute;todo <code>where</code> recibiremos un objeto del mismo tipo que <code>scoped</code> y por tanto el destino cambiar&aacute; cada vez.  Recarguemos la p&aacute;gina y veamos que sigue funcionando.</p>

<div class="imageWrapper">
  <img src="/system/photos/378/original/E212I02.png" width="800" height="315" alt="El delegador din&aacute;mico se devuelve a s&iacute; mismo en lugar de su objeto destino."/>
</div>

<p>No lo hace, y el motivo es que no estamos delegando todos los m&eacute;todos a nuestro objeto de destino.  En este caso el problema es el m&eacute;todo <code>class</code>, y veremos por qu&eacute; en la consola.   Si invocamos <code>Product.search</code> con un <em>hash</em> vac&iacute;o e invocamos  <code>class</code> sobre el resultado, veremos que recibimos <code>DynamicDelegator</code>.</p>

<pre class="terminal">
ruby-head &gt; Product.search({}).class
 =&gt; DynamicDelegator
</pre>

<p>As&iacute; que nuestro delegador din&aacute;mico no lo est&aacute; delegando todo al objeto de destino, ya que tiene algunos m&eacute;todos definidos sobre s&iacute; mismo.  Esto es debido a que la clase <code>DynamicDelegator</code> hereda de <code>Object</code> y <code>Object</code> tiene muchos m&eacute;todos definidos, uno de los cuales es  <code>class</code>.</p>

<pre class="terminal">
ruby-head &gt; Object.instance_methods.count
 =&gt; 108 
ruby-head &gt; Object.instance_methods.grep /class/
 =&gt; [:subclasses_of, :class_eval, :class, :singleton_class]
</pre>

<p>Necesitamos algo m&aacute;s despejado sobre lo que basarnos, y en Ruby 1.9 existe otra clase que podemos usar, llamada <code>BasicObject</code> que tiene muchos menos m&eacute;todos.</p>

<pre class="terminal">
ruby-head &gt; BasicObject.instance_methods
 =&gt; [:==, :equal?, :!, :!=, :instance_eval, :instance_exec, :__send__]
</pre> 

<p>Esta clase es un mejor punto de partida para hacer objetos proxy o delegados que usen 
 <code>method_missing</code>.  Si cambiamos <code>DynamicDelegator</code> para que herede de <code>BasicObject</code> , el m&eacute;todo <code>class</code> no estar&aacute; definido y su invocaci&oacute;n acabar&aacute; pasando a trav&eacute;s de <code>method_missing</code>.</p>

<p class="codeFilePath">/lib/dynamic_delegator.rb</p>
<pre class="ruby">
class DynamicDelegator &lt; BasicObject
  def initialize(target)
    @target = target
  end  
  
  def method_missing(*args, &amp;block)
    result = @target.send(*args, &amp;block)
    @target = result if result.kind_of? @target.class
    result
  end
end
</pre>

<p>Si recargamos la p&aacute;gina, veremos que ahora s&iacute; que funciona.</p>

<div class="imageWrapper">
  <img src="/system/photos/377/original/E212I01.png" width="800" height="315" alt="La p&aacute;gina vuelve a funcionar."/>
</div>

<p>A&uacute;n podemos llevar un poco m&aacute;s lejos la refactorizaci&oacute;n en el modelo <code>Product</code>. El delegador din&aacute;mico no expresa su intenci&oacute;n con mucha claridad por lo que podr&iacute;amos escribir un m&eacute;todo en la clase <code>Product</code> llamado <code>scope_builder</code> en el que crear el <code>DynamicDelegator</code>.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  belongs_to :category
  
  def self.search(params)
    products = scope_builder
    products.where(&quot;name like ?&quot;, &quot;%&quot; + params[:name] + &quot;%&quot;) if params[:name]
    products.where(&quot;price &gt;= ?&quot;, params[:price_gt]) if params[:price_gt]
    products.where(&quot;price &lt;= ?&quot;, params[:price_lt]) if params[:price_lt]    
    products
  end 
  
  def self.scope_builder
    DynamicDelegator.new(scoped)
  end

end
</pre>

<p>Ahora queda mucho m&aacute;s claro que estamos trabajando con un &aacute;mbito que estamos construyendo din&aacute;micamente.  Si usamos esta t&eacute;cnica en varios modelos podr&iacute;amos mover el m&eacute;todo  <code>scope_builder</code> a <code>ActiveRecord::Base</code> para que est&eacute; disponible en todos los modelos.  Esto lo podr&iacute;amos hacer en un archivo de inicializaci&oacute;n.</p>

<p>Esto es todo por este episodio.  Esta t&eacute;cnica pueda parecer muy simple pero si estamos construyendo muchas consultas puede hacer que nuestro c&oacute;digo quede mucho m&aacute;s limpio.</p>