<p>En este episodio vamos a trabajar con una aplicaci&oacute;n Rails sencillita  llamada  &ldquo;Lista de la Compra&rdquo;, que almacena una serie de elementos.  Para usarla tan s&oacute;lo tenemos que teclear el nombre del &iacute;tem y pulsar en el bot&oacute;n &ldquo;Add Item&rdquo;.  A continuaci&oacute;n la p&aacute;gina se recargar&aacute; y mostrar&aacute; el elemento reci&eacute;n a&ntilde;adido en la lista.</p>

<div class="imageWrapper">
  <img src="/system/photos/541/original/E247I01.png" width="800" height="289" alt="La aplicación de lista de la compra."/>
</div>

<p>Si bien la aplicaci&oacute;n funciona correctamente cuando estamos conectados a la red, si la utilizamos en un tel&eacute;fono m&oacute;vil no siempre tendremos cobertura y por tanto no podremos acceder a la lista de la compra.  Ser&iacute;a &uacute;til que la aplicaci&oacute;n funcionase sin conexi&oacute;n, y esto es lo que aprenderemos en este episodio.</p>

<h3>Introducci&oacute;n al manifiesto de cach&eacute;</h3>

<p>Demostraremos nuestra aplicaci&oacute;n en un navegador de escritorio pero por lo general s&oacute;lo querremos que est&eacute; disponible sin conexi&oacute;n la versi&oacute;n m&oacute;vil del sitio.  Ya vimos en el episodio 199  [<a href="http://railscasts.com/episodes/199-mobile-devices">verlo</a>, <a href="http://es.asciicasts.com/episodes/199-dispositivos-moviles">leerlo</a>] c&oacute;mo hacer una versi&oacute;n espec&iacute;fica para dispositivos m&oacute;viles.  Si seguimos este enfoque conseguiremos que la versi&oacute;n m&oacute;vil sea m&aacute;s sencilla, y eso har&aacute; que sea m&aacute;s f&aacute;cil hacer que est&eacute; disponible sin conexi&oacute;n.</p>

<p>Para que la aplicaci&oacute;n funcione sin conexi&oacute;n a la red utilizaremos una t&eacute;cnica de HTML5 basada en el manifiesto de cach&eacute;.  El sitio   <a href="http://diveintohtml5.org/">Dive Into HTML5</a>, que es una de las mejores fuentes de informaci&oacute;n sobre HTML5, tiene una p&aacute;gina dedicada a las <a href="http://diveintohtml5.org/offline.html">aplicaciones sin conexi&oacute;n (en ingl&eacute;s)</a> que merece la pena leer para ponernos al d&iacute;a en este tema.</p>

<p>Lo primero es crear un <a href="http://diveintohtml5.org/offline.html#manifest">manifiesto de cach&eacute;</a>, y existe una gema llamada <a href="https://github.com/wycats/rack-offline">rack-offline</a> que nos puede ser de ayuda.  La forma m&aacute;s f&aacute;cil de usarla es a&ntilde;adir la siguiente ruta a nuestra aplicaci&oacute;n.</p>

<pre class="ruby">match &quot;/application.manifest&quot; =&gt; Rails::Offline</pre>

<p>La ruta apunta a una aplicaci&oacute;n Rack llamada <code>Rails::Offline</code>.  Si se visita <code>/application.manifest</code> se generar&aacute; el manifiesto de cach&eacute; con ciertos valores por defecto.  Por supuesto tenemos que a&ntilde;adir una referencia a esta gema en el fichero <code>Gemfile</code> de nuestra aplicaci&oacute;n, y luego ejecutar la orden <code>bundle</code> para asegurar su instalaci&oacute;n.</p>

<p class="codeFilePat">/Gemfile</p>
<pre class="ruby">gem &#x27;rack-offline&#x27;</pre>

<p>A continuaci&oacute;n a&ntilde;adiremos la ruta a <code>application.manifest</code>.</p>


<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">match &quot;/application.manifest&quot; =&gt; Rails::Offline</pre>

<p>Si visitamos con el navegador <a href="http://localhost:3000/application.manifest"><code>http://localhost:3000/application.manifest</code></a> veremos que nos devuelve un fichero de manifiesto de cach&eacute;.  Dicho fichero contiene una lista de los archivos que deben ser descargados para que la aplicaci&oacute;n pueda funcionar sin conexi&oacute;n.  La gema rack-offline a&ntilde;adir&aacute;, por defecto, todos los archivos HTML, CSS y JavaScript del directorio <code>/public</code>.  Esto s&oacute;lo funcionar&aacute; con aplicaciones peque&ntilde;as pero se puede personalizar para elegir los archivos que se tendr&aacute;n que incluir en el manifiesto, se describen los detalles para hacerlo en la  <a href="https://github.com/wycats/rack-offline#readme">documentacion de rack-offline</a>.</p>

<div class="imageWrapper">
  <img src="/system/photos/542/original/E247I02.png" width="800" height="286" alt="El contenido del manifiesto de caché."/>
</div>

<p>N&oacute;tese que hay una suma de control al comienzo del manifiesto.  Con esto Rack-offline puede identificar revisiones espec&iacute;ficas del manifiesto de cach&eacute;.  Mientras la aplicaci&oacute;n est&eacute; en modo de desarrollo la suma cambiar&aacute; cada vez que carguemos la p&aacute;gina, pero en producci&oacute;n s&oacute;lo cambiar&aacute; cuando uno de los archivos listados en el manifiesto cambie lo que indica al navegador que debe descargar otra vez los archivos.</p>

<p>Aunque ya tenemos un manifiesto de cach&eacute; todav&iacute;a tenemos que decirle a la aplicaci&oacute;n que lo utilice.  Esto se hace poniendo el atributo <code>manifest</code>  a la etiqueta HTML del fichero de <em>layout</em> de la aplicaci&oacute;n.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="javascript">&lt;html manifest=&quot;/application.manifest&quot;&gt;</pre>

<p>El atributo <code>manifest</code> hace que se descarguen los archivos enumerados en el manifiesto de cach&eacute; cada vez que alguien cargue una p&aacute;gina de esta aplicaci&oacute;n, as&iacute; como la propia p&aacute;gina de forma que est&eacute; disponible cuando no exista conexi&oacute;n.</p>

<p>Si ahora visitamos la p&aacute;gina del listado de nuestra aplicaci&oacute;n se descargar&aacute;n todos los ficheros anotados en el manifiesto, as&iacute; como la propia p&aacute;gina que contiene el listado.  Esto se puede comprobar visitando la p&aacute;gina y luego parando el servidor Rails de la aplicaci&oacute;n.  Si despu&eacute;s abrimos una ventana del navegador y visitamos   <a href="http://localhost:3000/items"><code>http://localhost:3000/items</code></a> veremos que la p&aacute;gina sigue ah&iacute; incluso con el servidor parado, porque est&aacute; siendo servida desde la cach&eacute;.</p>

<p>Pero todav&iacute;a tenemos un problema.  Si recargamos la p&aacute;gina veremos que se pierde la hoja de estilos.</p>

<div class="imageWrapper">
  <img src="/system/photos/543/original/E247I03.png" width="800" height="286" alt="Al refrescar la página se pierden los estilos."/>
</div>

<p>De hecho el navegador no est&aacute; logrando cargar las hojas de estilos ni ninguno de los ficheros JavaScript de la aplicaci&oacute;n.  El motivo son los sellos de tiempo que Rails a&ntilde;ade a la URL de estos archivos.</p>

<div class="imageWrapper">
  <img src="/system/photos/544/original/E247I04.png" width="801" height="203" alt="El navegador intenta descargar los archivos del servidor."/>
</div>

<p>Estos sellos hacen que el navegador considere que los archivos son distintos de los que han sido declarados en el manifiesto de cach&eacute;, y por tanto los intenta cargar de nuevo del servidor.  Se puede solucionar este problema configurando una variable de entorno que elimina los sellos de tiempo en nuestra aplicaci&oacute;n a&ntilde;adiendo la siguiente l&iacute;nea debajo de  <code>/config/application.rb</code>.</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">ENV[&quot;RAILS_ASSET_ID&quot;] = &quot;&quot;</pre>

<p>Para que esto funcione tenemos que volver a arrancar el servidor y visitar otra vez la p&aacute;gina, recarg&aacute;ndola una o dos veces para asegurarnos de que todo ha sido cargado y cacheado correctamente.  Una vez hecho esto podremos parar de nuevo el servidor y veremos que la aplicaci&oacute;n funcionar&aacute; correctamente sin conexi&oacute;n, carg&aacute;ndose correctamente los ficheros CSS y JavaScript, dado que no tendr&aacute;n sellos de tiempo tras los nombres.</p> 

<h3>Problemas con la cach&eacute;</h3>

<p>Durante lo que queda de episodio tendremos el servidor arrancado para simular que estamos navegando con conexi&oacute;n y as&iacute; ver algunos problemas potenciales.  Lo primero de lo que nos daremos cuenta es de que los cambios que hacemos en nuestra aplicaci&oacute;n no surten efecto inmediatamente.  Por ejemplo, supongamos que queremos cambiar el texto en el bot&oacute;n  &ldquo;Add Item&rdquo; para que sea  &ldquo;Add&rdquo;. Se trata de un cambio f&aacute;cil, tan s&oacute;lo tenemos que cambiar el texto en el c&oacute;digo de la vista.</p>

<p class="codeFilePath">/app/views/items/index.html.erb</p>
<pre class="ruby">&lt;%= form_for Item.new do |f| %&gt;
 &lt;%= f.text_field :name %&gt;
 &lt;%= f.submit &quot;Add&quot; %&gt;
&lt;% end %&gt;</pre>

<p>Al guardar este archivo y recargar la p&aacute;gina esperar&iacute;amos que el texto del bot&oacute;n cambiase, pero no lo hace.  El motivo es que el navegador devuelve la versi&oacute;n cacheada de la p&aacute;gina: no pregunta si el servidor est&aacute; levantado sino que devuelve de inmediato lo que tiene en cach&eacute;.  Sin embargo en segundo plano comprobar&aacute; el manifiesto de cach&eacute; para ver si ha habido cambios y entonces s&iacute; que descargar&aacute; los ficheros modificados.  Si luego volvemos a cargar la p&aacute;gina por segunda vez veremos que el texto del bot&oacute;n s&iacute; que cambia porque para entonces el navegador ya habr&aacute; detectado los cambios y los habr&aacute; cacheado.</p>

<div class="imageWrapper">
  <img src="/system/photos/545/original/E247I05.png" width="800" height="286" alt="Al no tener los sellos de tiempo los ficheros cacheados siempre se sirven desde la caché."/>
</div>

<p>Esto quiere decir que para que los cambios hagan efecto en desarrollo debemos acostumbrarnos a recargar la p&aacute;gina un par de veces cada vez que hagamos un cambio.</p>

<p>Se puede presentar otro problema cuando la cach&eacute; apunte a un fichero que ya no existe o que tiene otro nombre.  Por ejemplo si elimin&aacute;semos el archivo <code>422.html</code> del directorio <code>/public/</code> el manifiesto dejar&iacute;a de servir.  Para demostrarlo, cambiemos otra vez el texto del bot&oacute;n para que sea  &ldquo;Add Another Item&rdquo;.</p>

<p class="codeFilePath">/app/views/items/index.html.erb</p>
<pre class="ruby">&lt;%= form_for Item.new do |f| %&gt;
 &lt;%= f.text_field :name %&gt;
 &lt;%= f.submit &quot;Add Another Item&quot; %&gt;
&lt;% end %&gt;</pre>

<p>Ya podemos recargar la p&aacute;gina todas las veces que queramos que el texto del bot&oacute;n no cambiar&aacute;, porque el manifiesto aborta al llegar al fichero <code>422.html</code> que hemos eliminado, por lo que nunca actualiza la cach&eacute; de la p&aacute;gina de lista de la compra.  No veremos los cambios nunca incluso aunque el servidor contin&uacute;e activo.</p>

<p>Es dif&iacute;cil depurar este tipo de problemas porque no hay ning&uacute;n s&iacute;ntoma de que se ha producido este error con el manifiesto de cach&eacute;.  Para ayudarnos con esto podemos a&ntilde;adir c&oacute;digo JavaScript que est&eacute; pendiente del evento de error en el objeto <code>applicationCache</code> y detecte cuando se produzcan estos errores.</p>

<p>Como en la aplicaci&oacute;n estamos usando jQuery podemos a&ntilde;adir esta detecci&oacute;n de errores con el siguiente c&oacute;digo en nuestro fichero <code>application.js</code>.</p>


<p class="codeFilePath">/public/javascripts/application.js</p>
<pre class="javascript">$(function () {
  $(windows.applicationCache.bind(&#x27;error&#x27;, function () {
    alert(&#x27;There was an error when loading the cache manifest.&#x27;);
  }))
})</pre>

<p>Esta alerta no funcionar&aacute; con la aplicaci&oacute;n en el estado en que est&aacute; porque al tener el manifiesto roto no recargar&aacute; el nuevo fichero <code>application.js</code> pero la alerta de JavaScript saltar&aacute; la pr&oacute;xima vez que tengamos un problema parecido, y as&iacute; sabremos que hay algo mal.</p>

<p>Para arreglar ahora el manifiesto de cach&eacute; tan s&oacute;lo tenemos que reiniciar el servidor web para que el fichero del manifiesto se actualice autom&aacute;ticamente.  Con esto volver&aacute; el comportamiento anterior de la aplicaci&oacute;n y cuando hagamos cambios siempre los veremos tras recargar un par de veces la p&aacute;gina.</p>

<p>La cach&eacute; de contenidos puede presentar problemas que s&oacute;lo detectaremos en producci&oacute;n.  Si a&ntilde;adimos un elemento a la lista de la compra el nuevo elemento ser&aacute; a&ntilde;adido a la base de datos.  La p&aacute;gina de la lista se actualiza din&aacute;micamente desde la base de datos y veremos que aparecen todos los elementos.  En modo de desarrollo todo parece funcionar: el elemento se a&ntilde;ade a la lista y sigue ah&iacute; cuando recargamos la p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="/system/photos/546/original/E247I06.png" width="802" height="306" alt="Podemos añadir elementos a la lista."/>
</div>

<p>Pero &iquest;y si intentamos hacer esto en producci&oacute;n?  Para simularlo haremos que <code>cache_classes</code> sea <code>true</code> en <code>development.rb</code> (si usamos las t&eacute;cnicas de este cap&iacute;tulo en nuestras aplicaciones tendremos que probar exhaustivamente en modo de producci&oacute;n)</p>

<p class="codeFilePath">/config/development.rb</p>
<pre class="ruby">config.cache_classes = true</pre>

<p>Tenemos que reiniciar el servidor para que coja este cambio.  Una vez que lo tengamos, a&ntilde;adiremos otro elemento a la lista, por ejemplo  &ldquo;chunky bacon&rdquo;.</p>

<div class="imageWrapper">
  <img src="/system/photos/547/original/E247I07.png" width="802" height="311" alt="En producción parece que también podemos añadir elementos."/>
</div>

<p>El elemento que acabamos de a&ntilde;adir aparece porque acabamos de hacer una petici&oacute;n POST pero desaparecer&aacute; si recargamos la p&aacute;gina: se vuelve a mostrar la versi&oacute;n antigua cacheada de la p&aacute;gina, nuevamente por culpa del manifiesto de cach&eacute;.  Ahora que tenemos la aplicaci&oacute;n en producci&oacute;n el manifiesto no cambia, por lo que el navegador desconoce que la p&aacute;gina ha sido modificada y vuelve a servir la versi&oacute;n antigua.  Este problema s&oacute;lo ocurre en producci&oacute;n, no en desarrollo.</p>

<p>La cuesti&oacute;n clave es: &iquest;c&oacute;mo controlamos los contenidos din&aacute;micos?  Es un tema m&aacute;s complejo de lo que podr&iacute;a parecer en un principio, el servidor no puede actualizar din&aacute;micamente la p&aacute;gina porque se encuentra cacheada por el navegador.  Lo que podemos hacer es actualizar su contenido por JavaScript, y esto es lo que haremos en el siguiente episodio.</p>

