<p>&#x56DE;&#x987E;&#x7B2C;27&#x96C6;[<a href="http://railscasts.com/episodes/27-cross-site-scripting">&#x89C2;&#x770B;</a>, <a href="http://asciicasts.com/episodes/27-cross-site-scripting">&#x9605;&#x8BFB;</a>]&#xFF0C;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x653B;&#x51FB;&#x3002;&#x8FD9;&#x662F;&#x6BCF;&#x4E2A;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x8BE5;&#x638C;&#x63E1;&#x7684;&#x4E00;&#x95E8;&#x91CD;&#x8981;&#x8BFE;&#x7A0B;&#x3002;&#x5728;web&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x5F53;&#x7F51;&#x9875;&#x663E;&#x793A;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x65F6;&#x6613;&#x53D7;&#x5230;xss&#x653B;&#x51FB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8F6C;&#x4E49;&#x7528;&#x6237;&#x81EA;&#x884C;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5728;Rails&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;<code>h</code>&#x65B9;&#x6CD5;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>

<pre class="ruby">
&lt;%= h comment.content %&gt;
</pre>
<p class="title">&#x4F7F;&#x7528;h&#x65B9;&#x6CD5;&#x8F6C;&#x4E49;&#x8F93;&#x51FA;</p>

<p>&#x5728;Rails 3&#x4E2D;&#xFF0C;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x65E0;&#x9700;&#x5728;&#x4F60;&#x7684;&#x89C6;&#x56FE;&#x4E2D;&#x518D;&#x52A0;&#x5165;<code>h</code>&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6B64;&#x96C6;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5411;&#x4F60;&#x5C55;&#x793A;Rails3&#x5982;&#x4F55;&#x5904;&#x7406;&#x8F93;&#x51FA;&#x8F6C;&#x4E49;&#x3002;</p>

<p>&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x8F93;&#x51FA;&#x8F6C;&#x4E49;&#x673A;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7528;Rails 3 &#x7F16;&#x5199;&#x7684;&#x7B80;&#x5355;&#x7684;&#x535A;&#x5BA2;&#x5E94;&#x7528;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x7684;&#x8BC4;&#x8BBA;&#x3002;&#x4E3A;&#x6D4B;&#x8BD5;&#x8BC4;&#x8BBA;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x653B;&#x51FB;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8BC4;&#x8BBA;&#x8868;&#x5355;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x4E2D;&#x90FD;&#x8F93;&#x5165;<code>&lt;script&gt;alert(&#x27;I steal cookies!&#x27;)&lt;/script&gt;</code>&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4EA4;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x6076;&#x610F;&#x7684;&#x8BC4;&#x8BBA;&#x3002;</p>

<div class="imageWrapper">
  <img width="815" height="527" alt="Entering an evil comment." src="/system/photos/338/original/E204I01.png" />
</div>

<p>&#x5F53;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x7684;&#x8FD9;&#x4E2A;&#x8BC4;&#x8BBA;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x663E;&#x793A;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;Rails 3&#x5DF2;&#x7ECF;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#x4E86;&#x4E0A;&#x8FF0;&#x6211;&#x4EEC;&#x6240;&#x63D0;&#x4EA4;&#x7684;&#x5B57;&#x6BB5;&#x4E2D;&#x7684;HTML&#x6807;&#x7B7E;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x770B;Rails&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x7684;&#x3002;</p>

<div class="imageWrapper">
  <img width="815" height="331" alt="The HTML comments are automatically escaped." src="/system/photos/339/original/E204I02.png"/>
</div>

<p>&#x663E;&#x793A;&#x6BCF;&#x6761;&#x8BC4;&#x8BBA;&#x7684;&#x4EE3;&#x7801;&#x88AB;&#x5305;&#x542B;&#x5728;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x6A21;&#x677F;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#x4F7F;&#x7528;&#x4E86;<code>h</code>&#x8F6C;&#x4E49;&#x3002;</p>

<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to comment.name, comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>
<p>&#x5728;Rails2&#x4E2D;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5C06;&#x4F1A;&#x663E;&#x793A;alert&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x6709;&#x5728;&#x5C40;&#x90E8;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#x90FD;&#x4F1A;&#x88AB;Rails 
3&#x6B63;&#x786E;&#x7684;&#x8F6C;&#x4E49;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x901A;&#x8FC7;&#x4E86;&#x8BF8;&#x5982;link_to&#x4E4B;&#x7C7B;&#x7684;helper&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x9700;&#x4F7F;&#x7528;<code>h</code>&#x65B9;&#x6CD5;&#x3002;</p>

<p>&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x8F6C;&#x6362;&#x4E00;&#x4E2A;Rails 2&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#x90FD;&#x4F7F;&#x7528;&#x4E86;<code>h</code>&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x901A;&#x8FC7;&#x8F6C;&#x4E49;&#x524D;&#x8FF0;&#x5C40;&#x90E8;&#x6A21;&#x677F;&#x7684;&#x8F93;&#x51FA;&#x5E76;&#x91CD;&#x8F7D;&#x8BE5;&#x9875;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x627E;&#x51FA;&#x7B54;&#x6848;&#x3002;</p>

<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to h(comment.name), comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= h comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>&#x5F53;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x88C5;&#x8F7D;&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x9875;&#x9762;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x4E0A;&#x6B21;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8F93;&#x51FA;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x91CD;&#x590D;&#x8F6C;&#x4E49;&#x3002;Rails&#x5F88;&#x806A;&#x660E;&#xFF1B;&#x5373;&#x4FBF;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;<code>h</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4E5F;&#x53EA;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x811A;&#x672C;&#x6807;&#x7B7E;&#x7684;&#x8F6C;&#x4E49;&#x3002;</p>

<p>&#x770B;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;<code>h</code>&#x65B9;&#x6CD5;&#x5728;Rails 3&#x4E2D;&#x6CA1;&#x4EC0;&#x4E48;&#x7528; 
&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5B83;&#x4ECD;&#x7136;&#x6709;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#xFF0C;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x5411;&#x4F60;&#x6F14;&#x793A;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x76F8;&#x5173;&#x7279;&#x6027;&#x3002;&#x4E5F;&#x8BB8;&#x6709;&#x65F6;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x663E;&#x793A;&#x539F;&#x59CB;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x80FD;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#x8F93;&#x51FA;&#x662F;&#x5F88;&#x597D;&#x7684;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4FE1;&#x4EFB;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4ED6;&#x4EEC;&#x662F;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x60F3;&#x7CBE;&#x786E;&#x7684;&#x663E;&#x793A;&#x4ED6;&#x4EEC;&#x8F93;&#x5165;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B0;&#x7684;<code>raw</code>&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>

<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to comment.name, comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= raw comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x8F7D;&#x5165;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8BC4;&#x8BBA;&#x680F;&#x8F93;&#x5165;&#x7684;JavaScript&#x5C31;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x3002;</p>

<div class="imageWrapper">
  <img width="819" height="332" alt="Using the raw method means that the alert is shown." src="/system/photos/340/original/E204I03.png"/>
</div>

<p>&#x6240;&#x4EE5;&#xFF0C;&#x5728;Rails3&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x5185;&#x5BB9;&#x88AB;HTML&#x8F6C;&#x4E49;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>raw</code>&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF1F;&#x5728;&#x4F55;&#x65F6;&#x8F6C;&#x4E49;&#x5185;&#x5BB9;&#x548C;&#x4F55;&#x65F6;&#x4E0D;&#x8F6C;&#x4E49;&#x5185;&#x5BB9;&#x65B9;&#x9762;&#xFF0C;Rails3&#x770B;&#x8D77;&#x6765;&#x76F8;&#x5F53;&#x7684;&#x806A;&#x660E;&#x3002;&#x73B0;&#x5728;&#x6211;&#x5C55;&#x793A;&#x7ED9;&#x4F60;&#x4EEC;&#x770B;&#x5B83;&#x662F;&#x600E;&#x6837;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5C06;&#x5728;console&#x4E2D;&#x6F14;&#x793A;&#x8F6C;&#x4E49;&#x529F;&#x80FD;&#xFF0C;&#x5728;Rails 3&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>rails c</code> &#x547D;&#x4EE4;&#x6765;&#x5524;&#x51FA;&#x5B83;&#x3002;</p>

<pre class="terminal">
$ rails c
Loading development environment (Rails 3.0.0.beta)
ruby-1.9.1-p378 &gt;
</pre>

<p>Rails 3 &#x5F15;&#x5165;&#x4E86;HTML&#x5B89;&#x5168;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x65B0;&#x7684;<code>html_safe?</code>&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x67E5;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;HTML&#x8F93;&#x51FA;&#x662F;&#x5426;&#x5B89;&#x5168;&#x3002;</p>

<pre class="terminal">&gt; &quot;foo&quot;.html_safe?
 =&gt; false 
</pre>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>html_safe</code>&#x65B9;&#x6CD5;&#x6765;&#x6807;&#x8BB0;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x662F;HTML&#x5B89;&#x5168;&#x7684;&#x3002;</p>

<pre class="terminal">&gt; safe = &quot;safe&quot;.html_safe
 =&gt; &quot;safe&quot; 
&gt; safe.html_safe?
 =&gt; true 
</pre> 

<p>&#x8FD9;&#x91CC;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#x3002;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4E00;&#x5207;&#x53EA;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x5C5E;&#x6027;&#x6765;&#x6307;&#x793A;&#x5B83;&#x5728;&#x8F93;&#x51FA;&#x524D;&#x662F;&#x5426;&#x8981;&#x88AB;&#x8F6C;&#x4E49;&#x3002;</p>

<p>&#x90A3;&#x4E48;&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x56FE;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x5462;&#x3002;Rails&#x4F1A;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x770B;&#x5B83;&#x662F;&#x5426;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;HTML&#x5B89;&#x5168;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5728;&#x8F93;&#x51FA;&#x5230;&#x9875;&#x9762;&#x65F6;&#x5B83;&#x5C06;&#x88AB;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5B83;&#x5C06;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x800C;&#x4E0D;&#x4F1A;&#x88AB;&#x8F6C;&#x4E49;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>h</code>&#x65B9;&#x6CD5;&#x6765;&#x8F6C;&#x4E49;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x5C06;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x8F6C;&#x4E49;&#x52A8;&#x4F5C;&#xFF0C;&#x540C;&#x65F6;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;HTML&#x5B89;&#x5168;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;Rails 3&#x5C06;&#x4F1A;&#x8BA4;&#x4E3A;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5B89;&#x5168;&#x7684;&#x800C;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x8F6C;&#x4E49;&#x5B83;&#x3002;</p>

<p>&#x5F53;&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E0A;&#x4F7F;&#x7528;<code>raw</code>&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;HTML&#x5B89;&#x5168;&#x7684;&#x4F46;&#x4E0D;&#x88AB;&#x8F6C;&#x4E49;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x4FDD;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x4E0D;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x4F20;&#x9012;&#x5230;&#x8F93;&#x51FA;&#x3002;</p> 

<p>&#x5F53;&#x4F60;&#x4F7F;&#x7528;helper&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x53EB;<code>strong</code>&#x7684;helper&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x5C06;&#x4EFB;&#x4F55;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x7684;&#x4E1C;&#x897F;&#x5305;&#x88C5;&#x5728; <code>&lt;strong&gt;</code>&#x6807;&#x7B7E;&#x91CC;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x6A21;&#x677F;&#x4E2D;&#x50CF;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x5B83;&#xFF1A;</p>

<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;%= strong link_to(comment.name, comment.url) %&gt;
  &lt;p&gt;&lt;%= raw comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>&#x6211;&#x4EEC;&#x5728; <code>ApplicationHelper</code> &#x4E2D;&#x521B;&#x5EFA;&#x4E86;<code>strong</code>&#x65B9;&#x6CD5;:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby" >
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{content}&lt;/strong&gt;&quot;
  end
end
</pre>

<p>&#x5F53;&#x91CD;&#x8F7D;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x9884;&#x60F3;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;</p>

<div class="imageWrapper">
  <img width="815" height="552" alt="The strong tag in our helper method is escaped." src="/system/photos/341/original/E204I04.png"/>
</div>

<p>Rails 3&#x7684;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#x673A;&#x5236;&#x4F1A;&#x8F6C;&#x4E49;&#x6389;<code>&lt;strong&gt;</code>&#x6807;&#x7B7E;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8F85;&#x52A9;&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;HTML&#x5B89;&#x5168;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>

<p>&#x5F53;&#x4F7F;&#x7528;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x662F;HTML&#x4EE3;&#x7801;&#x7684;&#x8F85;&#x52A9;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9075;&#x5FAA;&#x4E24;&#x6761;&#x7B80;&#x5355;&#x7684;&#x539F;&#x5219;&#x3002;&#x7B2C;&#x4E00;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x4EFB;&#x4F55;&#x8FD4;&#x56DE;&#x5B57;&#x7B26;&#x4E32;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;HTML&#x5B89;&#x5168;&#x7684;&#x3002;</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{content}&lt;/strong&gt;&quot;.html_safe
  end
end
</pre>

<p>&#x8FD9;&#x4FEE;&#x6B63;&#x4E86; <code>&lt;strong&gt;</code>&#x6807;&#x7B7E;&#x88AB;&#x8F6C;&#x4E49;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x8FD9;&#x4E48;&#x505A;&#x4F1A;&#x5BFC;&#x81F4;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#x5185;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x88AB;&#x8F6C;&#x4E49;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7528;<code>h</code>&#x65B9;&#x6CD5;&#x8F6C;&#x4E49;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby" style="display: none;">
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{h(content)}&lt;/strong&gt;&quot;.html_safe
  end
end
</pre>

<p>&#x6240;&#x4EE5;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x8BB0;&#x5F97;&#x4F7F;&#x7528;<code>h</code>&#x65B9;&#x6CD5;&#x6765;&#x8F6C;&#x4E49;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x7ED3;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x6807;&#x8BB0;&#x4E3A;<code>html_safe</code>&#x7684;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x6B63;&#x786E;&#x7684;&#x5448;&#x73B0;&#x3002;&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x91CD;&#x8F7D;&#x8BC4;&#x8BBA;&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;<code>&lt;strong&gt;</code>&#x6807;&#x7B7E;&#x6CA1;&#x6709;&#x88AB;&#x8F6C;&#x4E49;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x6761;&#x8BC4;&#x8BBA;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x6709;&#x6F5C;&#x5728;&#x5371;&#x9669;&#x7684;JavaScript&#x7684;&#x5185;&#x5BB9;&#x88AB;&#x8F6C;&#x4E49;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
  <img width="815" height="552" alt="The helper method is now escaped correctly." src="/system/photos/342/original/E204I05.png"/>
</div>

<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x672C;&#x96C6;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x81EA;&#x52A8;&#x8F6C;&#x4E49;&#x673A;&#x5236;&#x662F;Rails 3&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5E7F;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x589E;&#x5F3A;&#x3002;&#x5B83;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7528;<code>h</code>h&#x6765;&#x8F6C;&#x4E49;&#x6BCF;&#x4E00;&#x5904;&#x8F93;&#x51FA;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x51CF;&#x5C11;&#x4E86;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x6210;&#x4E3A;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x653B;&#x51FB;&#x7684;&#x53D7;&#x5BB3;&#x8005;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>