<p>En el episodio 27 [<a href="http://railscasts.com/episodes/27-cross-site-scripting">verlo</a>, <a href="http://asciicasts.com/episodes/27-cross-site-scripting">leerlo</a>] trat&aacute;bamos acerca del <em>cross-site scripting</em> (XSS), que es una importante cuesti&oacute;n para cualquier desarrollador web.  Uno de los momentos en los que las aplicaciones web son vulnerables a ataques XSS es cuando muestran informaci&oacute;n introducida por los usuarios.  Es muy importante, por tanto, escapar toda esta informaci&oacute;n, lo que en Rails se hace por lo general con el m&eacute;todo <code>h</code>.</p>

<pre class="ruby">
&lt;%= h comment.content %&gt;
</pre>
<p class="title">Uso del m&eacute;todo h para escapar la salida.</p>

<p>Sin embargo en Rails 3 la salida de nuestra aplicaci&oacute;n es escapada autom&aacute;ticamente de forma que no hay que poner el m&eacute;todo <code>h</code> en nuestras vistas.  En este episodio veremos como gestiona Rails este escapado autom&aacute;tico.</p>

<p>Para ver como funciona todo esto vamos a utilizar una aplicaci&oacute;n sencilla de <em>blog</em> escrita con Rails 3.  En esta aplicaci&oacute;n tendremos art&iacute;culos y cada art&iacute;culo puede tener un n&uacute;mero de comentarios asociados.  Vamos a comprobar la reacci&oacute;n del sistema de comentarios ante un intento de XSS introduciendo   <code>&lt;script&gt;alert(&#x27;I steal cookies!&#x27;)&lt;/script&gt;</code> en cada campo del formulario de comentarios y enviando este malvado comentario.</p>

<div class="imageWrapper">
  <img src="/system/photos/338/original/E204I01.png" alt="Introduciendo un comentario malvado." height="527" width="815" />
</div>

<p>Cuando enviamos este comentario y se visualiza en la p&aacute;gina veremos que Rails 3 autom&aacute;ticamente ha escapado las etiquetas HTML en los campos que hemos enviado.  Veamos c&oacute;mo lo ha hecho.</p>

<div class="imageWrapper">
  <img src="/system/photos/339/original/E204I02.png" alt="Los comentarios en HTML se escapan autom&aacute;ticamente." height="331" width="815" />
</div>

<p>El c&oacute;digo que muestra cada comentario se encuentra en un parcial, y si examinamos dicho c&oacute;digo veremos que la salida no est&aacute; siendo protegida utilizando <code>h</code>.</p>


<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to comment.name, comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>Esto quiere decir que con este c&oacute;digo de vista  en Rails 2 los mensajes de alerta se habr&iacute;an mostrado.  En Rails 3 toda la salida del parcial es escapada incluso a trav&eacute;s de <em>helpers</em> como <code>link_to</code> as&iacute; que ya no hay que utilizar el m&eacute;todo <code>h</code>.</p>

<p>&iquest;Qu&eacute; ocurre si, por ejemplo, estamos migrando una aplicaci&oacute;n de Rails 2 y nuestras vistas s&iacute; que est&aacute;n utilizando el m&eacute;todo <code>h</code>? Podemos averiguarlo haciendo ese cambio en el parcial anterior y recargando la p&aacute;gina.</p>

<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to h(comment.name), comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= h comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>Si recargamos la p&aacute;gina veremos que tiene el mismo aspecto y que la salida no ha sido escapada por partida doble.  Rails es inteligente aqu&iacute;, a&uacute;n si usamos el m&eacute;todo <code>h</code>.</p>

<p> Podr&iacute;amos pensar a la vista de esto que el m&eacute;todo <code>h</code> es inocuo en Rails 3, pero no es as&iacute;; m&aacute;s adelante veremos cu&aacute;l es su prop&oacute;sito pero de momento veamos una funcionalidad relacionada.  Si bien es muy interesante tener la salida escapada autom&aacute;ticamente puede ser que a veces queramos mostrar el contenido en bruto: si confiamos en el contenido que ha introducido el usuario (por ejemplo
se trata de un usuario administrador) y queremos mostrar exactamente lo que ha introducido podemos utilizar el nuevo m&eacute;todo <code>raw</code>.</p>

<pre class="ruby">
&lt;div class=&quot;comment&quot;&gt;
  &lt;strong&gt;&lt;%= link_to comment.name, comment.url %&gt;&lt;/strong&gt;
  &lt;p&gt;&lt;%= raw comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>Si recargamos la p&aacute;gina esta vez s&iacute; que se ejecutar&aacute; el c&oacute;digo Javascript que hemos introducido en el comentario.</p>

<div class="imageWrapper">
  <img src="/system/photos/340/original/E204I03.png" alt="Cuando se usa el m&eacute;todo raw se muestra la alerta." height="332" width="819" />
</div>

<p>Por tanto en Rails podemos usar el m&eacute;todo <code>raw</code> cuando no queramos escapar el contenido en HTML.  &iquest;Pero c&oacute;mo funciona esto, c&oacute;mo es Rails tan inteligente como para saber cu&aacute;ndo tiene que escapar y cu&aacute;ndo no?.</p>

<p>Esto lo veremos en la consola, que en Rails 3 se invoca con el comando <code>rails c</code>.</p>

<pre class="terminal">
$ rails c
Loading development environment (Rails 3.0.0.beta)
ruby-1.9.1-p378 &gt;
</pre>

<p>Rails 3 introduce el concepto de cadenas con HTML seguro. Esto significa que podemos comprobar si es seguro mostrar una cadena como HTML invocando el m&eacute;todo <code>html_safe?</code> sobre ella.</p>

<pre class="terminal">
&gt; &quot;foo&quot;.html_safe?
 =&gt; false 
</pre>

<p>Con el m&eacute;todo <code>html_safe</code> se puede marcar una cadena como segura.</p>

<pre class="terminal">
&gt; safe = &quot;safe&quot;.html_safe
 =&gt; &quot;safe&quot; 
&gt; safe.html_safe?
 =&gt; true 
</pre> 

<p>A&uacute;n no hemos efectuado ninguna modificaci&oacute;n al contenido. Lo &uacute;nico que hacemos es cambiar  una propiedad booleana 
de la cadena que se usar&aacute; para determinar si debe ser escapada antes de ser visualizada.</p>

<p>A la hora de aplicar esto a nuestra vista, Rails examinar&aacute; cada cadena y mirar&aacute; si est&aacute; marcada como HTML seguro.  Si no lo es, ser&aacute; autom&aacute;ticamente convertida mientras que si lo es se mostrar&aacute; sin procesar.  Si se usa el m&eacute;todo <code>h</code> en una cadena, realizar&aacute; la conversi&oacute;n y la marcar&aacute; como segura, lo que significa que Rails 3 considerar&aacute; que la  cadena es segura y no la volver&aacute; a escapar.</p>

<p>Cuando se usa el m&eacute;todo <code>raw</code> en una cadena, se marcar&aacute; como segura pero su contenido seguir&aacute; intacto de forma que la cadena pasar&aacute; sin alteraci&oacute;n.</p>

<p>Es importante entender esto cuando usamos <em>helpers</em>. Como ejemplo crearemos un m&eacute;todo llamado <code>strong</code> que rodea lo que se le
pase con un par de etiquetas <code>&lt;strong&gt;</code>. En nuestra vista lo utilizaremos as&iacute;:</p>

<p class="codeFilePath">/app/views/comments/_comment.html.erb</p>
<pre class="ruby">&lt;div class=&quot;comment&quot;&gt;
  &lt;%= strong link_to(comment.name, comment.url) %&gt;
  &lt;p&gt;&lt;%= raw comment.content %&gt;&lt;/p&gt;
&lt;/div&gt;
</pre>

<p>Crearemos en <code>ApplicationHelper</code> el m&eacute;todo <code>strong</code>:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre style="display: none;" class="ruby">
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{content}&lt;/strong&gt;&quot;
  end
end
</pre>

<p>Pero veremos que este m&eacute;todo no ha funcionad como esper&aacute;bamos si recargamos la p&aacute;gina.</p>


<div class="imageWrapper">
  <img src="/system/photos/341/original/E204I04.png" alt="La etiqueta strong en nuestro m&eacute;todo ha sido escapada." height="552" width="815" />
</div>

<p>El escapado autom&aacute;tico de Rails 3 ha modificado la etiqueta <code>&lt;strong&gt;</code> porque nuestro <em>helper</em> no ha creado una cadena HTML segura.</p>

<p>S&oacute;lo hay que seguir dos reglas muy sencillas cuando definamos <em>helpers</em> que devuelvan HTML.  Primero tenemos que asegurarnos de que las cadenas que devolvamos est&eacute;n marcadas como seguras.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{content}&lt;/strong&gt;&quot;.html_safe
  end
end
</pre>

<p>Esto corrige el problema de que la etiqueta <code>&lt;strong&gt;</code> aparezca escapada pero ahora resulta que el contenido entre las etiquetas
no ser&aacute; escapado.  Para esto podemos escapar el contenido con nuestro viejo amigo el m&eacute;todo <code>h</code>:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def strong(content)
    &quot;&lt;strong&gt;#{h(content)}&lt;/strong&gt;&quot;.html_safe
  end
end
</pre>

<p>As&iacute; que para que todo se muestre correctamente tenemos que escapar cualquier contenido introducido por el usuario con
el m&eacute;todo <code>h</code> y marcar la cadena resultante como segura con <code>html_safe</code>.  Si recargamos la p&aacute;gina, ahora veremos que la etiqueta  <code>&lt;strong&gt;</code> no ha sido escapada pero el contenido del segundo comentario, que incluye el Javascript peligroso, s&iacute; que ha sido escapado.</p>

<div class="imageWrapper">
  <img src="/system/photos/342/original/E204I05.png" alt="El helper se escapa correctamente." height="552" width="815" />
</div>

<p>Y con esto termina nuestro episodio.  El escapado autom&aacute;tico es una nueva funcionalidad de Rails 3 que elimina la necesidad de tener que acordarse de escapar cualquier fragmento de salida con <code>h</code>, reduci&eacute;ndose de esta forma las posibilidades de que seamos v&iacute;ctimas de un ataque XSS.</p>