<p>En este episodio veremos refactoreo. Refactorear es mejorar el dise&ntilde;o del c&oacute;digo sin cambiar su funcionalidad. Esto puede hacerse para eliminar duplicaci&oacute;n o mejorar la lectura y mantenimiento del c&oacute;digo.</p>

<p>En esta aplicaci&oacute;n tenemos un listado de usuarios. Al hacer click en un usuario se nos muestra sus perfiles. Tengamos en cuenta que algunos usuarios tienen una letra inicial en su segundo nombre, mientras que otro no.</p>

<div class="imageWrapper">
  <img src="/system/photos/8/original/E010I01.png" title="The index and show views for the User model." alt="The index and show views for the User model." width="800" height="400"/>
</div>
<p class="title">Las vistas <code>index</code> y show en un navegador.</p>

<p>Veamos el c&oacute;digo de la vista. Primero, el c&oacute;digo de index:</p>

<pre class="ruby">
&lt;h1&gt;Users&lt;/h1&gt;  
&lt;ul&gt;  
&lt;% for user in @users %&gt;  
&lt;li&gt;  
  &lt;a href=&quot;&lt;%= user_path(user) %&gt;&quot;&gt;  
    &lt;%= user.first_name %&gt;  
    &lt;%= &quot;#{user.middle_initial}.&quot; unless user.middle_initial.nil? %&gt;  
    &lt;%= user.last_name %&gt;  
  &lt;/a&gt;  
&lt;/li&gt;  
&lt;% end %&gt;  
&lt;/ul&gt;  
</pre>
<p class="title">El c&oacute;digo de la vista index</p>

<p>El c&oacute;digo de arriba obtiene todos los usuarios y hace un bucle sobre todos sus datos. Las tres l&iacute;neas dentro del elemento &lt;a&gt;, muestran el nombre de usuario. Ahora, veamos la p&aacute;gina del perfil.</p>

<pre class="ruby">
&lt;h1&gt;Profile&lt;/h1&gt;  
&lt;p&gt;  
  Name:  
  &lt;%= @user.first_name %&gt;  
  &lt;%= &quot;#{@user.middle_initial}.&quot; unless @user.middle_initial.nil? %&gt;  
  &lt;%= @user.last_name %&gt;  
&lt;/p&gt;  
&lt;%= link_to &#x27;Users List&#x27;, users_path %&gt;
</pre>
<p class="title">El c&oacute;digo de la vista de la acci&oacute;n show.</p>

<p>La p&aacute;gina del perfil tiene las mismas tres l&iacute;neas de c&oacute;digo para mostrar el nombre de usuario como en la p&aacute;gina index. Esto, obviamente, es una duplicaci&oacute;n y un buen candidato a ser refactoreado. El c&oacute;digo para mostrar el nombre de usuario separa el nombre en tres partes. Esto es para que la letra inicial del segundo nombre tenga un punto (.) detr&aacute;s, a menos que el usuario no tenga letra inicial para su segundo nombre.</p>

<h3>&iquest; C&oacute;mo empezamos a refactorear ?</h3>

<p>Una forma de refactorear este c&oacute;digo ser&iacute;a moverlo a un m&eacute;todo helper, pero no hay HTML en el c&oacute;digo, solamente el nombre de usuario que est&aacute; relacionado al modelo <code>User</code>. El lugar ideal para colocarlo ser&iacute;a en el modelo User. Entonces, vamos a crear un m&eacute;todo en el modelo User llamado <code>full_name</code>. Vamos a empezar colocando el c&oacute;digo que se repite de las vistas index y show. Luego, colocaremos las tres partes del nombre en una variable local y devolveremos la variable local.</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base  
  def full_name  
    name = first_name + &#x27; &#x27;  
    name += &quot;#{middle_initial}. &quot; unless middle_initial.nil?  
    name += last_name   
    name  
  end  
end  
</pre>
<p class="title">El modelo User despues de agregar el m&eacute;todo full_name</p>

<p>Al mover el c&oacute;digo al modelo <code>User</code>, la variable @user no puede ser referenciada. Pero, como estamos haciendo llamadas a m&eacute;todos en el modelo <code>User</code>, podemos eliminarla.</p>

<h2>&iquest;Funciona nuestro refactoreo?</h2>

<p>Ahora que ya tenemos nuestro m&eacute;todo <code>full_name</code> podemos reemplazar el c&oacute;digo en nuestras vistas <code>index</code> y <code>show</code>. Veamos a la parte relevante de la vista <code>index</code>.</p>

<pre class="ruby">
&lt;a href=&quot;&lt;%= user_path(user) %&gt;&quot;&gt;  
  &lt;%= user.full_name %&gt;  
&lt;/a&gt; 
</pre>
<p class="title">La vista index con el m&eacute;todo full_name.</p>

<p>Hay otra forma en la que podemos mejorar el c&oacute;digo de arriba. Como ten&iacute;amos un c&oacute;digo un tanto complicado para generar el nombre de usuario, tuvimos que usar un tag HTML &lt;a&gt;, en vez de <code>link_to</code>. Ahora podremos utilizar <code>link_to</code> y simplificar, a&uacute;n mas, el c&oacute;digo de la vista.</p> 

<pre class="ruby">
&lt;%= link_to user.full_name, user_path(user) %&gt;  
</pre>
<p class="title">La vista index con link_to.</p>

<p>El c&oacute;digo del modelo <code>User</code> y sus vistas, han mejorado mucho desde que empezamos. Hemos eliminado la duplicaci&oacute;n y movimos el c&oacute;digo con el nombre del usuario, que le pertenece al modelo,  dentro del modelo <code>User</code>. Pero a&uacute;n podemos hacer mejoras, y veremos como el c&oacute;digo puede mejorar m&aacute;s en el siguiente episodio.</p>

<h2>El c&oacute;digo despu&eacute;s de refactorear.</h2>

<pre class="ruby">
class User &lt; ActiveRecord::Base  
  def full_name  
    name = first_name + &#x27; &#x27;  
      name += &quot;#{middle_initial}. &quot; unless middle_initial.nil?  
      name += last_name   
      name  
  end  
end  
</pre>
<p class="title">El modelo User luego de refactorear.</p>

<pre class="ruby">
&lt;h1&gt;Users&lt;/h1&gt;  
&lt;ul&gt;  
&lt;% for user in @users %&gt;  
    &lt;li&gt;&lt;%= link_to user.full_name %&gt;&lt;/li&gt;  
&lt;% end %&gt;  
&lt;/ul&gt; 
</pre> 
<p class="title">La vista index luego de refactorear.</p>

<pre class="ruby">
&lt;h1&gt;Profile&lt;/h1&gt;  
&lt;p&gt;Name: &lt;%= @user.full_name %&gt;&lt;/p&gt;  
&lt;%= link_to &#x27;Users List&#x27;, users_path %&gt; 
</pre> 
<p class="title">La vista show luego de refactorear.</p>