<p>Dans cet &eacute;pisode, nous allons parler de refactoring. Le refactoring (ou refactorisation en fran&ccedil;ais dans le texte) c&#x27;est am&eacute;liorer la conception du code sans modifier sa fonctionnalit&eacute;. Ca peut se faire en supprimant les duplications ou en am&eacute;liorant la lisibilit&eacute; ou la maintenabilit&eacute;.</p>
<p>Dans cette application, nous avons une liste d&#x27;utilisateurs. En cliquant sur un utilisateur, on peut voir son profil. Notez que certains utilisateurs ont une initiale dans leur nom alors que les autres n&#x27;en ont pas.</p>
<img src="/system/photos/8/original/E010I01.png" title="The index and show views for the User model." alt="The index and show views for the User model." width="800" height="400" />
<p class="title">Les vues <code>index</code> et <code>show</code> dans le navigateur.</p>
<p>Regardons le code de la vue. D&#x27;abord, le code de la vue <code>index</code> :</p>
<pre class="ruby">
&lt;h1&gt;Users&lt;/h1&gt;
&lt;ul&gt;
&lt;% for user in @users %&gt;
&lt;li&gt;
  &lt;a href=&quot;&lt;%= user_path(user) %&gt;&quot;&gt;
    &lt;%= user.first_name %&gt;
    &lt;%= &quot;#{user.middle_initial}.&quot; unless user.middle_initial.nil? %&gt;
    &lt;%= user.last_name %&gt;
  &lt;/a&gt;
&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>
<p class="title">Le code de la vue <code>index</code></p>
<p>Le code ci-dessus r&eacute;cup&egrave;re tous les utilisateurs, puis une boucle les parcourt tous. Les trois lignes avec l&#x27;&eacute;l&eacute;ment<code>&lt;a&gt;</code> affichent le nom de l&#x27;utilisateur. Maintenant, regardons la page du profil.</p>
<pre class="ruby">
&lt;h1&gt;Profile&lt;/h1&gt;
&lt;p&gt;
  Name:
  &lt;%= @user.first_name %&gt;
  &lt;%= &quot;#{@user.middle_initial}.&quot; unless @user.middle_initial.nil? %&gt;
  &lt;%= @user.last_name %&gt;
&lt;/p&gt;
&lt;%= link_to &#x27;Users List&#x27;, users_path %&gt;
</pre>
<p class="title">Le code de la vue de l&#x27;action <code>show</code></p>
<p>La page de profil a les m&ecirc;me trois lignes pour afficher le nom de l&#x27;utilisateur que la page d&#x27;index. Ceci est clairement une duplication et est un bon candidat pour du refactoring. Le code pour afficher le nom de l&#x27;utilisateur divise le nom en trois parties. Ceci est fait pour que l&#x27;initiale puisse &ecirc;tre affich&eacute;e avec un point, sauf si l&#x27;utilisateur n&#x27;a pas d&#x27;initiale.</p>

<h3>Comment commencer le refactoring ?</h3>
<p>Un moyen de refactoriser ce code serait de le d&eacute;placer dans un helper mais il n&#x27;y pas de HTML dans le code, uniquement le nom de l&#x27;utilisateur qui est li&eacute; au mod&egrave;le <code>User</code>. La place id&eacute;ale pour placer ce code serait donc dans le mod&egrave;le <code>User</code>. Cr&eacute;ons une m&eacute;thode dans le mod&egrave;le <code>User</code> nomm&eacute;e <code>full_name</code>. Nous allons commencer par d&eacute;placer le code r&eacute;p&eacute;t&eacute; des vues <code>index</code> et <code>show</code>, mettre les trois parties du nom dans une variable locale puis retourner la variable locale.</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  def full_name
    name = first_name + &#x27; &#x27;
    name += &quot;#{middle_initial}. &quot; unless middle_initial.nil?
    name += last_name
    name
  end
end
</pre>
<p class="title">Le mod&egrave;le <code>User</code> apr&egrave;s avoir ajout&eacute; la m&eacute;thode <code>full_name</code>.</p>
<p>Puisque nous avons d&eacute;plac&eacute; le code dans le mod&egrave;le <code>User</code> la variable <code>@user</code> ne peut pas &ecirc;tre r&eacute;f&eacute;renc&eacute;e. Mais, puisque nous appelons les m&eacute;thodes dans le mod&egrave;le <code>User</code>, nous pouvons tout simplement enlever cette variable.</p>

<h3>Est-ce que notre refactoring fonctionne ?</h3>
<p>Maintenant que nous avons &eacute;crit notre m&eacute;thode <code>full_name</code> nous pouvons remplacer le code dans nos m&eacute;thodes <code>index</code> et <code>show</code>. Regardons la partie concern&eacute;es de la vue <code>index</code>.</p>
<pre class="ruby">
&lt;a href=&quot;&lt;%= user_path(user) %&gt;&quot;&gt;
  &lt;%= user.full_name %&gt;
&lt;/a&gt;
</pre>
<p class="title">La vue <code>index</code> avec la m&eacute;thode <code>full_name</code>.</p>
<p>Il y a une autre fa&ccedil;on d&#x27;am&eacute;liorer le code ci-dessus. Puisque nous avions un code assez complexe pour g&eacute;n&eacute;rer le nom de l&#x27;utilisateur nous devions utiliser le tag standard HTML <code>&lt;a&gt;</code>, plut&ocirc;t que <code>link_to</code>. Maintenant, nous pouvons utiliser <code>link_to</code> et simplifier le code de la vue encore un peu plus.</p>
<pre class="ruby">&lt;%= link_to user.full_name, user_path(user) %&gt;</pre>
<p class="title">La vue <code>index</code> avec <code>link_to</code>.</p>
<p>Le code dans le mod&egrave;le <code>User</code> et sa vue sont maintenant optimis&eacute; par rapport &agrave; ce que nous avions au d&eacute;but. Nous avons supprim&eacute; la duplication et d&eacute;placer le code li&eacute; &agrave; l&#x27;utilisateur qui appartient au mod&egrave;le dans le mod&egrave;le <code>User</code>. Il y a toujours de la place pour de l&#x27;optimisation, et nous verrons comment le code peut encore &ecirc;tre am&eacute;lior&eacute; dans le prochain &eacute;pisode.</p>

<h3>Le code apr&egrave;s refactorisation</h3>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  def full_name
    name = first_name + &#x27; &#x27;
      name += &quot;#{middle_initial}. &quot; unless middle_initial.nil?
      name += last_name
      name
  end
end
</pre>
<p class="title">Le mod&egrave;le <code>User</code> apr&egrave;s refactorisation.</p>
<pre class="ruby">
&lt;h1&gt;Users&lt;/h1&gt;
&lt;ul&gt;
&lt;% for user in @users %&gt;
    &lt;li&gt;&lt;%= link_to user.full_name %&gt;&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>
<p class="title">La vue <code>index</code> apr&egrave;s refactorisation.</p>

<pre class="ruby">
&lt;h1&gt;Profile&lt;/h1&gt;
&lt;p&gt;Name: &lt;%= @user.full_name %&gt;&lt;/p&gt;
&lt;%= link_to &#x27;Users List&#x27;, users_path %&gt;
</pre>
<p class="title">La vue <code>show</code> apr&egrave;s refactorisation.</p>
