<p>Ryan Bates &agrave; demand&eacute; il y a peu, via Twitter, quelle &eacute;tait la meilleure fa&ccedil;on de g&eacute;rer les processus en arri&egrave;re-plan sur lesquels repose une application Rails pendant son d&eacute;veloppement. Plusieurs personnes ont recommand&eacute; <a href="https://github.com/ddollar/foreman">Foreman</a>. Nous allons donc vous le pr&eacute;senter dans cet &eacute;pisode.</p>

<p>Par exemple, pour utiliser l&#x27;application <a href="https://github.com/ryanb/govsgo">GoVsGo</a> de Ryan en d&eacute;veloppement, nous devons lancer un certain nombre de processus en arri&egrave;re-plan. On a par exemple besoin de Beanstalkd, processus <code>script/worker</code> et un serveur Faye. Nous devons lancer chacun d&#x27;eux chaque fois que nous voulons utiliser l&#x27;application. Il serait agr&eacute;able d&#x27;avoir une solution simple permettant de g&eacute;rer tous ces processus et c&#x27;est pour &ccedil;a que Foreman est fait.</p>

<h3>Installer et Utiliser Foreman</h3>

<p>Foreman est fournit sous forme de gem et s&#x27;installe de mani&egrave;re classique.</p>

<pre class="terminal">$ gem install foreman</pre>

<p>Foreman trouve la liste des processus &agrave; g&eacute;rer dans un fichier <code>Procfile</code> &agrave; la racine de l&#x27;application, nous devons donc le cr&eacute;er. Dans ce fichier, nous allons lister les processus que nous voulons voir g&eacute;r&eacute;s par Foreman. Chacun d&#x27;eux est d&eacute;finit par un nom, suivi par le catact&egrave;re deux-points et du processus &agrave; lancer. Notre liste ressemble &agrave; ceci&nbsp;:</p>

<p class="codeFilePath">/Procfile</p>
<pre class="ruby">beanstalk:  beanstalkd
worker:     ./script/worker
faye:       rackup faye.ru -s thin -E production</pre>

<p>Une fois notre <code>Procfile</code> &eacute;crit, nous pouvons v&eacute;rifier sa validit&eacute; en lan&ccedil;ant la commande <code>foreman check</code>.</p>

<pre class="terminal">$ foreman check
valid procfile detected (beanstalk, worker, faye)</pre>

<p>Si nous utilisons des tabulations au lieu d&#x27;espaces pour s&eacute;parer le nom de la commande, nous allons voir des erreurs de d&eacute;pr&eacute;ciation, nous devons donc garder cela en t&ecirc;te lors de l&#x27;&eacute;criture de notre <code>Procfile</code>. Si notre fichier est consid&eacute;r&eacute; comme valide, nous pouvons tenter de lancer Foreman avec la commande <code>foreman start</code>.</p>

<pre class="terminal">$ foreman start
20:06:35 beanstalk.1  | started with pid 23140
20:06:35 worker.1     | started with pid 23141
20:06:35 faye.1       | started with pid 23143
20:06:36 faye.1       | &gt;&gt; Thin web server (v1.2.11 codename Bat-Shit Crazy)
20:06:36 faye.1       | &gt;&gt; Maximum connections set to 1024
20:06:36 faye.1       | &gt;&gt; Listening on 0.0.0.0:9292, CTRL+C to stop
20:06:38 worker.1     | [2011-08-29 20:06:38 +0100] Working 1 jobs: [ Game.move ]</pre>

<p>Lorsque nous le faisons, chaque processus sp&eacute;cifi&eacute; dans notre <code>Procfile</code> va &ecirc;tre lanc&eacute; et list&eacute;, suivi de ses affichages, dans le terminal. Si nous tapons <code>CTRL+C</code> dans cette fen&ecirc;tre de terminal, tous les processus sont stopp&eacute;s.</p>

<p>Foreman a une <a href="http://ddollar.github.com/foreman/">page de manuel</a> utile qui documente ses fonctionnalit&eacute;s et les diff&eacute;rentes options que l&#x27;on peut lui passer. Si nous voulons lancer seulement un processus, nous pouvons directement passer son nom en param&egrave;tre.</p>

<pre class="terminal">$ foreman start faye
20:35:41 faye.1       | started with pid 23322
20:35:41 faye.1       | &gt;&gt; Thin web server (v1.2.11 codename Bat-Shit Crazy)
20:35:41 faye.1       | &gt;&gt; Maximum connections set to 1024
20:35:41 faye.1       | &gt;&gt; Listening on 0.0.0.0:9292, CTRL+C to stop</pre>

<p>Si nous voulons d&eacute;marrer plusieurs copies d&#x27;un m&ecirc;me processus, nous pouvons le faire en passant l&#x27;option <code>-c</code>. Par exemple, nous pouvons lancer 4 processus worker en appelant <code>foreman start -c worker=4</code>.</p>

<pre class="terminal">$ foreman start -c worker=4
20:39:41 beanstalk.1  | started with pid 23366
20:39:41 worker.1     | started with pid 23368
20:39:41 worker.2     | started with pid 23370
20:39:41 worker.3     | started with pid 23372
20:39:41 worker.4     | started with pid 23374
20:39:41 faye.1       | started with pid 23376
20:39:42 faye.1       | &gt;&gt; Thin web server (v1.2.11 codename Bat-Shit Crazy)
20:39:42 faye.1       | &gt;&gt; Maximum connections set to 1024
20:39:42 faye.1       | &gt;&gt; Listening on 0.0.0.0:9292, CTRL+C to stop
20:39:46 worker.3     | [2011-08-29 20:39:46 +0100] Working 1 jobs: [ Game.move ]
20:39:46 worker.1     | [2011-08-29 20:39:46 +0100] Working 1 jobs: [ Game.move ]
20:39:46 worker.2     | [2011-08-29 20:39:46 +0100] Working 1 jobs: [ Game.move ]
20:39:47 worker.4     | [2011-08-29 20:39:47 +0100] Working 1 jobs: [ Game.move ]</pre>

<p>Cela va lancer chaque processus une fois, sauf worker qui sera lanc&eacute; quatre fois.</p>

<h3>Exporter les Processus</h3>

<p>Forman fournit une commande <code>export</code> qui permet d&#x27;exporter la liste des processus dans un format utilisable sur un serveur de production. Les formats support&eacute;s sont pour l&#x27;instant <code>inittab</code> et <code>upstart</code>. Si nous lan&ccedil;ons la commande <code>foreman export upstart .</code>, Forman va &eacute;crire un certain nombre de fichiers de configuration upstart dans le dossier courant. Si nous regardons l&#x27;un d&#x27;eux de plus pr&egrave;s, nous allons voir qu&#x27;il va lancer une commande pour d&eacute;marrer <code>beanstalkd</code> et g&eacute;rer les logs.</p>

<p class="codeFilePath">/govsgo-beanstalk-1.conf</p>
<pre class="terminal">start on starting govsgo-beanstalk
stop on stopping govsgo-beanstalk
respawn

exec su - govsgo -c &#x27;cd /Users/eifion/govsgo; export PORT=5000; beanstalkd &gt;&gt; /var/log/govsgo/beanstalk-1.log 2&gt;&amp;1&#x27;</pre>

<p>C&#x27;est tout pour cet &eacute;pisode sur Foreman. Il est plus court que d&#x27;habitude mais Foreman est une solution simple r&eacute;pondant parfaitement &agrave; un probl&egrave;me sp&eacute;cifique. Si vous avez besoin de lancer un certain nombre de processus pour faire fonctionner votre application Rails en d&eacute;veloppement, Foreman vaut la peine d&#x27;&ecirc;tre consid&eacute;r&eacute;.</p>
