<p>&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x5904;&#x7406;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x94A2;&#x7434;&#x6F14;&#x594F;&#x7231;&#x597D;&#x8005;&#x7684;&#x8BBA;&#x575B;&#x7A0B;&#x5E8F;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5B83;&#x6B63;&#x5728;&#x8F7D;&#x5165;&#x7684;&#x4E3B;&#x9875;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/137/original/E169I01.png" width="834" height="481" alt="The home page of our site takes a few seconds to load." />
</div>

<p>&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x52A0;&#x8F7D;&#x82B1;&#x8D39;&#x4E86;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x590D;&#x6742;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x52A0;&#x8F7D;&#x7F51;&#x9875;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x4E24;&#x79D2;&#x949F;&#x7684;&#x7761;&#x7720;&#x6A21;&#x62DF;&#x5EF6;&#x8FDF;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x5EF6;&#x8FDF;&#x662F;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x7F51;&#x9875;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4F18;&#x5316;&#x7F51;&#x9875;&#x7684;&#x6027;&#x80FD;&#x6765;&#x7F29;&#x77ED;&#x8F7D;&#x5165;&#x65F6;&#x95F4;&#x3002;</p>


<h3>&#x7F13;&#x5B58;&#x9875;&#x9762;</h3>

<p>&#x5728;rails&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x63D0;&#x9AD8;&#x7F51;&#x9875;&#x6027;&#x80FD;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5B83;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF08;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x5728;<a href="http://http://railscasts.com/episodes/89-page-caching">98&#x8282;</a> &#x4E2D;&#x5DF2;&#x7ECF;&#x6709;&#x63D0;&#x53CA;&#xFF09;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x8F6C;&#x5230;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x6765;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#x8BF4;&#x660E;&#x7ED3;&#x679C;&#x3002;</p>

<p>&#x5728;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x7F13;&#x5B58;&#x662F;&#x9ED8;&#x8BA4;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x6253;&#x5F00;&#x6587;&#x4EF6; <code>/config/environments/development.rb</code> &#x628A;&#x91CC;&#x9762;&#x7684;
<code>config.action_controller.perform_caching</code>&#x8BBE;&#x7F6E;&#x4E3A;<code>true</code>&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x4E3A; forums controller &#x4E2D;&#x7684; <code>index</code> action &#x6DFB;&#x52A0;&#x7F13;&#x5B58;&#x529F;&#x80FD;&#x4E86;&#x3002;</p>
<pre class="ruby">
class ForumsController &lt; ApplicationController  

  before_filter :admin_required, :except =&gt; [:index, :show]  
  caches_page :index  

  def index  
    @forums = Forum.all  
    sleep 2  
  end  

  # other methods omitted.  

end  
</pre>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x521A;&#x624D;&#x7684;&#x8BBE;&#x7F6E;&#x751F;&#x6548;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x91CD;&#x542F;&#x670D;&#x52A1;&#x5668;&#x3002;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x9875;&#x9762;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x5B83;&#x5C06;&#x82B1;&#x8D39;&#x51E0;&#x79D2;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x5237;&#x65B0;&#x662F;&#x5B83;&#x51E0;&#x4E4E;&#x662F;&#x7ACB;&#x5373;&#x663E;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x662F;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x3002;</p>


<p>&#x7F13;&#x5B58;&#x9875;&#x9762;&#x65F6;&#x5728;&#x6587;&#x4EF6;&#x5939;<code>/public</code>&#x4E2D;&#x751F;&#x6210;&#x9759;&#x6001;&#x7684;HTML&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5BF9;rails&#x7A0B;&#x5E8F;&#x63D0;&#x4EA4;request&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x4ECE;&#x4E4B;&#x524D;&#x7684;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x4E2D;&#x67E5;&#x627E;&#x5BF9;&#x5E94;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x4E3A;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x67E5;&#x627E;<code>/public/episodes/169-dynamic-page-caching.html</code>&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x627E;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x5C06;&#x628A;&#x8BE5;&#x6587;&#x4EF6;&#x8FD4;&#x56DE;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x800C;rails&#x4E0D;&#x9700;&#x8981;&#x5904;&#x7406;&#x6B64;&#x6B21;request&#x8BF7;&#x6C42;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#x6587;&#x4EF6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x628A;&#x8BF7;&#x6C42;&#x4EA4;&#x7ED9;rails&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;action&#x8BF7;&#x6C42;&#x5DF2;&#x7ECF;&#x6253;&#x5F00;&#x4E86;&#x7F13;&#x5B58;&#xFF0C;Rails&#x5728;&#x5904;&#x7406;&#x4E86;&#x8BE5;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#x5C06;&#x628A;&#x751F;&#x6210;&#x7684;&#x9759;&#x6001;HTML&#x6587;&#x4EF6;&#x5199;&#x5230;<code>/public</code>&#x76EE;&#x5F55;&#x4E0B;&#x76F8;&#x5E94;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x5230;&#x6765;&#x65F6;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#xFF08;&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Rails&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x8981;&#x5C06;&#x9759;&#x6001;&#x7684;<code>index.html</code>&#x9875;&#x9762;&#x5220;&#x9664;&#x3002;&#x5B83;&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x88AB;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x4F1A;&#x963B;&#x6B62;&#x4E00;&#x4E2A;&#x539F;&#x59CB;&#x7684;request&#x8BF7;&#x6C42;&#xFF09;</p>

<p>&#x7F13;&#x5B58;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x9875;&#x9762;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x52A8;&#x6001;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x5C06;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x6709;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5B83;&#x7684;&#x6839;&#x636E;&#x5F53;&#x524D;&#x5DF2;&#x767B;&#x9646;&#x7528;&#x6237;&#x663E;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x8C01;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x5B83;&#x90FD;&#x628A;&#x5F53;&#x524D;&#x5DF2;&#x767B;&#x9646;&#x7684;&#x7528;&#x6237;&#x5F53;&#x6210;eifion.</p>
<pre class="ruby">
&lt;div id=&quot;user_nav&quot;&gt;  
  &lt;p&gt;Welcome &lt;strong&gt;eifion&lt;/strong&gt;! Not you? &lt;a href=&quot;/logout&quot;&gt;Logout&lt;/a&gt;&lt;/p&gt;  
&lt;/div&gt;  
</pre>

<p>&#x5373;&#x4F7F;&#x70B9;&#x51FB;&ldquo;log out&rdquo;&#x94FE;&#x63A5;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x88AB;&#x663E;&#x793A;&#x6210;&#x5DF2;&#x7ECF;&#x767B;&#x9646;&#x7684;&#x7528;&#x6237;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9000;&#x51FA;&#x540E;&#xFF0C;&rdquo;logout&rdquo;&#x9875;&#x9762;&#x91CD;&#x5B9A;&#x5411;&#x56DE;&#x4E3B;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x670D;&#x52A1;&#x5668;&#x76F4;&#x63A5;&#x628A;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x9759;&#x6001;&#x4E3B;&#x9875;&#x9762;&#x8FD4;&#x56DE;&#x7ED9;&#x6211;&#x4EEC;&#x3002;</p>

<p>&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x770B;&#x4E0A;&#x53BB;&#x6709;&#x592A;&#x591A;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x9875;&#x9762;&#x7F13;&#x5B58;&#xFF08;page caching&#xFF09;&#x3002;&#x4E0B;&#x9762;&#x5C06;&#x7528;&#x7247;&#x6BB5;&#x7F13;&#x5B58;&#xFF08;fragment caching&#xFF09;&#x6765;&#x7F13;&#x5B58;&#x663E;&#x793A;&#x8BBA;&#x575B;&#x5217;&#x8868;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x4ECD;&#x7136;&#x6709;&ldquo;edit&rdquo;&#x548C;&ldquo;destroy&rdquo;&#x8FD9;&#x4E24;&#x4E2A;&#x52A8;&#x6001;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x5BF9;&#x7BA1;&#x7406;&#x5458;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x3002;</p>

<h3>&#x5728;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x4E2D;&#x4F7F;&#x7528;Javascript</h3>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#x4ECE;&#x9875;&#x9762;&#x79FB;&#x9664;&#xFF0C;&#x7528;Page caching&#x628A;&#x57FA;&#x672C;&#x7684;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x901A;&#x8FC7;JavaScript&#x628A;&#x52A8;&#x6001;&#x5185;&#x5BB9;&#x6DFB;&#x52A0;&#x4E0A;&#x53BB;&#x3002;</p>


<p>&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;forums controller&#x7684;&#x7F13;&#x5B58;&#x529F;&#x80FD;&#x548C;&#x7761;&#x7720;&#x529F;&#x80FD;&#x6682;&#x65F6;&#x5173;&#x95ED;&#x3002;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x628A;<code>/public/index.html</code>&#x6587;&#x4EF6;&#x5220;&#x9664;&#xFF0C;&#x5426;&#x5219;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x6539;&#x53D8;&#x5C06;&#x4EA7;&#x751F;&#x4E0D;&#x4E86;&#x6548;&#x679C;&#x3002;</p>

<pre class="terminal">
rm public/index.html
</pre>


<p>&#x5728;&#x9875;&#x9762;&#x7684;&#x6700;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x7BA1;&#x7406;&#x5458;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7F16;&#x8F91;&#xFF08;edit&#xFF09;&#x548C;&#x5220;&#x9664;&#xFF08;delete&#xFF09;&#x8BBA;&#x575B;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x7684;&#x5E95;&#x90E8;&#x63D0;&#x4F9B;&#x65B0;&#x5EFA;&#x8BBA;&#x575B;&#xFF08;&ldquo;new forum&rdquo;&#xFF09;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x5728;if&#x8BED;&#x53E5;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x5BF9;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x89C1;&#x3002;</p>
<pre class="ruby">
&lt;% title &quot;Piano Forums&quot; %&gt;  

&lt;div id=&quot;forums&quot;&gt;  
  &lt;% for forum in @forums %&gt;  
    &lt;div class=&quot;forum&quot;&gt;  
      &lt;h2&gt;&lt;%= link_to h(forum.name), forum %&gt;&lt;/h2&gt;  
      &lt;p&gt;&lt;%= h forum.description %&gt;&lt;/p&gt;  
      &lt;% if admin? %&gt;  
        &lt;p class=&quot;admin&quot;&gt;  
          &lt;%= link_to &quot;Edit&quot;, edit_forum_path(forum) %&gt; |  
          &lt;%= link_to &quot;Destroy&quot;, forum, :confirm =&gt; &#x27;Are you sure?&#x27;, :method =&gt; :delete %&gt;  
        &lt;/p&gt;  
      &lt;% end %&gt;  
    &lt;/div&gt;  
  &lt;% end %&gt;  
&lt;/div&gt;  

&lt;% if admin? %&gt;  
  &lt;p class=&quot;admin&quot;&gt;&lt;%= link_to &quot;New Forum&quot;, new_forum_path %&gt;&lt;/p&gt;  
&lt;% end %&gt;  
</pre> 

<p>&#x6211;&#x4EEC;&#x5220;&#x9664;if&#x8BED;&#x53E5;&#x7136;&#x540E;&#x7528;CSS&#x628A;&#x94FE;&#x63A5;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;</p>
<pre class="ruby">
&lt;p class=&quot;admin&quot; style=&quot;display:none;&quot;&gt;  
  &lt;%= link_to &quot;Edit&quot;, edit_forum_path(forum) %&gt; |  
  &lt;%= link_to &quot;Destroy&quot;, forum, :confirm =&gt; &#x27;Are you sure?&#x27;, :method =&gt; :delete %&gt;  
&lt;/p&gt;  
&lt;p class=&quot;admin&quot; style=&quot;display:none;&quot;&gt;&lt;%= link_to &quot;New Forum&quot;, new_forum_path %&gt;&lt;/p&gt; 
 </pre>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x91CD;&#x65B0;&#x8F7D;&#x5165;&#x9875;&#x9762;&#xFF0C;&#x7BA1;&#x7406;&#x94FE;&#x63A5;&#x4ECD;&#x7136;&#x5728;&#x9875;&#x9762;&#x4E0A;&#xFF0C;&#x4F46;&#x5DF2;&#x7ECF;&#x88AB;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/138/original/E169I02.png" width="810" height="496" alt="The edit, destroy and new links are now hidden." />
</div>

<p>&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7528;&#x6237;&#x662F;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F7F;&#x7528;JavaScript&#x6765;&#x4F7F;&#x4EE5;&#x4E0A;&#x7BA1;&#x7406;&#x94FE;&#x63A5;&#x91CD;&#x65B0;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;&#x5728;&#x89C6;&#x56FE;&#x7684;&#x9876;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;helper&#x65B9;&#x6CD5;&#x628A;&#x4E24;&#x4E2A;JavaScript&#x6587;&#x4EF6;&#x5F15;&#x5165;&#x5230;&#x9875;&#x9762;&#x7684;HEAD&#x533A;&#x57DF;&#x4E2D;&#x3002;&#xFF08;&#x8FD9;&#x4E2A;helper&#x65B9;&#x6CD5;&#x662F;Ryan Bates <a href="http://github.com/ryanb/nifty-generations/tree/master">nifty layout generator</a>&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x5F15;&#x7528;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;JavaScript&#x6587;&#x4EF6;&#x662F;<a href="http://jquery.com/">jQuery library</a>&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<a href="http://www.prototypejs.org/">Prototype</a>&#x5982;&#x679C;&#x4F60;&#x66F4;&#x503E;&#x5411;&#x4E8E;Prototype&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;<code>UsersController</code>&#x7684;&#x4E00;&#x4E2A;action&#xFF09;</p>

<pre class="ruby">&lt;% javascript &#x27;jquery&#x27;, &#x27;/users/current&#x27; %&gt;</pre>

<p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5982;&#x4E0B;HTML</p>
<pre class="ruby">
&lt;script src=&quot;/javascripts/jquery.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;  
&lt;script src=&quot;/users/current.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;   
</pre>
<p>&#x7B2C;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x8F7D;&#x5165;jQuery&#x5E93;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5148;&#x4E0B;&#x8F7D;&#x5B83;&#x7136;&#x540E;&#x628A;&#x5B83;&#x653E;&#x5230;<code>/public/javascripts</code>&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x7B2C;&#x4E8C;&#x884C;&#x5C06;&#x8C03;&#x7528;users controller&#x7684;<code>show</code> action,&#x73B0;&#x5728;&#x5B83;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x5047;&#x7684;id&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;show action&#x80FD;&#x591F;&#x54CD;&#x5E94;JavaScript&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x5148;&#x4FEE;&#x6539;&#x5B83;&#x3002;
&#x8FD9;&#x4E2A;controller&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;<code>show</code> method&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x5199;&#x3002;</p>
<pre class="ruby">
def show  

end  
</pre>
<p>&#x4E0B;&#x4E00;&#x6B65;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x89C6;&#x56FE;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;controller&#x5C31;&#x53EF;&#x4EE5;&#x54CD;&#x5E94;JavaScript&#x8BF7;&#x6C42;&#x3002;&#x5728;&#x76EE;&#x5F55;<code>/app/views/users</code>&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>show.js.erb</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x5199;&#x4E0B;&#x5982;&#x4E0B;&#x4EE3;&#x7801;</p>
<pre class="ruby">
$(document).ready(function () {  
  &lt;% if admin? %&gt;  
  $(&#x27;.admin&#x27;).show();  
  &lt;% end %&gt;  
});  
</pre>
<p>&#x5F53;&#x6587;&#x4EF6;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x4EE3;&#x7801;&#x4F7F;&#x7528;jQuery&#x7684;<code>$(document).ready()</code>&#x65B9;&#x6CD5;&#x6765;&#x8FD0;&#x884C;JavaScript&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x4E0D;&#x662F;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x4E3A;&#x7A7A;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x9875;&#x9762;&#x4E0A;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5C06;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;</p>

<h3>&#x66F4;&#x65B0;&#x72B6;&#x6001;</h3>

<p>&#x9875;&#x9762;&#x4E2D;&#x663E;&#x793A;&#x7528;&#x6237;&#x72B6;&#x6001;&#x7684;&#x90E8;&#x5206;&#x4E5F;&#x8981;&#x52A8;&#x6001;&#x5730;&#x751F;&#x6210;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x767B;&#x5F55;&#x6216;&#x8005;&#x9000;&#x51FA;&#x65F6;&#x76F8;&#x5E94;&#x7684;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x4E5F;&#x8981;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x4E24;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x88AB;&#x653E;&#x5165;&#x5F53;&#x4E86;application&#x7684;layout&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<pre class="ruby">
&lt;%- flash.each do |name, msg| -%&gt;  
  &lt;%= content_tag :div, msg, :id =&gt; &quot;flash_#{name}&quot; %&gt;  
&lt;%- end -%&gt;  
&lt;div id=&quot;user_status&quot;&gt;  
  &lt;% if current_user %&gt;  
    &lt;p&gt;Welcome &lt;strong&gt;&lt;%= current_user.username %&gt;&lt;/strong&gt;! Not you? &lt;%= link_to &quot;Logout&quot;, logout_path %&gt;&lt;/p&gt;  
  &lt;% else %&gt;  
    &lt;%= link_to &quot;Register&quot;, new_user_path %&gt;  
    &lt;%= link_to &quot;Log in&quot;, login_path %&gt;  
  &lt;% end %&gt;  
&lt;/div&gt;  
</pre>

<p>&#x5982;&#x679C;&#x8FD9;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E00;&#x4E2A;partial&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;JavaScript&#x66F4;&#x65B0;&#x5B83;&#x4EEC;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x6240;&#x6709;&#x6211;&#x4EEC;&#x628A;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5165;<code>/app/views/layouts/dynamic_header.html.erb</code>&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x539F;&#x6587;&#x4EF6;&#x4E2D;&#x5199;&#x4E0B;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<pre class="ruby">
&lt;%= render &#x27;layouts/dynamic_header&#x27; %&gt;  
</pre>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x628A;partial&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4ECE;&#x5DF2;&#x7ECF;&#x7F13;&#x5B58;&#x7684;&#x9759;&#x6001;&#x4E3B;&#x9875;&#x6587;&#x4EF6;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x7528;JavaScript&#x518D;&#x628A;&#x5B83;&#x4EEC;&#x6DFB;&#x52A0;&#x56DE;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x7ED9;partial&#x8BA9;&#x5B83;&#x4E0D;&#x8981;&#x518D;&#x5728;&#x4E3B;&#x9875;&#x4E2D;&#x663E;&#x793A;&#x3002;</p>

<p>&#x5728;&#x6587;&#x4EF6;<code>/app/views/forums/index.html.erb</code>&#x7684;&#x9876;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;<code>@hide_dynamic</code>&#x5E76;&#x4E14;&#x628A;&#x5B83;&#x8D4B;&#x503C;&#x4E3A;<code>true</code>.</p>
<pre class="ruby">
&lt;% title &quot;Piano Forums&quot; %&gt;  
&lt;% javascript &#x27;jquery&#x27;, &#x27;/users/current&#x27; %&gt;  
&lt;% @hide_dynamic = true %&gt;  
&lt;div id=&quot;forums&quot;&gt;  
&lt;!-- rest of page... --&gt;  
 </pre>
<p>&#x5F53;<code>@hide_dynamic</code>&#x4E3A;<code>true</code>&#x65F6;<code>layout dynamic_header</code>&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x5F15;&#x7528;&#x3002;</p>
<pre class="ruby">
&lt;%= render :partial =&gt; &#x27;layouts/dynamic_header&#x27; unless @hide_dynamic %&gt;  
</pre>
<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;user&#x7684;&#x72B6;&#x6001;&#x800C;&#x4E14;logout&#x94FE;&#x63A5;&#x4E5F;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4FEE;&#x6539;&#x6211;&#x4EEC;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x91CD;&#x65B0;&#x6DFB;&#x52A0;&#x4E0A;&#x53BB;</p>

<div class="imageWrapper">
  <img src="/system/photos/139/original/E169I03.png" width="825" height="630" alt="The users status no longer appears." />
</div> 

<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6211;&#x4EEC;&#x7684;jQuery&#x65B9;&#x6CD5;&#xFF0C;&#x4E4B;&#x540E;&#x5B83;&#x7528;partial&#x6765;&#x663E;&#x793A;&#x7528;&#x6237;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x548C;&#x5176;&#x4ED6;&#x65B0;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x589E;&#x52A0;&#x4E00;&#x884C;jQuery&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x3002;</p>
<pre class="ruby">
$(document).ready(function () {  
  $(&#x27;#container&#x27;).prepend(&#x27;&lt;%= escape_javascript render(&quot;layouts/dynamic_header&quot;) %&gt;&#x27;);  
  &lt;% if admin? %&gt;  
  $(&#x27;.admin&#x27;).show();  
  &lt;% end %&gt;  
});  
</pre>
<p>&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7ED9;id&#x4E3A;<code>container</code>&#x7684;div&#x6DFB;&#x52A0;&#x8FD9;&#x4E2A;partial&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;jQuery&#x7684;<code>prepend()</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4EE5;HTML&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F20;&#x9012;&#x8FD9;&#x4E2A;partial&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x88F9;&#x5728;<code>escape_javascript</code>&#x4E2D;&#x6765;&#x4FDD;&#x8BC1;partial&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;JavaScript&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x8F7D;&#x5165;&#x9875;&#x9762;&#x65F6;&#x7528;&#x6237;&#x72B6;&#x6001;&#x91CD;&#x65B0;&#x51FA;&#x73B0;&#xFF0C;&#x9875;&#x9762;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x771F;&#x5B9E;&#x7528;&#x6237;&#x767B;&#x5F55;&#x72B6;&#x6001;&#x5C06;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>

<h3>Re-enabling Caching</h3>

<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x6709;&#x4E86;JavaScript&#x52A8;&#x6001;&#x66F4;&#x65B0;&#x7684;&#x9875;&#x9762;&#x90E8;&#x5206;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x529F;&#x80FD;&#x548C;&#x7761;&#x7720;&#x529F;&#x80FD;&#x6765;&#x6A21;&#x4EFF;&#x9875;&#x9762;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x540C;&#x6837;&#x82B1;&#x8D39;&#x51E0;&#x79D2;&#x949F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x63A5;&#x4E0B;&#x7684;&#x5237;&#x65B0;&#x9875;&#x9762;&#x51E0;&#x4E4E;&#x662F;&#x76F4;&#x63A5;&#x663E;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;&#x9875;&#x9762;&#x662F;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4E0E;&#x4E4B;&#x524D;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x7684;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x767B;&#x5F55;&#x6216;&#x8005;&#x9000;&#x51FA;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x63D0;&#x4F9B;&#x7ED9;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x94FE;&#x63A5;&#x662F;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x4E00;&#x6837;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/140/original/E169I04.png" width="825" height="541" alt="The dynamic parts of the page are now set by the JavaScript." />
</div>

<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x50CF;&#x9875;&#x9762;&#x7F13;&#x5B58;(full-page caching)&#x90A3;&#x6837;&#x9AD8;&#x6548;,&#x56E0;&#x4E3A;JavaScript&#x90E8;&#x5206;&#x4ECD;&#x7136;&#x4F1A;&#x5230;&#x8FBE;Rails&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x6587;&#x4EF6;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x662F;&#x4F5C;&#x4E3A;&#x9759;&#x6001;&#x7684;HTML&#x63D0;&#x4F9B;&#x7684;&#x3002;</p>