<p>&#x4E0B;&#x9762;&#x7684;&#x9875;&#x9762;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x7A0B;&#x5E8F;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#xFF0C;&#x767B;&#x9646;&#xFF0C;&#x7136;&#x540E;&#x548C;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x3002;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x663E;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5217;&#x8868;&#xFF0C;&#x901A;&#x8FC7;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x65C1;&#x8FB9;&#x7684;&#x94FE;&#x63A5;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4ED6;&#x4EEC;&#x52A0;&#x4E3A;&#x597D;&#x53CB;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/110/original/E163I01.png" width="808" height="452" alt="The users list page on our application."/>
</div>

<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#x73B0;&#x5728;&#x8FD8;&#x90FD;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x52A0;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x8BA9;&#x7528;&#x6237;&#x80FD;&#x591F;&#x52A0;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x4E3A;&#x597D;&#x53CB;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x81EA;&#x5F15;&#x7528;&#x5173;&#x8054;&#xFF1A;&#x5EFA;&#x7ACB;&#x7528;&#x6237;&#x548C;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x540C;&#x4E00;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>


<h3>&#x751F;&#x6210;&#x6B63;&#x786E;&#x7684;&#x52A8;&#x4F5C;</h3>

<p>&#x7528;&#x6237;&#x9875;&#x9762;&#x4E2D;&#x7684;&ldquo;&#x6DFB;&#x52A0;&#x670B;&#x53CB;&rdquo;&#x94FE;&#x63A5;&#x8FD8;&#x6CA1;&#x6709;&#x6307;&#x5411;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x3002;</p>
 
<pre class="ruby">
&lt;%= link_to &quot;Add Friend&quot; %&gt;  
</pre>
 
<p>&#x5728;&#x4E00;&#x4E9B;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x4E0E;&#x67D0;&#x4E2A;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x52A8;&#x4F5C;&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5F53;&#x5B83;&#x88AB;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x8C03;&#x7528;&#x54EA;&#x4E2A;&#x63A7;&#x5236;&#x5668;&#x7684;&#x54EA;&#x4E2A;&#x52A8;&#x4F5C;&#x5462;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x5F97;&#x7422;&#x78E8;&#x7422;&#x78E8;&#x3002;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A; <code>UsersController</code> &#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x6765;&#x5904;&#x7406;&#x670B;&#x53CB;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x770B;&#x4E0A;&#x53BB;&#x7406;&#x6240;&#x5F53;&#x7136;&#xFF0C;&#x56E0;&#x4E3A;&#x670B;&#x53CB;&#x4E0D;&#x5C31;&#x662F;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x5417;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; <code>UsersController</code> &#x4E2D;&#x6765;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;&#x670B;&#x53CB;&#x3002;</p>
 
<pre class="ruby">
def add_friend    
  
end    
  
def remove_friend    
  
end   
</pre>
 
<p>&#x4F46;&#x662F;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x5404;&#x79CD;&#x56E0;&#x7D20;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x521B;&#x5EFA;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x63A7;&#x5236;&#x5668;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x4FAF;&#xFF0C;&#x5728;&#x4F60;&#x8111;&#x6D77;&#x4E2D;&#x8981;&#x6572;&#x54CD;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8B66;&#x949F;&#x5C31;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E0D;&#x5728;&#x4E03;&#x4E2A;&#x6807;&#x51C6;&#x7684; RESTful &#x65B9;&#x6CD5;&#x4E4B;&#x5185;&#xFF08;&#x7D22;&#x5F15;&#xFF0C;&#x663E;&#x793A;&#xFF0C;&#x65B0;&#x5EFA;&#xFF0C;&#x521B;&#x5EFA;&#xFF0C;&#x7F16;&#x8F91;&#xFF0C;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#xFF09;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4E00;&#x4E2A; <code>_friend</code> &#x540E;&#x7F00;&#x3002;&#x8FD9;&#x5C31;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x628A;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x653E;&#x5230;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E2D;&#x53BB;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8BF4;&#x660E;&#x8FD9;&#x4E0D;&#x662F;&#x4E2A;&#x597D;&#x65B9;&#x6CD5;&#x7684;&#x82D7;&#x5934;&#x662F;&#xFF1A; <code>add</code> &#x548C; <code>remove</code> &#x8868;&#x660E;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x662F;&#x8981;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x60F3;&#x5230;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x5668;&#x6765;&#x5904;&#x7406;&#x670B;&#x53CB;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
 
<h3>&#x521B;&#x5EFA;&#x670B;&#x53CB;&#x5173;&#x7CFB;</h3>

<p>&#x6211;&#x4EEC;&#x65B0;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB; <code>FriendshipsController</code> &#x7684;&#x63A7;&#x5236;&#x5668;&#x3002;&#x63A7;&#x5236;&#x5668;&#x7684;&#x547D;&#x540D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x53EB;&#x505A; <code>FriendsController</code> &#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x5176;&#x5B9E;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x7528;&#x6237;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x7528;&#x6237;&#x3002;</p>
 
<p>&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x4E2A;&#x670B;&#x53CB;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x670B;&#x53CB;&#xFF0C; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5728; Rails &#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#xFF1A; <code>has_and_belongs_to_many</code> &#x548C; <code>has_many :though</code> &#x3002;&#xFF08;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x770B; <a href="http://railscasts.com/episodes/47-two-many-to-many">47</a> &#x96C6;&#x7684;&#x89C6;&#x9891; &#xFF0C;&#x91CC;&#x9762;&#x8BB2;&#x4E86;&#x5F88;&#x591A;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5185;&#x5BB9;&#xFF09;&#x3002;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x5927;&#x5BB6;&#x66F4;&#x591A;&#x5730;&#x662F;&#x5728;&#x7528; <code>has_many :though</code> &#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4E5F;&#x5C06;&#x7528;&#x5B83;&#x6765;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x3002;</p>
 
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; <code>has_many :though</code> &#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x547D;&#x540D;&#x4E3A; <code>Friendship</code> &#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x6709;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C; <code>user_id</code> &#x4EE3;&#x8868;&#x5F53;&#x524D;&#x8981;&#x52A0;&#x670B;&#x53CB;&#x7684;&#x7528;&#x6237;&#xFF0C; <code>friend_id</code> &#x4EE3;&#x8868;&#x88AB;&#x52A0;&#x4E3A;&#x670B;&#x53CB;&#x7684;&#x7528;&#x6237;&#x3002;</p>
 
<p>&#x6211;&#x4EEC;&#x8C61;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x6765;&#x521B;&#x5EFA;&#x6211;&#x4EEC;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;</p>
 
<pre class="terminal">
script/generate model Friendship user_id:integer friend_id:integer  
</pre>
 
<p>&#x7136;&#x540E;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#x3002;</p>
 
<pre class="terminal">
rake db:migrate  
</pre>
 
<p>&#x968F;&#x7740;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E4B;&#x524D;&#x8BF4;&#x7684; FriendshipsController &#x63A7;&#x5236;&#x5668;&#x3002;</p>
 
<pre class="terminal">
script/generate controller Friendships  
</pre> 
 
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x662F;&#x628A; <code>Friendship</code> &#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728; <code>/config/routes.rb</code> &#x4E2D;&#x52A0;&#x5165;&#x4E0B;&#x9762;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x3002;</p>
 
<pre class="ruby">
map.resources :friendships    
</pre> 
 
<p>&#x641E;&#x5B9A;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E0B; <code>Friendship</code> &#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7C7B;&#x4E2D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5B9A;&#x4E49; <code>User</code> &#x548C; <code>Friendship</code> &#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
 
<pre class="ruby">
class Friendship &lt; ActiveRecord::Base    
  belongs_to :user    
  belongs_to :friend, :class_name =&gt; &#x27;User&#x27;    
end
</pre>
   
<p>&#x4E00;&#x4E2A; <code>Friendship</code> &#x4ECE;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6DFB;&#x52A0;&#x670B;&#x53CB;&#x7684;&#x4E00;&#x65B9;&#x3002;&#x5B83;&#x540C;&#x65F6;&#x8FD8;&#x4ECE;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A; <code>Friend</code> &#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x662F;&#x88AB;&#x52A0;&#x505A;&#x670B;&#x53CB;&#x7684;&#x4E00;&#x65B9;&#x3002;&#x5BF9;&#x4E8E; <code>friend</code> &#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x5730;&#x6307;&#x660E;&#x5B83;&#x7684;&#x7C7B;&#x540D;&#xFF0C;&#x56E0;&#x4E3A; ActiveRecord &#x6CA1;&#x6CD5;&#x901A;&#x8FC7;&#x5173;&#x8054;&#x4E2D;&#x7684;&#x540D;&#x5B57;&#x6765;&#x627E;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>
 
<p>&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728; <code>User</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x5B9A;&#x4E49;&#x53E6;&#x5916;&#x4E00;&#x534A;&#x6570;&#x636E;&#x5173;&#x7CFB;&#x3002;</p>
 
<pre class="ruby">
class User &lt; ActiveRecord::Base    
          
  has_many :friendships    
  has_many :friends, :through =&gt; :friendships    
        
  # rest of class omitted.     
end    
</pre> 
 
<p>&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x901A;&#x5E38;&#x7684;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x5173;&#x7CFB;&#x540D;&#x5B57;&#x4E2D;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x3002;</p>


<h3>&#x63A5;&#x901A;&ldquo;&#x6DFB;&#x52A0;&#x670B;&#x53CB;&rdquo;&#x94FE;&#x63A5;</h3>

<p>&#x5B9A;&#x4E49;&#x597D;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6709;&#x4E86; <code>FriendshipsController</code> &#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x7528;&#x6237;&#x7684;&#x7D22;&#x5F15;&#x89C6;&#x56FE;&#x4E0A;&#x7ED9;&ldquo;&#x6DFB;&#x52A0;&#x670B;&#x53CB;&rdquo;&#x94FE;&#x63A5;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x4E86;&#x3002;</p>
 
<pre class="ruby">
&lt;% for user in @users %&gt;    
  &lt;div class=&quot;user&quot;&gt;    
    &lt;p&gt;    
      &lt;strong&gt;&lt;%=h user.username %&gt;&lt;/strong&gt;    
      &lt;%= link_to &quot;Add Friend&quot;, friendships_path(:friend_id =&gt; user), :method =&gt; :post %&gt;    
      &lt;div class=&quot;clear&quot;&gt;&lt;/div&gt;    
    &lt;/p&gt;    
  &lt;/div&gt;    
&lt;% end %&gt;   
</pre>

<p>&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x9700;&#x8981;&#x8C03;&#x7528; <code>FriendshipsController</code> &#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684; <code>create</code> &#x65B9;&#x6CD5;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x8BA9;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x4EE5; POST &#x65B9;&#x5F0F;&#x6307;&#x5411; <code>friendships_path</code> &#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x4F20;&#x5165;&#x6211;&#x4EEC;&#x8981;&#x52A0;&#x4E3A;&#x670B;&#x53CB;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x628A;&#x5B83;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x5165; <code>friendships_path</code> &#x5F53;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x7684; <code>id</code> &#x5C31;&#x4F1A;&#x88AB;&#x4F20;&#x5165; <code>create</code> &#x52A8;&#x4F5C;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x8981;&#x52A0;&#x54EA;&#x4E2A;&#x7528;&#x6237;&#x4E3A;&#x670B;&#x53CB;&#x3002;</p>
 
<p>&#x5199;&#x597D;&#x4E86;&#x94FE;&#x63A5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x5728; <code>FriendshipsController</code> &#x63A7;&#x5236;&#x5668;&#x4E2D;&#x6765;&#x5199;&#x6211;&#x4EEC;&#x7684; <code>create</code> &#x52A8;&#x4F5C;&#x3002;</p>
 
<pre class="ruby">
def create    
  @friendship = current_user.friendships.build(:friend_id =&gt; params[:friend_id])    
  if @friendship.save    
    flash[:notice] = &quot;Added friend.&quot;    
    redirect_to root_url    
  else    
    flash[:notice] = &quot;Unable to add friend.&quot;    
    redirect_to root_url    
  end    
end    
</pre>
 
<p>&#x901A;&#x8FC7;&#x5F53;&#x524D;&#x7528;&#x6237;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x52A0;&#x4E3A;&#x670B;&#x53CB;&#x7684;&#x7528;&#x6237; <code>id</code> &#x3002;&#x4F7F;&#x7528; <code>build</code> &#x65B9;&#x6CD5;&#x610F;&#x5473;&#x7740;&#x65B0;&#x7684; <code>Friendship</code> &#x4E2D;&#x7684; <code>user_id</code> &#x5C5E;&#x6027;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x586B;&#x4E0A;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6211;&#x4EEC;&#x4EE5;&#x53C2;&#x6570;&#x4F20;&#x5165;&#x7684; <code>friend_id</code> &#xFF0C;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x5C31;&#x5B8C;&#x5168;&#x5EFA;&#x597D;&#x4E86;&#x3002;&#x4FDD;&#x5B58;&#x597D;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x5B9A;&#x5411;&#x56DE;&#x4E3B;&#x9875;&#x9762;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x663E;&#x793A;&#x4E00;&#x6761;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x8BF4;&#x670B;&#x53CB;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x4E86;&#x3002;&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x4E0D;&#x80FD;&#x4FDD;&#x5B58;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x663E;&#x793A;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8981;&#x4E0A;&#x7EBF;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x66F4;&#x591A;&#x5177;&#x4F53;&#x7684;&#x4FE1;&#x606F;&#x8BA9;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x8BF7;&#x6C42;&#x4E3A;&#x4EC0;&#x4E48;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
 
<h3>&#x67E5;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB;</h3>

<p>&#x4E00;&#x4E2A;&#x767B;&#x9646;&#x7528;&#x6237;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&ldquo;&#x6DFB;&#x52A0;&#x670B;&#x53CB;&rdquo;&#x94FE;&#x63A5;&#x6765;&#x628A;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x52A0;&#x4E3A;&#x670B;&#x53CB;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x8FD8;&#x6CA1;&#x6CD5;&#x770B;&#x5230;&#x6240;&#x6709;&#x670B;&#x53CB;&#x7684;&#x5217;&#x8868;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6539;&#x4E00;&#x4E0B;&#x7528;&#x6237;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x9762;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x90FD;&#x628A;&#x8C01;&#x52A0;&#x4E3A;&#x670B;&#x53CB;&#x4E86;&#x3002;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x9762;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x663E;&#x793A;&#x9875;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x4E0A;&#x53EA;&#x6709;&#x7528;&#x6237;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x627E;&#x5230;&#x5176;&#x4ED6;&#x670B;&#x53CB;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>
 
<pre class="ruby">
&lt;% title &quot;My Profile&quot; %&gt;    
&lt;p&gt;Username: &lt;%=h @user.username %&gt;&lt;/p&gt;    
&lt;p&gt;&lt;%= link_to &quot;Find Friends&quot;, users_path %&gt;&lt;/p&gt;   
</pre>
 
<p>&#x4E3A;&#x4E86;&#x663E;&#x793A;&#x670B;&#x53CB;&#x5217;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x7528;&#x6237;&#x7684;&#x670B;&#x53CB;&#x96C6;&#x5408;&#x6765;&#x663E;&#x793A;&#x6BCF;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x3002;</p>
 
<pre class="ruby">
&lt;h2&gt;Your Friends&lt;/h2&gt;    
&lt;ul&gt;    
  &lt;% for user in @user.friends %&gt;    
  &lt;li&gt;&lt;%= h. user.username %&gt;&lt;/li&gt;    
  &lt;% end %&gt;      
&lt;/ul&gt;    
</pre>
 
<p>&#x73B0;&#x5728;&#xFF0C;&#x5728;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x9762;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#x5217;&#x8868;&#x4E86;&#x3002;</p>
 
<div class="imageWrapper">
  <img src="/system/photos/111/original/E163I02.png" width="808" height="452" alt="Our friends are now listed on our profile page."/>
</div>

<h3>&#x5220;&#x9664;&#x670B;&#x53CB;</h3>

<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x5728;&#x670B;&#x53CB;&#x5217;&#x8868;&#x7684;&#x6BCF;&#x4E2A;&#x670B;&#x53CB;&#x65C1;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x628A;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x4ECE;&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#x4E2D;&#x8E22;&#x51FA;&#x53BB;&#xFF0C;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x6765;&#x8C03;&#x7528; <code>FriendshipController</code> &#x63A7;&#x5236;&#x5668;&#x7684; <code>destroy</code> &#x52A8;&#x4F5C;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x662F;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x7684; <code>id</code> &#x3002;&#x8FD9;&#x91CC;&#x8BA9;&#x4EBA;&#x7A0D;&#x7A0D;&#x6709;&#x70B9;&#x6655;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5728;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x6CA1;&#x6CD5;&#x83B7;&#x5F97; <code>Friendship</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x62FF;&#x5230;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x7684; <code>id</code> &#x5462;&#xFF1F;&#x5BF9;&#x4E8E; Rails &#x83DC;&#x9E1F;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x4F7F;&#x7528;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x5FD8;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x90A3;&#x4E2A;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4ECE;&#x7528;&#x6237;&#x5C31;&#x8DF3;&#x5230;&#x670B;&#x53CB;&#x90A3;&#x91CC;&#x53BB;&#x3002;</p>
 
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x7528;&#x6237;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ED6;&#x7684;&#x670B;&#x53CB;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x3002;&#x89C6;&#x56FE;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x540E;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
 
<pre class="ruby">
&lt;h2&gt;Your Friends&lt;/h2&gt;    
&lt;ul&gt;    
  &lt;% for friendship in @user.friendships %&gt;    
  &lt;li&gt;    
    &lt;%= h friendship.friend.username %&gt;    
    (&lt;%= link_to &quot;remove&quot;, friendship, :method =&gt; :delete %&gt;)    
  &lt;/li&gt;    
&lt;% end %&gt;      
&lt;/ul&gt; 
</pre>
   
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x901A;&#x8FC7; <code>friendship.friend.username</code> &#x6765;&#x5F97;&#x5230;&#x6BCF;&#x4E2A;&#x670B;&#x53CB;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x5165;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5220;&#x9664;&#x94FE;&#x63A5;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x58F0;&#x660E;&#x4F7F;&#x7528; DELETE &#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x5B83;&#x53BB;&#x8C03;&#x7528; <code>destroy</code> &#x52A8;&#x4F5C;&#x3002;</p>
 
<p>&#x8BF4;&#x5230; <code>destroy</code> &#x52A8;&#x4F5C;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C31;&#x6765;&#x5728; <code>FriendshipsController</code> &#x63A7;&#x5236;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#x5B83;&#x3002;</p>

<pre class="ruby">
def destroy    
  @friendship = current_user.friendships.find(params[:id])    
  @friendship.destroy    
  flash[:notice] = &quot;Removed friendship.&quot;    
  redirect_to current_user    
end
</pre> 

<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x4E2D;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5728;&#x5F53;&#x524D;&#x7528;&#x6237;&#x7684;&#x670B;&#x53CB;&#x5217;&#x8868;&#x4E2D;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8C03;&#x7528; <code>Friendship.find(params[:id])</code> &#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x6076;&#x610F;&#x7528;&#x6237;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x4E24;&#x4E2A;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x95F4;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x88AB;&#x9650;&#x5236;&#x53EA;&#x80FD;&#x5220;&#x9664;&#x5B83;&#x4EEC;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x9875;&#x9762;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x7528;&#x6237;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x3002;</p>
 
<p>&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x4E2D;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x70B9;&#x6BCF;&#x4E2A;&#x670B;&#x53CB;&#x65C1;&#x8FB9;&#x7684;&#x94FE;&#x63A5;&#x6765;&#x5220;&#x9664;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/112/original/E163I03.png" width="808" height="452" alt="Removing a friend from our list."/>
</div>

<h3>&#x53CD;&#x5411;&#x5173;&#x7CFB;</h3>

<p>&#x5F53;&#x521B;&#x5EFA;&#x81EA;&#x5F15;&#x7528;&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x8BB0;&#x4F4F;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x521B;&#x5EFA;&#x7684;&#x4E00;&#x4E2A;&#x5355;&#x5411;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x867D;&#x7136;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x9875;&#x9762;&#x4E2D; <code>paul</code> &#x88AB;&#x5217;&#x4E3A; <code>eifion</code> &#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6253;&#x5F00; <code>paul</code> &#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x4E0D;&#x5230; <code>eifion</code> &#x5728;&#x4ED6;&#x7684;&#x670B;&#x53CB;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x9664;&#x975E; <code>paul</code> &#x4E5F;&#x52A0;&#x4ED6;&#x4E3A;&#x670B;&#x53CB;&#x3002; &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53CC;&#x5411;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x4E24;&#x6761; <code>Friendship</code> &#x8BB0;&#x5F55;&#x3002;</p>
 
<p>&#x7ED3;&#x675F;&#x8FD9;&#x4E00;&#x96C6;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x7ED9;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#x52A0;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x90FD;&#x6709;&#x8C01;&#x628A;&#x4ED6;&#x4EEC;&#x52A0;&#x4E3A;&#x4E86;&#x670B;&#x53CB;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x5411;&#x6765;&#x770B;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728; <code>User</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x65B0;&#x52A0;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x3002;</p>
 
<pre class="ruby">
class User &lt; ActiveRecord::Base    
          
  has_many :friendships    
  has_many :friends, :through =&gt; :friendships    
          
  has_many :inverse_friendships, :class_name =&gt; &quot;Friendship&quot;, :foreign_key =&gt; &quot;friend_id&quot;    
  has_many :inverse_friends, :through =&gt; :inverse_friendships, :source =&gt; :user
        
  #rest of class omitted.    
end  
</pre>  
 
<p>&#x4E0D;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x540D;&#x5B57;&#x6765;&#x547D;&#x540D;&#x53CD;&#x5411;&#x7684;&#x670B;&#x53CB;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x52A0;&#x4E0A;&ldquo; inverse &rdquo;&#x524D;&#x7F00;&#x6765;&#x5B9A;&#x4E49; <code>inverse_friendships</code> &#x548C; <code>inverse_friends</code> &#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x52A0;&#x4E0A;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x9009;&#x9879;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x3002;&#x5BF9;&#x4E8E; <code>inverse_friendships</code> &#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x6307;&#x660E;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6CD5;&#x4ECE;&#x5173;&#x7CFB;&#x540D;&#x4E2D;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x3002;&#x53E6;&#x5916;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5B9A;&#x4E49; <code>friend_id</code> &#x4F5C;&#x4E3A;&#x5916;&#x952E;&#x3002;&#x5BF9;&#x4E8E; <code>inverse_friends</code> &#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6307;&#x660E; <code>users</code> &#x4F5C;&#x4E3A; <code>source</code> &#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E5F;&#x4E0D;&#x80FD;&#x4ECE;&#x5173;&#x7CFB;&#x540D;&#x5B57;&#x4E2D;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x3002;</p>
 
<p>&#x56DE;&#x5230;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x9875;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x663E;&#x793A;&#x628A;&#x6211;&#x4EEC;&#x52A0;&#x4E3A;&#x597D;&#x53CB;&#x7684;&#x7528;&#x6237;&#x7684;&#x5217;&#x8868;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x6211;&#x4EEC;&#x7684; <code>inverse_friends</code> &#xFF0C;&#x7136;&#x540E;&#x663E;&#x793A;&#x90A3;&#x4E9B;&#x7528;&#x6237;&#x7684;&#x540D;&#x5B57;&#x3002;</p>
 
<pre class="ruby">
&lt;h2&gt;Users Who Have Befriended You&lt;/h2&gt;    
&lt;ul&gt;    
  &lt;% for user in @user.inverse_friends %&gt;    
  &lt;li&gt;&lt;%= h user.username %&gt;&lt;/li&gt;    
  &lt;% end %&gt;    
&lt;/ul&gt; 
</pre>   
 
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4EE5;&#x7528;&#x6237; <code>paul</code> &#x767B;&#x9646;&#xFF0C;&#x5E76;&#x4E14;&#x6DFB;&#x52A0; <code>eifion</code> &#x505A;&#x4E3A;&#x4ED6;&#x7684;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4EE5; <code>eifion</code> &#x767B;&#x9646;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5217;&#x8868;&#x4E2D; <code>paul</code> &#x6DFB;&#x52A0;&#x4E86; <code>eifion</code> &#x4F5C;&#x4E3A;&#x670B;&#x53CB;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/113/original/E163I04.png" width="808" height="472" alt="We can now see who call us a friend."/>
</div>
 
<p>&#x672C;&#x96C6;&#x5C31;&#x8FD9;&#x4E48;&#x591A;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x91CD;&#x9020;&#x51FA;&#x4E00;&#x4E2A; Facebook &#xFF0C;&#x4F46;&#x662F;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x591F;&#x5BF9;&#x4E8E;&#x5982;&#x4F55;&#x5728; Ruby on Rails &#x4E2D;&#x4F7F;&#x7528;&#x81EA;&#x5F15;&#x7528;&#x7684;&#x5173;&#x7CFB;&#x6709;&#x6240;&#x4F53;&#x4F1A;&#x3002;</p>