<p>Dans l&#x27;<a href="http://fr.asciicasts.com/episodes/10-refactorisation-premiere">&eacute;pisode pr&eacute;c&eacute;dent</a> nous avons parl&eacute; de refactorisation et comment d&eacute;placer le code d&#x27;une vue dans un mod&egrave;le dans l&#x27;id&eacute;e de r&eacute;duire la duplication. Le code dans notre mod&egrave;le <code>User</code> pourrait pourtant &ecirc;tre encore am&eacute;lior&eacute;.</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  def full_name
    name = first_name + &#x27; &#x27;
    name += &quot;#{middle_initial}. &quot; unless middle_initial.nil?
    name += last_name
  end
end
</pre>
<p class="title">Notre mod&egrave;le <code>User</code> comme il &eacute;tait &agrave; la fin du dernier &eacute;pisode..</p>

<h3>Tester</h3>
<p>Avant de refactoriser notre mod&egrave;le <code>User</code>, int&eacute;ressons nous aux tests. Les tests et la refactorisation vont main dans la main, du fait que la refactorisation a pour but d&#x27;am&eacute;liorer notre code sans modifier son comportement. Une bonne couverture de test assure que notre refactorisation n&#x27;affecte pas ce que le code fait. Quand un mod&egrave;le est cr&eacute;&eacute; dans une application Rails, un fichier de test pour ce mod&egrave;le est automatiquement cr&eacute;&eacute;. Regardons un peu le fichier <code>user_test.rb</code> dans le r&eacute;pertoire <code>/test/unit</code><a href="#fn1"><sup>1</sup></a>.</p>
<pre class="ruby">
require &#x27;test_helper&#x27;

class UserTest &lt; ActiveSupport::TestCase
  # Replace this with your real tests.
  test &quot;the truth&quot; do
    assert true
  end
end
</pre>
<p class="title">Le test par d&eacute;faut soumis par Rails.</p>
<p>Il y a un test soumis par d&eacute;faut dans le code ci-dessus qui affirme simplement que <code>true == true</code>. Nous allons le remplacer avec le premier test de notre cru, en cr&eacute;ant un utilisateur sans initiale et en v&eacute;rifiant que le nom complet que nous attendons est bien celui renvoy&eacute;.</p>
<pre class="ruby">
test &quot;full name without middle initial&quot; do
  user = User.new(:first_name =&gt; &quot;John&quot;, :last_name =&gt; &quot;Smith&quot;)
  assert_equal &#x27;John Smith&#x27;, user.full_name
end
</pre>
<p class="title">Notre premier test contr&ocirc;le un nom sans initiale.</p>

<p>Pour ex&eacute;cuter nos tests nous pouvons lancer la commande <code>rake test</code> depuis un terminal &agrave; partir du dossier de notre application mais nous allons utiliser AutoTest<a href="#fn2"><sup>2</sup></a>. Pour l&#x27;utiliser, installez la gem ZenTest (<code>sudo gem install ZenTest</code>). AutoTest a l&#x27;avantage de continuellement ex&eacute;cuter nos tests ce qui fait qu&#x27;il est facile de voir quand nous cassons quelque chose. Nous allons lancer <code>autotest</code> et voir les r&eacute;sultats que nous obtenons.</p>
<pre class="terminal">
Laa-Laa:ep11 eifion$ autotest
loading autotest/rails
/usr/local/bin/ruby -I.:lib:test -rtest/unit -e &quot;%w[test/functional/users_controller_test.rb test/unit/user_test.rb].each { |f| require f }&quot; | unit_diff -u
Loaded suite -e
Started
.
Finished in 0.046945 seconds.

1 tests, 1 assertions, 0 failures, 0 errors
</pre>
<p class="title">Sortie d&#x27;AutoTest</p>
<p>Notre premier test est pass&eacute; ! Maintenant nous allons cr&eacute;er un autre test pour un nom avec une initial en ajoutant la m&eacute;thode ci-dessous &agrave; notre classe <code>UserTest</code>.</p>
<pre class="ruby">
test &quot;full name with middle initial&quot; do
  user = User.new(:first_name =&gt; &quot;Paul&quot;, :middle_initial =&gt; &quot;P&quot;, :last_name =&gt; &quot;Hughes&quot;)
  assert_equal &#x27;Paul P. Hughes&#x27;, user.full_name
end
</pre>
<p>Quand vous enregistrer le fichier test, AutoTest devrait automatiquement r&eacute;-ex&eacute;cuter les tests. Tous les tests devraient r&eacute;ussir.</p>

<h3>Refactorisation</h3>
<p>Maintenant que nous savons que notre m&eacute;thode <code>full_name</code> se comporte comme voulu nous pouvons commencer &agrave; la remanier. L&#x27;utilisation de la variable locale dans la m&eacute;thode et la concat&eacute;nation de chaine ne semble pas n&eacute;cessaire donc nous allons l&#x27;enlever. &Agrave; la place, nous pourrions mettre chaque partie du nom de l&#x27;utilisateur dans un tableau et les relier avec un espace.</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  def full_name
    [first_name, middle_initial, last_name].join(&#x27; &#x27;)
  end
end
</pre>
<p class="title">Premi&egrave;re refactorisation de notre classe <code>User</code>.</p>

<p>Quand nous enregistrons le fichier, les tests devraient &ecirc;tre ex&eacute;cut&eacute;s automatiquement et nous pouvons voir qu&#x27;ils &eacute;chouent tous deux.</p>
<pre class="terminal">
  1) Failure:
  test_full_name_with_middle_initial(UserTest)
  [./test/unit/user_test.rb:11:in `test_full_name_with_middle_initial&#x27;
  /usr/local/lib/ruby/gems/1.8/gems/activesupport-2.2.2/lib/active_support/testing/setup_and_teardown.rb:60:in `run&#x27;]:
  --- /var/folders/yD/yDkhXjIsHAqkCTKsBbUlC++++TI/-Tmp-/expect31666.0    2009-01-04 11:23:35.000000000 +0000
  +++ /var/folders/yD/yDkhXjIsHAqkCTKsBbUlC++++TI/-Tmp-/butwas31666.0    2009-01-04 11:23:35.000000000 +0000
  @@ -1 +1 @@
  -Paul P. Hughes
  +Paul P Hughes

  2) Failure:
  test_full_name_without_middle_initial(UserTest)
  [./test/unit/user_test.rb:6:in `test_full_name_without_middle_initial&#x27;
  /usr/local/lib/ruby/gems/1.8/gems/activesupport-2.2.2/lib/active_support/testing/setup_and_teardown.rb:60:in `run&#x27;]:
  --- /var/folders/yD/yDkhXjIsHAqkCTKsBbUlC++++TI/-Tmp-/expect31666.1    2009-01-04 11:23:35.000000000 +0000
  +++ /var/folders/yD/yDkhXjIsHAqkCTKsBbUlC++++TI/-Tmp-/butwas31666.1    2009-01-04 11:23:35.000000000 +0000
  @@ -1 +1 @@
  -John Smith
  +John  Smith

  2 tests, 2 assertions, 2 failures, 0 errors
</pre>
<p class="title">Rendu d&#x27;AutoTest montrant les &eacute;checs des tests unitaires.</p>

<p>Le premier test &eacute;choue parce qu&#x27;il n&#x27;y pas de point apr&egrave;s l&#x27;initiale; Le second &eacute;choue parce qu&#x27;il y a deux espaces entre le pr&eacute;nom et le nom. Nous allons essayer de r&eacute;parer le deuxi&egrave;me test d&#x27;abord. Il y a deux espaces parce que l&#x27;initiale vaut <code>nil</code> et que nous joignons chaque partie du tableau avec un espace. Nous pouvons r&eacute;parer &ccedil;a en appelant la m&eacute;thode <code>compact</code> sur le tableau avant de joindre chaque partie. (<code>compact</code> supprime toutes les valeurs <code>nil</code> d&#x27;un tableau.)</p>
<pre class="ruby">
def full_name
  [first_name, middle_initial, last_name].compact.join(&#x27; &#x27;)
end
</pre>
<p>Maintenant, uniquement notre premier test &eacute;choue : nous avons besoins du point apr&egrave;s l&#x27;initiale. Nous allons corriger en cr&eacute;ant une nouvelle m&eacute;thode dans la classe <code>User</code> que l&#x27;on nommera <code>middle_initial_with_full_stop</code>.</p>
<pre class="ruby">
def full_name
  [first_name, middle_initial_with_full_stop, last_name].compact.join(&#x27; &#x27;)
end  

def middle_initial_with_full_stop
  &quot;#{middle_initial}.&quot; unless middle_initial.blank?
end
</pre>
<p>Nos tests passent maintenant mais il y a une condition que nous n&#x27;avons pas test&eacute;. Que ce passe-t&#x27;il si l&#x27;initiale est une chaine vide (donc diff&eacute;rente de <code>nil</code>) ? On peut &eacute;crire un test pour &ccedil;a et voir ce qui se passe.</p>
<pre class="ruby">
test &quot;full name with empty middle initial&quot; do
  user = User.new(:first_name =&gt; &quot;John&quot;, :middle_initial =&gt; &quot;&quot;, :last_name =&gt; &quot;Jones&quot;)
  assert_equal &#x27;John Jones&#x27;, user.full_name
end
</pre>
<p>&Ccedil;a passe &eacute;galement. La m&eacute;thode <code>blank?</code> pour une chaine retournera <code>true</code> pour une valeur <code>nil</code> ou une chaine vide, donc notre nom avec une initiale vide retourne toujours le r&eacute;sultat attendu.</p>

<p>Le code de notre mod&egrave;le <code>User</code> a meilleure allure qu&#x27;auparavant. Il y a toujours quelque duplication dans le code de test pourtant. Nous verrons &ccedil;a dans le prochain &eacute;pisode.</p>

<h3>Code final</h3>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  def full_name
    [first_name, middle_initial_with_full_stop, last_name].compact.join(&#x27; &#x27;)
  end  

  def middle_initial_with_full_stop
    &quot;#{middle_initial}.&quot; unless middle_initial.blank?
  end
end
</pre>
<p class="title">La classe <code>User</code> apr&egrave;s refactorisation.</p>
<pre class="ruby">
  require &#x27;test_helper&#x27;
  class UserTest &lt; ActiveSupport::TestCase
    test &quot;full name without middle initial&quot; do
      user = User.new(:first_name =&gt; &quot;John&quot;, :last_name =&gt; &quot;Smith&quot;)
      assert_equal &#x27;John Smith&#x27;, user.full_name
    end

    test &quot;full name with middle initial&quot; do
      user = User.new(:first_name =&gt; &quot;Paul&quot;, :middle_initial =&gt; &quot;P&quot;, :last_name =&gt; &quot;Hughes&quot;)
      assert_equal &#x27;Paul P. Hughes&#x27;, user.full_name
    end

    test &quot;full name with empty middle initial&quot; do
      user = User.new(:first_name =&gt; &quot;John&quot;, :middle_initial =&gt; &quot;&quot;, :last_name =&gt; &quot;Jones&quot;)
      assert_equal &#x27;John Jones&#x27;, user.full_name
    end
  end
</pre>
<p class="title">Les tests pour la classe <code>User</code>.</p>

<h3>Notes</h3>
<ol class="footnotes">
  <li id="fn1">Le RailsCast de cet &eacute;pisode est bas&eacute; sur Rails 1. Le code ci-dessus a &eacute;t&eacute; &eacute;crit pour Rails 2.2.</li>
  <li id="fn2"><a href="http://rubyforge.org/projects/zentest/">http://rubyforge.org/projects/zentest/</a></li>
</ol>

