<p>En el episodio de esta semana nos saldremos un poco del gui&oacute;n, vamos a mostrar algunas de las aplicaciones web de 2009 m&aacute;s &uacute;tiles para los desarrolladores Rails: cada una de las siguientes aplicaciones servir&aacute; para  mejorar en una forma u otra nuestras aplicaciones Rails. Empecemos con la primera.</p>

<h3>Github</h3>

<div class="imageWrapper">
  <img src="/system/photos/281/original/E195I01.png" alt="La portada de Github." width="839" height="593" />
</div>

<p>La primera aplicaci&oacute;n no necesita presentaci&oacute;n: <a href="http://github.com/">Github</a>.  Si eres un programador, ya deber&iacute;as conocerla.  Github tiene algunas funcionalidades que son menos conocidas pero no por ello son menos &uacute;tiles, por ejemplo los 
<a href="http://gist.github.com/">Gists</a>, que son una forma sencilla de compartir fragmentos de c&oacute;digo.  Tambi&eacute;n merece la pena echar un vistazo a la secci&oacute;n de ayuda en Github porque contiene diversos art&iacute;culos para aprovechar al m&aacute;ximo Git y Github.</p>

<h3>Gemcutter</h3>

<div class="imageWrapper">
  <img src="/system/photos/282/original/E195I02.png" alt="La portada de Gemcutter" width="824" height="597" />
</div>

<p>La segunda aplicaci&oacute;n de nuestra lista es <a href="http://gemcutter.org/">Gemcutter</a>: el lugar definitivo donde alojar nuestras gemas. Ya hablamos de Gemcutter en el episodio 183 [<a href="http://railscasts.com/episodes/183-gemcutter-jeweler">verlo</a>, <a href="http://asciicasts.com/episodes/183-gemcutter-jeweler">leerlo</a>], pero desde entonces se ha hecho incluso m&aacute;s f&aacute;cil de usar.  Antes hab&iacute;a que ejecutar el comando <code>gem tumble</code> para instalar las gemas desde Gemcutter pero ya no hace falta hacerlo porque el servicio de alojamiento de gemas de RubyForge apunta a Gemcutter.</p>

<p>Lo que hace m&aacute;s valioso a Gemcutter es la facilidad con la que nos permite publicar nuestras propias gemas.  S&oacute;lo hacen falta tres pasos que son los que se ven en la captura de pantalla anteiror.  La &uacute;nica parte potencialmente dif&iacute;cil es crear un archivo <code>gemspec</code> pero para facilitar las cosas podemos partir del fichero gemspec de otra gema como plantilla.  Un buen ejemplo es <a 
href="http://github.com/ryanb/cancan/blob/master/cancan.gemspec">el archivo gemspec de la gema CanCan de RyanBates</a>.</p>

<pre class="ruby">Gem::Specification.new do |s|
&nbsp;&nbsp;s.name = &quot;cancan&quot;
&nbsp;&nbsp;s.summary = &quot;Simple authorization solution for Rails.&quot;
&nbsp;&nbsp;s.description = &quot;Simple authorization solution for Rails which is completely decoupled from the user&#x27;s roles. All permissions are stored in a single location for convenience.&quot;
&nbsp;&nbsp;s.homepage = &quot;http://github.com/ryanb/cancan&quot;
&nbsp;&nbsp;
&nbsp;&nbsp;s.version = &quot;1.0.2&quot;
&nbsp;&nbsp;s.date = &quot;2009-12-30&quot;
&nbsp;&nbsp;
&nbsp;&nbsp;s.authors = [&quot;Ryan Bates&quot;]
&nbsp;&nbsp;s.email = &quot;ryan@railscasts.com&quot;
&nbsp;&nbsp;
&nbsp;&nbsp;s.require_paths = [&quot;lib&quot;]
&nbsp;&nbsp;s.files = Dir[&quot;lib/**/*&quot;] + Dir[&quot;spec/**/*&quot;] + [&quot;LICENSE&quot;, &quot;README.rdoc&quot;, &quot;Rakefile&quot;, &quot;CHANGELOG.rdoc&quot;, &quot;init.rb&quot;]
&nbsp;&nbsp;s.extra_rdoc_files = [&quot;README.rdoc&quot;, &quot;CHANGELOG.rdoc&quot;, &quot;LICENSE&quot;]
&nbsp;&nbsp;
&nbsp;&nbsp;s.has_rdoc = true
&nbsp;&nbsp;s.rdoc_options = [&quot;--line-numbers&quot;, &quot;--inline-source&quot;, &quot;--title&quot;, &quot;CanCan&quot;, &quot;--main&quot;, &quot;README.rdoc&quot;]
&nbsp;&nbsp;
&nbsp;&nbsp;s.rubygems_version = &quot;1.3.4&quot;
&nbsp;&nbsp;s.required_rubygems_version = Gem::Requirement.new(&quot;&gt;= 1.2&quot;)
end
</pre>

<p>Siempre podemos partir de un fichero como el anterior para adaptarlo a nuestros proyectos. Es f&aacute;cil cambiarlo directamente cada vez que creamos una nueva versi&oacute;n de nuestra gema, y despu&eacute;s empaquetarlo todo para publicar la nueva versi&oacute;n.</p> 

<h3>Caliper</h3>
<div class="imageWrapper">
  <img src="/system/photos/283/original/E195I03.png" alt="La portada de Caliper." width="824" height="597" />
</div>

<p>A continuaci&oacute;n viene  <a href="http://getcaliper.com/">Caliper</a>. Tal vez recordeis que en el episodio 166 [<a href="http://railscasts.com/episodes/166-metric-fu">ver</a>, <a href="http://asciicasts.com/episodes/166-metric-fu">leer</a>] tratamos la gema metric_fu.  Caliper es, b&aacute;sicamente, una versi&oacute;n online de metric_fu y es una forma estupenda de recopilar informaci&oacute;n m&eacute;trica sobre cualquier aplicaci&oacute;n Rails alojada en un repositorio Git. S&oacute;lo hay que introducir la URL del repositorio concreto y al cabo de unos segundos devolver&aacute; todas las m&eacute;tricas relevantes para ese proyecto.</p>

<div class="imageWrapper">
  <img src="/system/photos/284/original/E195I04.png" 
alt="" width="832" height="747" />
</div>

<p>Se puede ver informaci&oacute;n sobre los ratios entre c&oacute;digo y pruebas, c&oacute;digo sospechoso y otros detalles sobre nuestras aplicaciones Rails para que mejoremos el c&oacute;digo o utilizarla para examinar otros proyectos que nos resulten de inter&eacute;s.  Si encontramos una gema o plugin que queremos usar podemos pasarlo por Caliper para ver c&oacute;mo de grande es la base de c&oacute;digo y si est&aacute; bien escrita y dise&ntilde;ada.</p>

<h3>Rdoc.info</h3>

<div class="imageWrapper">
  <img src="/system/photos/285/original/E195I05.png" alt="La portada de rdoc.info" width="819" height="471" />
</div>

<p>Otro sitio web muy &uacute;til es  <a href="http://rdoc.info/">rdoc.info</a>. Si buscamos documentaci&oacute;n de un proyecto escrito en Ruby alojado en Github, podemos visitar este site y buscar el proyecto que nos interesa.  Si no est&aacute; listado podemos a&ntilde;adirlo y se generar&aacute; (y publicar&aacute;) su documentaci&oacute;n.</p>

<h3>RunCodeRun</h3>
<div class="imageWrapper">
  <img src="/system/photos/286/original/E195I06.png" alt="La portada de RunCodeRun." width="808" height="550" />
</div>

<p>Otra aplicaci&oacute;n interesante es <a href="http://runcoderun.com/">RunCodeRun</a>, que es un sencillo servidor de integraci&oacute;n continua.  Tan s&oacute;lo hace falta indicarle una aplicaci&oacute;n en un repositorio Github y ejecutar&aacute; los tests de dicha aplicaci&oacute;n y notificar&aacute; si pasan o fallan.  Una vez que se han ejecutado los tests podemos inspecionar el proyecto para ver cu&aacute;les pasan o fallan.  RunCodeRun es gratuito para los repositorio p&uacute;blicos.</p>

<p>RunCodeRun utiliza la tarea rake por defecto de nuestra aplicaci&oacute;n, lo que quiere decir que la podemos modificar para hacer lo que queramos. En el <code>Rakefile</code> de la apicaci&oacute;n podr&iacute;amos hacer que apuntase a las tareas <code>:spec</code> y <code>:features</code> para que se ejecuten los tests de Rspec y Cucumber.</p>

<pre class="ruby">
task :default =&gt; [:spec, :features]
</pre>

<h3>The Ruby Toolbox</h3>

<div class="imageWrapper">
  <img src="/system/photos/287/original/E195I07.png" alt="La portada de The Ruby Toolbox." width="851" height="593" />
</div>

<p><a href="http://www.ruby-toolbox.com/">The Ruby Toolbox</a> es un gran recurso. Con frecuencia, cuando estamos desarrollando una nueva aplicaci&oacute;n Rails nos preguntamos qu&eacute; gema o plugin podr&iacute;amos usar para realizar alguna tarea.  The Ruby Toolbox es una forma excelente de encontrar las gemas o plugins que est&aacute;n disponibles para las diferentes tareas.  Por ejemplo si en nuestra aplicaci&oacute;n necesitamos implementar versionado de  modelos podr&iacute;amos ver qu&eacute; proyectos hay disponibles y c&oacute;mo usarlos.</p>

<h3>New Relic</h3>
<div class="imageWrapper">
  <img src="/system/photos/288/original/E195I08.png" alt="La portada de New Relic." width="851" height="593" />
</div>

<p>Otra aplicaci&oacute;n que deber&iacute;amos usar en todas las aplicaciones Rails en producci&oacute;n que tengamos es <a href="http://newrelic.com/">NewRelic RPM</a>. Es una aplicaci&oacute;n inmensamente &uacute;til para encontrar problemas de rendimiento en nuestras aplicaciones  Incluso la versi&oacute;n gratuita, RPM Lite, proporciona suficiente informaci&oacute;n como para encontrar los cuellos de botella en nuestra aplicaci&oacute;n y para monitorizar su ejecuci&oacute;n.</p>

<h3>Learnivore</h3>

<div class="imageWrapper">
  <img src="/system/photos/289/original/E195I09.png" alt="La portada de Learnivore." width="851" height="593" />
</div>

<p>Si somos aficionados a los screencasts <a  href="http://www.learnivore.com/search">Learnivore</a> es un sitio genial. Agrega un gran n&uacute;mero de screncasts (gratis y de pago) incluyendo los Railscasts. Es un recurso que merece la pena comprobar.</p>

<p>Por &uacute;ltimo, Ryan ha sido tan amable de mencionar ASCIIcasts como uno de sus sitios favoritos, pero dado que ya est&aacute;s aqu&iacute; ya sabes todo lo que hay que saber.</p>