<p>Supongamos que queremos enviar correos en en formato HTML.  Codificamos nuestro HTML como de costumbre, usando posicionamiento y flotaciones CSS para que tenga el aspecto que queremos tras lo cual lo probamos en un navegador y todo parece correcto.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/918/original/E312I01.png" width="800" height="416" alt="Our HTML email viewed in the browser."/>
</div>

<p>Tras lo cual decidimos envi&aacute;rselo a nuestros miles de suscriptores s&oacute;lo para descubrir que el correo se ve fatal en ciertos clientes.  &iquest;Qu&eacute; podemos hacer?</p>

<p>Por suerte hay mucho material acerca de cu&aacute;les son las mejores pr&aacute;cticas para enviar correos en HTML que se pueden encontrar con una sencilla b&uacute;squeda de Google, como  <a href="http://net.tutsplus.com/tutorials/html-css-techniques/20-email-design-best-practices-and-resources-for-beginners/">este</a> por ejemplo.  Un punto importante que toca es que los contenidos se deben disponer usando tablas en lugar de CSS, lo que quiere decir que tendremos que despedirnos de nuestro bonito HTML sem&aacute;ntico y utilizar  tablas como en los viejos tiempos.  No es algo especialmente bonito pero funcionar&aacute;.</p>

<p>Otro punto importante del art&iacute;culo es que cuando usamos CSS en nuestros correos deber&iacute;amos incluir los estilos en l&iacute;nea porque muchos clientes web ignoran los contenidos de la etiqueta <code>head</code>, lo que significa que todas las hojas CSS que usemos deben estar en atributos de estilo dentro de los propios elementos HTML.  Esto puede dar muchos dolores de cabeza a la hora del mantenimiento pero por suerte hay algunas herramientas que nos pueden ser de ayuda.  Por ejemplo Mailchimp proporciona una  <a href="http://beaker.mailchimp.com/inline-css">aplicaci&oacute;n Web</a> donde podemos pegar c&oacute;digo HTML y CSS y lo podemos convertir de forma que los estilos aparezcan en l&iacute;nea.</p>

<p>Hay varias herramientas que hacen esto por nosotros si tenemos que enviar correos de HTML desde una aplicaci&oacute;n Rails.  Una de ellas es la gema <a href="https://github.com/fphilipe/premailer-rails3">Premailer Rails 3</a> que a su vez utiliza la gema <a href="https://github.com/alexdunae/premailer">Premailer gem</a>.  Otra gema para esto es  <a href="https://github.com/Mange/roadie">Roadie</a>, que parte de MailStyle.  Son sencillas de configurar y para verlo crearemos una nueva aplicaci&oacute;n llamada <code>mailit</code> y crearemos un nuevo <em>mailer</em> llamado <code>newsletter_mailer</code>.</p>

``` terminal
$ rails new mailit
$ cd mailit
$ rails g mailer newsletter_mailer weekly
      create  app/mailers/newsletter_mailer.rb
      invoke  erb
      create    app/views/newsletter_mailer
      create    app/views/newsletter_mailer/weekly.text.erb
      invoke  test_unit
      create    test/functional/newsletter_mailer_test.rb
```	  

<p>He aqu&iacute; el c&oacute;digo generado de <code>newsletter_mailer</code>.</p>


``` /app/mailers/newsletter_mailer.rb
class NewsletterMailer < ActionMailer::Base
  default from: "from@example.com"

  # Subject can be set in your I18n file at config/locales/en.yml
  # with the following lookup:
  #
  #   en.newsletter_mailer.weekly.subject
  #
  def weekly
    @greeting = "Hi"

    mail to: "to@example.org"
  end
end
```
<p>Modificaremos la acci&oacute;n <code>weekly</code> para que podamos pasar una direcci&oacute;n de correo y estableceremos el asunto.</p>


``` /app/mailers/newsletter_mailer.rb
def weekly(email)
  @greeting = "Hi"

  mail to: email, subject: "RailsCasts Weekly"
end
```

<p>Siempre es buena idea disponer de una versi&oacute;n de texto plano de los correos que enviemos, y ya tenemos una plantilla para ello.</p>

``` /app/views/newsletter_mailer/weekly.text.erb
RailsCasts - Ruby on Rails Screencasts

Weekly Episodes

---------------------------------------------

Episode 310: Getting Started with Rails

Learning Ruby on Rails can be overwhelming, especially if you are new to programming. Here I will take you on a tour through various resources to help get started with Rails.

Watch Episode (7 minutes):
http://railscasts.com/episodes/310-getting-started-with-rails

---------------------------------------------

(se omite el resto del archivo)
```

<p>A continuaci&oacute;n escribiremos la versi&oacute;n HTML.</p>


``` /app/views/newsletter_mailer/weekly.html.erb
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>RailsCasts Weekly</title>
  <style type="text/css">
  body, td { color:#000000; font-size:14px; font-family:Verdana,Helvetica,Arial; }
  .divider { background-color:#555555; height:2px; }
  .episode h2 { margin-top:0; margin-bottom:8px; font-size:18px; }
  .episode p { margin:8px 0; }
  .episode img { border:solid 1px #777777; }
  .episode .duration { font-size:11px;color:#555555; }
  #footer { font-size:11px; color:#555555; }
  #footer a { color:#555555;}
  </style>
</head>
<body>
  <table width="100%" id="background" border="0" cellpadding="0" cellspacing="0">
    <tr><td align="center" valign="top">
      <table width="650" id="main" border="0" cellpadding="0" cellspacing="20">
        <tr>
          <td id="header" colspan="2">
            <a href="http://railscasts.com/"><img src="http://railscasts.com/images/railscasts_logo.png" width="423" height="56" alt="RailsCasts"></a>
          </td>
        </tr>
        <tr>
          <td class="divider" colspan="2" bgcolor="#555555" height="2"></td>
        </tr>
        <tr class="episode">
          <td>
            <a href="#"><img src="http://railscasts.com/assets/episodes/stills/310-getting-started-with-rails.png" width="200" height="125" alt="#310 Getting Started with Rails"></a>
          </td>
          <td valign="top">
            <h2>#310 Getting Started with Rails</h2>
            <p>Learning Ruby on Rails can be overwhelming, especially if you are new to programming. Here I will take you on a tour through various resources to help get started with Rails.</p>
            <p>
              <a href="#">Watch Episode</a>
              <span class="duration">(7 minutes)</span>
            </p>
          </td>
        </tr>
        <tr>
          <td class="divider" colspan="2" bgcolor="#555555" height="2"></td>
        </tr>
        <tr>
          <td id="footer" colspan="2" align="center">
            <p><a href="#">Unsubscribe</a> if you do not wish to receive these emails in the future.</p>
            <p>&copy;2011 RailsCasts</p>
          </td>
        </tr>
      </table>
    </td></tr>
  </table>
</body>
</html>
```

<p>Obs&eacute;rvese que hemos dado estilos a la versi&oacute;n HTML con una etiqueta <code>style</code> en la cabecera.  Estos estilos pasar&aacute;n a ser en l&iacute;nea din&aacute;micamente cuando utilicemos Premailer o Roadie.  Tambi&eacute;n podr&iacute;amos usar una hoja externa de estilos con un enlace normal y tendr&iacute;amos el mismo resultado.  Para que esto ocurra tenemos que a&ntilde;adir una de estas dos gemas a nuestra aplicaci&oacute;n.  En el caso de  Premailer tendremos que a&ntilde;adir la propia gema y Nokogiri o Hpricot, pues necesita de una de las dos.</p>

``` /Gemfile
gem 'hpricot'
gem 'premailer-rails3'
```

<p>Como vamos a usar roadie lo a&ntilde;adiremos y luego ejecutaremos <code>bundle</code> para instalarlo.</p>

```/Gemfile
gem 'roadie'
```

<p>Para hacer pruebas en nuestro entorno de desarrollo tendremos que ajustar ciertas configuraciones del correo en el fichero de <code>config/environments/development.rb</code>.</p>


``` /config/environments/development.rb
Mailit::Application.configure do
  config.action_mailer.default_url_options = { host: "railscasts.com" }
  config.action_mailer.raise_delivery_errors = true
  config.action_mailer.delivery_method = :smtp
  config.action_mailer.smtp_settings = {
    address: "smtp.gmail.com",
    port: 587,
    domain: "railscasts.com",
    authentication: "plain",
    enable_starttls_auto: true,
    user_name: ENV["GMAIL_USERNAME"],
    password: ENV["GMAIL_PASSWORD"]
  }
  # Rest of file omitted.
end
```

<p>Aqu&iacute; hacemos varias cosas.  Establecemos la opci&oacute;n <code>default_url_options</code> en nuestro dominio; nos aseguramos de que se muestran los errores de entrega para poder verlos si tenemos alg&uacute;n problema enviando los correos y establecemos el m&eacute;todo de envi&oacute; a SMTP para a&ntilde;adir la configuraci&oacute;n adecuada de nuestro servidor de correo.  Utilizamos variables de entorno para nuestro usuario y clave pero si quisi&eacute;ramos podr&iacute;amos establecerlas directamente.</p>

<p>Con nuestro gestor de env&iacute;os configurado podemos hacer una prueba con la consola de Rails.  Al hacerlo puede ser que veamos una advertencia de la gema CSS Parser, pero no hay nada que podamos hacer en este caso.  De todas formas esto no deber&iacute;a causar problemas (y es de suponer que ser&aacute; corregido pronto).  Podemos enviar un correo de prueba.</p>

``` terminal
> NewsletterMailer.weekly(&#x27;railscasts.example@gmail.com&#x27;).deliver
```

<p>Tras hacer esto vemos que se env&iacute;a nuestro correo y tiene buen aspecto.</p>

<p>Los que vayan a usar una de estas gemas deber&iacute;an leer bien la documentaci&oacute;n disponible en las p&aacute;ginas de GitHub porque no lo hemos visto todo en este episodio.  Por ejemplo con la gema Roadie se puede pasar una opci&oacute;n <code>css</code> al m&eacute;todo de correo para especificar qu&eacute; ficheros se deber&iacute;an incluir en l&iacute;nea.</p>