<p>Mediante el c&aacute;lculo de m&eacute;tricas de c&oacute;digo podemos encontrar qu&eacute; partes de nuestra aplicaci&oacute;n pueden mejorarse.  Una de las herramientas definitivas para obtener este tipo de m&eacute;tricas en Ruby es  <a href="http://metric-fu.rubyforge.org/">metric_fu</a>, que ya vimos en el episodio 166  [<a href="http://railscasts.com/episodes/166-metric-fu">verlo</a>, <a href="http://asciicasts.com/episodes/166-metric-fu">leerlo (en ingl&eacute;s)</a>].  El &uacute;nico problema que tiene esta gema es que es algo complicada de instalar porque tiene muchas dependencias, sobre todo para usarla en una aplicaci&oacute;n Rails 3.  El  <a href="http://getcaliper.com/">Proyecto Caliper</a> era una alternativa interesante porque pod&iacute;a acoplarse a cualquier proyecto en GitHub para obtener sus m&eacute;tricas, pero por desgracia el sitio ha cerrado.</p>

<p>As&iacute; que aqu&iacute; estamos de vuelta, teniendo que ejecutar las m&eacute;tricas en nuestra m&aacute;quina local.  Ahora existe una gema llamada <a href="http://iain.nl/2010/11/easier-metricfu-with-metrical/">Metrical</a> que facilita esta tarea.  Metrical utiliza metric_fu en segundo plano, proporcionando adem&aacute;s una herramienta de l&iacute;nea de &oacute;rdenes que hace m&aacute;s f&aacute;cil su uso.</p>
	

<p>Vamos a hacer una demostraci&oacute;n de Metrical ejecut&aacute;ndola contra el c&oacute;digo fuente del sitio web de Railscasts.  Primero vamos a instalar la gema Metrical.</p>

<pre class="terminal">$ gem install metrical</pre>

<p>Con la instalaci&oacute;n de esta gema tambi&eacute;n se instalar&aacute;n otras dependencias. Una vez que est&eacute;n todas podemos ejecutar la orden <code>metrical</code> desde el directorio de nuestra aplicaci&oacute;n, lo que evaluar&aacute; varias m&eacute;tricas sobre el c&oacute;digo fuente de la aplicaci&oacute;n utilizando <code>metric_fu</code>.  Cuando lo hagamos probablemente nos encontremos varios errores, pero los podemos ignorar en su mayor&iacute;a siempre que la orden termine correctamente, lo que sabremos porque los resultados se abrir&aacute;n en nuestro navegador.</p>

<div class="imageWrapper">
  <img src="/system/photos/566/original/E252I01.png" width="808" height="465" alt="Los resultados de la ejecuci칩n de Metrical."/>
</div>

<p>La primera p&aacute;gina enumera las diferentes herramientas de medici&oacute;n de que dispone <code>metric_fu</code>, y podemos hacer clic en cualquiera de ellas para ver los resultados que ha generado.  Por ejemplo si nos fijamos en Reek veremos mucha informaci&oacute;n &uacute;til sobre &aacute;reas de la aplicaci&oacute;n que se pueden mejorar.</p>

<div class="imageWrapper">
  <img src="/system/photos/567/original/E252I02.png" width="808" height="465" alt="Los resultados de Reek."/>
</div>

<p>Veamos a continuaci&oacute;n otra de las herramientas, RCov.  De todas las m&eacute;tricas que utiliza Metrical, RCov es la que casi con toda seguridad fallar&aacute; porque requiere ejecutar los tests y especificaciones de la aplicaci&oacute;n.  Si ejecutamos RCov sobre el c&oacute;digo de Railscasts, se calcular&aacute; una cobertura del 0.0%.  El problema aqu&iacute; es que el c&oacute;digo utiliza Ruby 1.9, que todav&iacute;a no est&aacute; soportado por RCov.  Antes de buscar alternativas tendremos que quitar RCov de nuestro juego de m&eacute;tricas.  Para configurar el comportamiento de <code>metric_fu</code> bajo Metrical podemos a&ntilde;adir un fichero <code>.metrics</code> en el directorio de nuestra aplicaci&oacute;n</p>

<p class="codeFilePath">/.metrics</p>
<pre class="ruby">MetricFu::Configuration.run do |config|
	config.metrics -= [:RCov]
end</pre>

<p>Si ahora ejecutamos <code>metrical</code> veremos menos errores porque la secci&oacute;n de RCov ya no aparece en los resultados.  Pero es muy importante saber la cobertura de tests de nuestro c&oacute;digo, as&iacute; que &iquest;qu&eacute; podemos utilizar en lugar de RCov?  Hay varias alternativas que podemos usar,  <a href="http://www.metabates.com/2010/08/13/coverme-code-coverage-for-ruby-1-9/">CoverMe</a> y <a href="https://github.com/colszowka/simplecov">SimpleCov</a>. Las dos producen buenos resultados, pero nosotros escogeremos usar SimpleCov porque es un poquito m&aacute;s f&aacute;cil de configurar.  Primero tenemos que a&ntilde;adir la referencia a la gema en el <code>Gemfile</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">group :test do
  gem &#x27;simplecov&#x27;, &#x27;&gt;=0.3.8&#x27;, :require =&gt; false
end</pre>

<p>A continuaci&oacute;n a&ntilde;adiremos las siguientes dos l&iacute;neas al fichero <em>helper</em> de tests o especificaciones:</p>

<p class="codeFilePath">/spec/spec_helper.rb</p>
<pre class="ruby">require &#x27;simplecov&#x27;
SimpleCov.start &#x27;rails&#x27;</pre>

<p>Como siempre, cuando a&ntilde;adimos una gema a una aplicaci&oacute;n tenemos que ejecutar <code>bundle</code> para que dicha gema quede instalada.  Despu&eacute;s de lo cual podemos ejecutar <code>rake spec</code> para lanzar los tests de la aplicaci&oacute;n y luego <code>open coverage/index.html</code> para ver los resultados.</p>

<div class="imageWrapper">
  <img src="/system/photos/568/original/E252I03.png" width="808" height="465" alt="La salida de SimpleCov."/>
</div>

<p>Es muy f&aacute;cil ver qu&eacute; ficheros son los que tienen m&aacute;s c&oacute;digo que no est&aacute; cubierto por tests o especificaciones porque son los que aparecen en la parte superior.  Si hacemos clic en uno de ellos, por ejemplo <code>comments_controller</code>, podemos ver exactamente qu&eacute; parte del c&oacute;digo no se encuentra cubierta por ning&uacute;n test.</p>

<div class="imageWrapper">
  <img src="/system/photos/569/original/E252I04.png" width="807" height="607" alt="Cobertura del c칩digo en SimpleCov."/>
</div>

<p>Con esto podemos ver exactamente para qu&eacute; c&oacute;digo tenemos que escribir m&aacute;s tests.</p>

<p>Ya tenemos una buena soluci&oacute;n para la cobertura de c&oacute;digo, por lo que ahora veremos las otras dos m&eacute;tricas que proporciona metric_fu, el Informe de Buenas Pr&aacute;cticas (&quot;Best Practices Report&quot;) y los Puntos Calientes (&quot;Hotspots&quot;).</p>

<p>En la vista de puntos calientes vemos un repaso de varios archivos, clases y m&eacute;todos, apareciendo los <em>peores</em> en primer lugar.  Para determinar cu&aacute;les son mejores y peores se tienen en cuenta varios factores, principalmente Reek y Flog, por lo que este es un buen sitio para descubrir qu&eacute; partes de nuestra aplicaci&oacute;n requieren que les dediquemos m&aacute;s atenci&oacute;n.</p>


<div class="imageWrapper">
  <img src="/system/photos/570/original/E252I05.png" width="807" height="607" alt="Informe de puntos calientes"/>
</div>

<p>El informe de buenas pr&aacute;cticas de Rails nos dice si nuestra aplicaci&oacute;n no cumple con ciertas buenas pr&aacute;cticas de uso general.</p>

<div class="imageWrapper">
  <img src="/system/photos/571/original/E252I06.png" width="807" height="607" alt="El informe de buenas pr치cticas."/>
</div>

<p>La salida de este informe resulta un poco rara cuando se abre en el navegador, pero podemos usar la gema directamente en vez de a trav&eacute;s de metric_fu.  Como ya hemos instalado Metrical esta gema ya deber&iacute;amos tenerla pero si no es as&iacute; podemos instalarla ejecutando</p>

<pre class="terminal">$ gem install rails_best_practices</pre>

<p>La orden anterior nos sugiere visitar el sitio  <a href="http://rails-bestpractices.com">Rails Best Practices </a>, as&iacute; que le haremos caso.</p>

<div class="imageWrapper">
  <img src="/system/photos/572/original/E252I07.png" width="806" height="465" alt="El sitio Rails Best Practices."/>
</div>

<p>En este sitio se enumera una larga lista de buenas pr&aacute;cticas que podemos inspeccionar y utilizar en nuestras propias aplicaciones Rails.  Bajo la pesta&ntilde;a  &ldquo;Implemented&rdquo; aparecen las pr&aacute;cticas cuyo uso detecta la gema y que son las que se comprobar&aacute;n cuando ejecutemos la orden  <code>rails_best_practices</code>.</p>

<p>Si ahora ejecutamos la orden veremos una serie de sugerencias en rojo.</p>


<pre class="terminal">$ rails_best_practices 
Analyzing:     100% |oooooooooooooooooooooooooooooooooooooooooo| Time: 00:00:00
<span style="color:#C00;">./app/controllers/comments_controller.rb:53 - move model logic into model (errors use_count &gt; 4)
./app/views/comments/index.rss.builder:10 - law of demeter
./app/views/comments/index.rss.builder:10 - law of demeter
./db/schema.rb:15 - always add db index (comments =&gt; [user_id])
./db/schema.rb:71 - always add db index (spam_reports =&gt; [comment_id])
./app/controllers/comments_controller.rb:28,32,41 - use before_filter for edit,update,destroy
...</span></pre> 

<p>El texto rojo puede ser dif&iacute;cil de leer, pero cambiando las opciones podemos pedir que la salida sea en HTML y tambi&eacute;n podemos hacer que los nombres de fichero sean enlaces para abrirlos en TextMate.</p>

<pre class="terminal">$ rails_best_practices -f html --with-textmate</pre>

<p>Esto generar&aacute; un archivo en HTML llamado <code>rails_best_practices.html</code> que podemos abrir con un navegador.</p>

<div class="imageWrapper">
  <img src="/system/photos/573/original/E252I08.png" width="806" height="465" alt="La salida del informe de buenas pr치cticas en el navegador."/>
</div>

<p>El an&aacute;lisis ha encontrado 26 problemas en esta aplicaci&oacute;n.  Si hacemos clic en cualquiera de los ficheros, &eacute;ste se abrir&aacute; en TextMate.  Haciendo clic en el mensaje de error iremos a la p&aacute;gina del sitio web donde se nos describe el problema correspondiente y c&oacute;mo podemos refactorizar nuestro c&oacute;digo para solucionarlo.  Con todo esto ya tenemos una lista sobre la que trabajar e ir mejorando nuestro c&oacute;digo.</p>

<p>Como con toda m&eacute;trica, estas recomendaciones no deber&iacute;an tomarse como palabra de Dios.  El que una t&eacute;cnica particular sea considerada una buena pr&aacute;ctica en general no quiere decir que sea lo mejor para nuestra aplicaci&oacute;n.  Debemos tomar la lista generada como una gu&iacute;a general para encontrar los sitios de nuestra aplicaci&oacute;n que podemos mejorar, pero no deber&iacute;amos obsesionarnos con dejar dicha lista vac&iacute;a, igual que con el resto de m&eacute;tricas que hemos visto.  No debemos incorporar todas estas sugerencias sin analizar si son convenientes para nuestra aplicaci&oacute;n y si mejoran el c&oacute;digo de la misma.  Las m&eacute;tricas s&oacute;lo son pistas que nos indican c&oacute;mo mejorar el c&oacute;digo, nada m&aacute;s.</p>
