<p>La m&eacute;trique est un tr&egrave;s bon moyen de faire de la revue de code et de trouver les parties de ce dernier qui peuvent &ecirc;tre am&eacute;lior&eacute;es. Un des meilleurs outils de m&eacute;trique pour Ruby est <a href="http://metric-fu.rubyforge.org/">metric_fu</a>, que nous avons d&eacute;j&agrave; vu dans l&#x27;&eacute;pisode 166 [<a href="http://railscasts.com/episodes/166-metric-fu">regarder</a>, <a href="http://fr.asciicasts.com/episodes/166-metric-fu">lire</a>]. Le seul souci est qu&#x27;il peut &ecirc;tre difficile &agrave; mettre en place en raison de son grand nombre de d&eacute;pendances, en particulier lorsqu&#x27;il est utilis&eacute; avec Rails&nbsp;3. Une bonne alternative &eacute;tait <a href="http://getcaliper.com/">le projet Caliper</a> qui permettait de prendre n&#x27;importe quel d&eacute;p&ocirc;t Github et d&#x27;en obtenir la m&eacute;trique. Ce projet a malheureusement ferm&eacute;.</p>

<p>Nous en revenons donc &agrave; lancer la m&eacute;trique sur notre machine locale. Il existe maintenant une gem, appel&eacute;e <a href="http://iain.nl/2010/11/easier-metricfu-with-metrical/">Metrical</a>, qui facilite grandement les choses. Metrical utilise metric_fu en arri&egrave;re plan mais fournit une commande qui permet d&#x27;en faciliter l&#x27;usage.</p>

<p>La d&eacute;monstration de Metrical sera effectu&eacute;e sur le code source du site Railscasts. Tout d&#x27;abord, nous devons installer la gem Metrical.</p>

<pre class="terminal">$ gem install metrical</pre>

<p>Installer cette gem va &eacute;galement installer un certain nombre de d&eacute;pendances. Une fois cela termin&eacute;, nous pouvons lancer la commande <code>metrical</code> dans le dossier de l&#x27;application et cela va faire tourner un ensemble de m&eacute;triques sur le code de cette derni&egrave;re via metric_fu. En faisant cela, nous allons probablement voir un certain nombre d&#x27;erreurs list&eacute;es en sortie mais, dans la majeur partie des cas, elles peuvent &ecirc;tre ignor&eacute;es tant que la commande fonctionne. Il est facile de voir si la commande a fonctionn&eacute; car elle ouvre le navigateur web.</p>

<div class="imageWrapper">
  <img src="/system/photos/566/original/E252I01.png" width="808" height="465" alt="The results from running Metrical."/>
</div>

<p>La premi&egrave;re page liste les diff&eacute;rents outils de m&eacute;trique que metric_fu a lanc&eacute;. Nous pouvons cliquer sur chacun d&#x27;eux pour voir le r&eacute;sultat qu&#x27;ils ont g&eacute;n&eacute;r&eacute;. Par exemple, si nous regardons Reek, nous pouvons voir de nombreuses informations utiles sur les parties de l&#x27;application qui peuvent &ecirc;tre am&eacute;lior&eacute;es.</p>

<div class="imageWrapper">
  <img src="/system/photos/567/original/E252I02.png" width="808" height="465" alt="The results from Reek."/>
</div>

<p>Maintenant, regardons un autre outil, Rcov. Parmi les outils utilis&eacute;s par Metrical, c&#x27;est celui dont l&#x27;&eacute;chec est le plus probable. Cela est d&ucirc; au fait qu&#x27;il n&eacute;cessite les tests et specs de l&#x27;application. Si nous le lan&ccedil;ons sur Railscasts, le taux de couverture du code sera de 0.0%. Le probl&egrave;me est que le code utilise Ruby en version 1.9, que Rcov ne supporte pas encore. Avant de regarder les alternatives, nous allons retirer Rcov de la liste des outils. Pour configurer metric_fu au travers de Metrical, nous devons ajouter un fichier <code>.metrics</code> dans le dossier de l&#x27;application.</p>

<p class="codeFilePath">/.metrics</p>
<pre class="ruby">MetricFu::Configuration.run do |config|
	config.metrics -= [:rcov]
end</pre>

<p>Lorsque nous lan&ccedil;ons <code>metrical</code> de nouveau, nous allons voir moins d&#x27;erreurs et la section Rcov ne fera plus partie des r&eacute;sultats. La couverture de code est une m&eacute;trique utile, qu&#x27;allons nous donc choisir pour remplacer Rcov&nbsp;? Il existe quelques alternatives que nous pouvons utiliser, <a href="http://www.metabates.com/2010/08/13/coverme-code-coverage-for-ruby-1-9/">CoverMe</a> et <a href="https://github.com/colszowka/simplecov">SimpleCov</a>. Les deux produisent de bons r&eacute;sultats mais nous choisirons SimpleCov, pour le simple fait qu&#x27;il est plus facile &agrave; mettre en place. Commen&ccedil;ons par ajouter la gem dans le fichier <code>Gemfile</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">group :test do
  gem &#x27;simplecov&#x27;, &#x27;&gt;=0.3.8&#x27;, :require =&gt; false
end</pre>

<p>Ajoutons ensuite les deux lignes suivantes au fichier test ou spec helper.</p>

<p class="codeFilePath">/spec/spec_helper.rb</p>
<pre class="ruby">require &#x27;simplecov&#x27;
SimpleCov.start &#x27;rails&#x27;</pre>

<p>Comme d&#x27;habitude, lorsque l&#x27;on ajoute une gem &agrave; une application, nous devons lancer <code>bundle</code> pour s&#x27;assurer que la gem est install&eacute;e. Une fois install&eacute;e, nous pouvons lancer <code>rake spec</code> pour faire tourner les specs de l&#x27;application. Ouvrons ensuite le fichier <code>coverage/index.html</code> pour voir le r&eacute;sultat.</p>

<div class="imageWrapper">
  <img src="/system/photos/568/original/E252I03.png" width="808" height="465" alt="The output from SimpleCov."/>
</div>

<p>Cela nous donne un moyen simple de voir quels fichiers ont le moins de couverture par les tests ou les specs. Les pires fichiers sont list&eacute;s en premier et si l&#x27;on clic sur l&#x27;un d&#x27;eux, par exemple <code>comments_controller</code>, on peut voir exactement quel code est couvert et quel code ne l&#x27;est pas.</p>

<div class="imageWrapper">
  <img src="/system/photos/569/original/E252I04.png" width="807" height="607" alt="Code coverage in SimpleCov."/>
</div>

<p>Nous pouvons ainsi voir pr&eacute;cis&eacute;ment quel code n&#x27;est pas couvert et modifier les tests ou le code en cons&eacute;quence afin d&#x27;am&eacute;liorer le pourcentage de couverture.</p>

<p>Nous avons maintenant une solution satisfaisante en ce qui concerne la couverture de code. Nous allons voir maintenant les deux nouvelles m&eacute;triques fournies par metric_fu, le rapport des Bonnes Pratiques et les Hotspots.</p>

<p>Les Hotspots nous donnent un aper&ccedil;u des diff&eacute;rents fichiers, classes et m&eacute;thodes de notre application, listant les pires en premier. Ce choix se base sur un certain nombre de facteurs, Reek et Flog en particulier, et est un bon point de d&eacute;part pour d&eacute;terminer les zones du code qui requi&egrave;rent notre attention.</p>

<div class="imageWrapper">
  <img src="/system/photos/570/original/E252I05.png" width="807" height="607" alt="Hotspot Results"/>
</div>

<p>Le rapport des Bonnes Pratiques nous indique les parties de notre code qui ne respectent pas les bonnes pratiques.</p>

<div class="imageWrapper">
  <img src="/system/photos/571/original/E252I06.png" width="807" height="607" alt="The Rails Best Practices report."/>
</div>

<p>Le r&eacute;sultat de ce rapport semble un peu &eacute;trange lorsqu&#x27;il est consult&eacute; via le navigateur. Nous pouvons utiliser la gem directement, sans passer par metric_fu. Puisque nous avons install&eacute; Metrical, nous devrions d&eacute;j&agrave; l&#x27;avoir &agrave; notre disposition mais, dans le cas contraire, nous pouvons l&#x27;installer comme ceci&nbsp;:</p>

<pre class="terminal">$ gem install rails_best_practices</pre>

<p>Lorsque nous lan&ccedil;ons la commande ci-dessus, il nous est conseill&eacute; de visiter le site <a href="http://rails-bestpractices.com">Rails Best Practices</a>. Jetons donc un &oelig;il.</p>

<div class="imageWrapper">
  <img src="/system/photos/572/original/E252I07.png" width="806" height="465" alt="The Best Practices website."/>
</div>

<p>Le site Rails Best Practices est int&eacute;ressant et contient une longue liste des bonnes pratiques que nous pouvons suivre pour am&eacute;liorer nos applications Rails. Dans l&#x27;onglet &ldquo;Implemented&rdquo; se trouvent les pratiques utilis&eacute;es par la gem et qui seront v&eacute;rifi&eacute;es lorsque nous lan&ccedil;ons la commande <code>rails_best_practices</code>.</p>

<p>Lorsque nous lan&ccedil;ons cette commande, nous obtenons une liste de suggestions en rouge.</p>

<pre class="terminal">$ rails_best_practices 
Analyzing:     100% |oooooooooooooooooooooooooooooooooooooooooo| Time: 00:00:00
<span style="color:#C00;">./app/controllers/comments_controller.rb:53 - move model logic into model (errors use_count &gt; 4)
./app/views/comments/index.rss.builder:10 - law of demeter
./app/views/comments/index.rss.builder:10 - law of demeter
./db/schema.rb:15 - always add db index (comments =&gt; [user_id])
./db/schema.rb:71 - always add db index (spam_reports =&gt; [comment_id])
./app/controllers/comments_controller.rb:28,32,41 - use before_filter for edit,update,destroy
...</span></pre> 

<p>Le text rouge peut piquer un peu les yeux. Alternativement, nous pouvons demander &agrave; ce que le r&eacute;sultat soit sous la forme HTML et que les noms de fichiers soient des liens permettant d&#x27;ouvrir les fichiers dans TextMate.</p>
<pre class="terminal">$ rails_best_practices -f html --with-textmate</pre>

<p>Cela va g&eacute;n&eacute;rer un fichier HTML nomm&eacute; <code>rails_best_practices.html</code> que nous pouvons ouvrir dans notre navigateur.</p>

<div class="imageWrapper">
  <img src="/system/photos/573/original/E252I08.png" width="806" height="465" alt="The Best Practices output rendered in a browsers."/>
</div>

<p>La commande a trouv&eacute; 26 erreurs dans cette application. Si nous cliquons sur n&#x27;importe quel nom de fichier, le fichier correspondant sera ouvert dans TextMate. Cliquer sur un message d&#x27;erreur nous m&egrave;nera &agrave; la page correspondante du site Rails Best Practices, nous permettant d&#x27;obtenir une description du probl&egrave;me ainsi que quelques conseilles d&#x27;am&eacute;lioration du code. Il ne nous reste plus qu&#x27;&agrave; parcourir la liste et voir comment am&eacute;liorer notre code.</p>

<p>Comme toutes les m&eacute;triques, ces recommandations ne sont pas &agrave; prendre au pied de la lettre. Le fait qu&#x27;une technique soit consid&eacute;r&eacute;e comme une bonne pratique dans le cas g&eacute;n&eacute;ral ne signifie pas que ce soit le mieux pour notre application. Nous devons consid&eacute;rer la liste fournie comme un guide permettant de trouver les zones qui peuvent &ecirc;tre am&eacute;lior&eacute;es. Ne vous fixez pas l&#x27;objectif de faire descendre cette liste &agrave; z&eacute;ro. Cela s&#x27;applique &agrave; toutes les m&eacute;triques, ne les prenez pas pour argent comptant sans prendre en consid&eacute;ration le bien fond&eacute; de leur application sur votre code. Assurez vous que ces recommandations apportent un plus &agrave; votre application. La m&eacute;trique doit &ecirc;tre utilis&eacute;e comme un indicateur de ce qui peut &ecirc;tre perfectionn&eacute;.</p>