<p>En este episodio veremos las mejoras que Rails 3 ha introducido en las validaciones, pero antes de eso actualizaremos Rails 3 a la nueva beta, la 3.</p>

<h3>Actualizaci&oacute;n de Rails 3</h3>

<p>Podemos instalar esta nueva versi&oacute;n igual que hemos hecho con las anteriores ejecutando:</p>

<pre class="terminal">
gem install rails --pre
</pre>

<p>Es posible que tras la instalaci&oacute;n de la nueva beta tengamos problemas al ejecutar el comando <code>rails</code> y veamos un mensaje de error como este:</p>

<pre class="terminal">
$ rails store
/Users/eifion/.rvm/gems/ruby-head/gems/rails-3.0.0.beta3/bin/rails:1:in `require&#x27;: no such file to load -- rails/cli (LoadError)
	from /Users/eifion/.rvm/gems/ruby-head/gems/rails-3.0.0.beta3/bin/rails:1:in `&lt;top (required)&gt;&#x27;
	from /Users/eifion/.rvm/gems/ruby-head/bin/rails:19:in `load&#x27;
	from /Users/eifion/.rvm/gems/ruby-head/bin/rails:19:in `&lt;main&gt;&#x27;
</pre>

<p>Se trata de un problema de compatibilidad hacia atr&aacute;s con las versiones beta anteriores.  Para corregirlo podemos hacer</p>

<pre class="terminal">
rails cleanup
</pre>

<p>lo que eliminir&aacute; las versiones antiguas de las gemas instaladas.  Ya se puede ejecutar el comando <code>rails</code>, con lo que podemos crear la aplicaci&oacute;n que usaremos para este episodio.</p>

<pre class="terminal">
rails store
</pre>

<h3>La nueva funcionalidad</h3>

<p>Con nuestra aplicaci&oacute;n en  marcha ya podemos empezar el repaso de las nuevas funcionalidades de validaci&oacute;n.  Comenzaremos generando un andamiaje para el modelo <code>User</code> que tendr&aacute; dos atributos: el nombre y la direcci&oacute;n de correo.</p>

<pre class="terminal">
rails g scaffold user name:string email:string
</pre>

<p>Y migraremos la base de datos como es habitual.</p>

<pre class="terminal">
rake db:migrate
</pre>

<p>Veamos el c&oacute;digo que muestra la validaci&oacute;n, que reside en el parcial del formulario que se ha generado autom&aacute;ticamente.</p>

<p class="codeFilePath">/app/views/users/_form.html.erb</p>
<pre class="ruby">
&lt;%= form_for(@user) do |f| %&gt;
  &lt;% if @user.errors.any? %&gt;
  &lt;div id=&quot;errorExplanation&quot;&gt;
    &lt;h2&gt;&lt;%= pluralize(@user.errors.count, &quot;error&quot;) %&gt; prohibited this user from being saved:&lt;/h2&gt;
    &lt;ul&gt;
    &lt;% @user.errors.full_messages.each do |msg| %&gt;
      &lt;li&gt;&lt;%= msg %&gt;&lt;/li&gt;
    &lt;% end %&gt;
    &lt;/ul&gt;
  &lt;/div&gt;
  &lt;% end %&gt;

  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :name %&gt;&lt;br /&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :email %&gt;&lt;br /&gt;
    &lt;%= f.text_field :email %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;actions&quot;&gt;
    &lt;%= f.submit %&gt;
  &lt;/div&gt;
&lt;% end %&gt;
</pre>


<p>Como se ve, el c&oacute;digo que muestra la informaci&oacute;n de error es bastante abudante.  La raz&oacute;n es que en la &uacute;ltima versi&oacute;n ha desaparecido el m&eacute;todo <code>error_messages_for</code> y tampoco podemos hacer</p>

<pre class="ruby">
&lt;%= f.error_messages %&gt;
</pre>

<p>Estos m&eacute;todos han sido sacados a su propio <em>plugin</em>, <a href="http://github.com/rails/dynamic_form">dynamic_form</a>.  Bastar&aacute; con instalar dicho <em>plugin</em> para recuperar todos estos m&eacute;todos.  Sin embargo no se recomienda hacerlo.</p>

<p>La raz&oacute;n por la que estos m&eacute;todos se han eliminado es porque con frecuencia los mensajes de error se deben personalizar y hacerlo con los m&eacute;todos antiguos era un poco inc&oacute;modo y no tan flexible como teniendo el marcado del mensaje de error en l&iacute;nea como ahora: teniendo el HTML a mano en las vistas significa que podemos hacer los cambios en la visualizaci&oacute;n de mensajes de error como queramos.</p>

<p>Claro est&aacute; que el tener el c&oacute;digo de mensajes de error en l&iacute;nea en el formulario para cada modelo puede conducirnos a duplicar mucho c&oacute;digo.  Para reducir esto podemos extraer el c&oacute;digo de error a su propio parcial de forma que podamos usar dicho parcial en todos los modelos. Lo pondremos en una carpeta <code>shared</code> y lo llamaremos <code>_error_messages.html.erb</code> pas&aacute;ndole el objeto destino (que en nuestro caso ser&aacute; nuestro usuario).</p>

<p class="codeFilePath">/app/views/users/_form.html.erb</p>
<pre class="ruby">
&lt;%= form_for(@user) do |f| %&gt;
  &lt;%= render &quot;shared/error_messages&quot;, :target =&gt; @user %&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :name %&gt;&lt;br /&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :email %&gt;&lt;br /&gt;
    &lt;%= f.text_field :email %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;actions&quot;&gt;
    &lt;%= f.submit %&gt;
  &lt;/div&gt;
&lt;% end %&gt;
</pre>

<p>En el nuevo parcial pegaremos el c&oacute;digo que hemos quitado del formulario, renombrando la variable <code>@user</code> por <code>target</code> para que haga referencia al objeto que se le est&eacute; pasando.  Tambi&eacute;n cambiaremos el mensaje de error para que sea m&aacute;s gen&eacute;rico.</p>


<p class="codeFilePath">/app/views/shared/_error_messages.html.erb</p>
<pre class="ruby">
&lt;% if target.errors.any? %&gt;
&lt;div id=&quot;errorExplanation&quot;&gt;
  &lt;h2&gt;&lt;%= pluralize(target.errors.count, &quot;error&quot;) %&gt; prohibited this record from being saved:&lt;/h2&gt;
  &lt;ul&gt;
  &lt;% target.errors.full_messages.each do |msg| %&gt;
    &lt;li&gt;&lt;%= msg %&gt;&lt;/li&gt;
  &lt;% end %&gt;
  &lt;/ul&gt;
&lt;/div&gt;
&lt;% end %&gt;
</pre>

<p>Podemos probar el nuevo parcial a&ntilde;adiendo una validaci&oacute;n al atributo <code>email</code> de nuestro modelo <code>User</code>.</p>


<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  validates_presence_of :email
end
</pre>

<p>Si vamos al formulario de nuevo usuario y lo enviamos sin haber rellenado el campo para el correo veremos los errores de validaci&oacute;n:</p>


<div class="imageWrapper">
  <img src="/system/photos/374/original/E211I01.png" width="803" height="412" alt="Mensajes de error de nuestro parcial."/>
</div>

<p>As&iacute; pues vemos que es muy f&aacute;cil extraer el c&oacute;digo para mostrar mensajes de error a un parcial para que todo siga siendo flexible.  Si queremos continuar con los viejos m&eacute;todos <em>helper</em>, podemos emplear una t&eacute;cnica parecida a la usada por Ryan Bates en sus <a href="http://github.com/ryanb/nifty-generators">Nifty Generators</a>, que tienen un m&oacute;dulo llamado <a href="http://github.com/ryanb/nifty-generators/blob/master/lib/generators/nifty/layout/templates/error_messages_helper.rb"><code>ErrorMessagesHelper</code> module</a> que incluye los m&eacute;todos <code>error_messages_for</code> y <code>error_messages</code> en los constructores de formulario.  Son versiones simplificadas de los m&eacute;todos que proporcionaba Rails y son f&aacute;ciles de ajustar a nuestras necesidades, por lo que tal vez nos podr&iacute;a interesar el incluir dichos m&eacute;todos a nuestra aplicaci&oacute;n.</p>

<h3>Reflexi&oacute;n de la validaci&oacute;n</h3>

<p>Una nueva funcionalidad de Rails 3 es la capacidad de <em>reflexi&oacute;n</em> sobre la validaci&oacute;n.  Podemos utilizarla si, por ejemplo, queremos poner un asterisco junto a cada campo requerido del formulario.  Anteriormente ten&iacute;amos que instalar un <em>plugin</em> externo para poder determinar qu&eacute; validaciones aplicaban sobre el modelo para el cual se mostraba un formulario.  Ahora esto viene incluido en Rails por lo que es mucho m&aacute;s f&aacute;cil incluir un indicador junto a cada campo.</p>

<p>Esto es m&aacute;s f&aacute;cil de mostrar con la consola.  Podemos invocar a <code>validators</code> contra un modelo para recuperar un <em>array</em> de las validaciones aplicadas sobre dicho modelo.</p>

<pre class="terminal">
ruby-head &gt; User.validators
 =&gt; [#&lt;ActiveModel::Validations::PresenceValidator:0x00000100badfc8 @attributes=[:email], @options={}&gt;]
</pre> 

<p>Como s&oacute;lo hemos establecido una validaci&oacute;n en nuestro modelo <code>User</code> veremos que tan s&oacute;lo se devuelve un validador que ser&aacute; de tipo <code>PresenceValidator</code> porque la validaci&oacute;n es del tipo <code>validates_presence_of</code>.</p>

<p>Podemos recuperar los validadores para un atributo utilizado el m&eacute;todo <code>validators_on</code>:</p>

<pre class="terminal">
ruby-head &gt; User.validators_on(:email)
 =&gt; [#&lt;ActiveModel::Validations::PresenceValidator:0x00000100badfc8 @attributes=[:email], @options={}&gt;]
</pre> 

<p>Esto devolver&aacute; el mismo validador que antes porque es el &uacute;nico que tenemos, actuando sobre el atributo <code>email</code>.  Si invocamos este m&eacute;todo contra el atributo <code>name</code> veremos que se nos devuelve un <em>array</em> vac&iacute;o.</p>

<pre class="terminal">
ruby-head &gt; User.validators_on(:name)
 =&gt; []
</pre> 

<p>En teor&iacute;a nos interesa ejecutar estas comprobaciones en el constructor del formulario para que se a&ntilde;ada autom&aacute;ticamente el asterisco de la manera m&aacute;s eficiente, pero hacer esto est&aacute; fuera del alcance de este episodio as&iacute; que simplemente crearemos un <em>helper</em> propio llamado <code>mark_required</code>.  Este m&eacute;todo recibir&aacute; dos par&aacute;metros: un modelo y un atributo para dicho modelo.  Por ejemplo, para el atributo <code>email</code> invocar&iacute;amos as&iacute; el m&eacute;todo:</p>

<pre class="ruby">
&lt;%= mark_required(@user, :email) %&gt;
</pre>

<p>Podemos crear el m&eacute;todo <code>mark_required</code> en el fichero <code>ApplicationHelper</code>.</p>


<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def mark_required(object, attribute)
    &quot;*&quot; if object.class.validators_on(attribute).map(&amp;:class).include? ActiveModel::Validations::PresenceValidator
  end
end
</pre>

<p>El m&eacute;todo devolver&aacute; una cadena con un asterisco si <code>PresenceValidator</code> est&aacute; entre los validadores del modelo.  Una vez que tenemos este m&eacute;todo podemos aplicarlo a cada campo en el formulario:</p>


<p class="codeFilePath">/app/views/users/_form.html.erb</p>
<pre class="ruby">
&lt;%= form_for(@user) do |f| %&gt;
  &lt;%= render &quot;shared/error_messages&quot;, :target =&gt; @user %&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :name %&gt;&lt;%= mark_required(@user, :name) %&gt;&lt;br /&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :email %&gt;&lt;%= mark_required(@user, :email) %&gt;&lt;br /&gt; 
    &lt;%= f.text_field :email %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;actions&quot;&gt;
    &lt;%= f.submit %&gt;
  &lt;/div&gt;
&lt;% end %&gt;
</pre>

<p>Como mencion&aacute;bamos antes, esta no es la mejor manera de hacerlo porque tenemos que a&ntilde;adir manualmente una llamada al m&eacute;todo contra cada campo (extender <code>FormBuilder</code> para hacer esto no deber&iacute;a ser demasiado dif&iacute;cil).</p>

<p>Si recargamos el formulario veremos aparecer un asterisco junto al campo <code>email</code> pero no junto al campo <code>name</code>.</p>


<div class="imageWrapper">
  <img src="/system/photos/375/original/E211I02.png" width="804" height="283" alt="Ahora aparece un asterisco junto a los campos requeridos."/>
</div>

<h3>Validaciones en la capa del modelo</h3>

<p>Hasta ahora tan s&oacute;lo hemos cubierto validaciones en la vista, pero las mejoras en las validaciones a nivel de modelo tambi&eacute;n son excelentes.  Merece la pena, para entrar en detalle, leer este  <a href="http://lindsaar.net/2010/1/31/validates_rails_3_awesome_is_true">art&iacute;culo en el blog de Mike Lindsaar</a>.  Una diferencia importante es que se han sacado las validaciones de ActiveRecord y se han puesto en  <a href="http://github.com/rails/rails/tree/master/activemodel">ActiveModel</a>.   Con esto es m&aacute;s f&aacute;cil a&ntilde;adir validaciones a objetos no ActiveRecord, y profundizaremos en esto en un pr&oacute;ximo episodio.</p>

<p>Donde nos vamos a centrar es en que las validaciones de nuestro modelo <code>User</code> sean m&aacute;s eficientes.  Hemos a&ntilde;adidos un par de validaciones al modelo de forma que ahora tiene el siguiente aspecto:</p>


<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  validates_presence_of :email
  validates_uniqueness_of :email
  validates_format_of :email, :with =&gt; /^[\w\d]+$/ :on =&gt; :create, :message =&gt; &quot;is invalid&quot;
end
</pre>

<p>En Rails 3 es posible invocar el m&eacute;todo <code>validates</code> y pasarle un <em>hash</em> de atributos para definir las validaciones, en lugar de definir cada validaci&oacute;n por separado.</p>


<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  validates :email, 
            :presence =&gt; true, 
            :uniqueness =&gt; true, 
            :format =&gt; { :with =&gt; /^([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})$/i }
end
</pre>

<p>En el modelo <code>User</code> seguimos validando que el campo tenga un valor y que dicho valor sea &uacute;nico.  Para validar el formato hay varias opciones que podemos pasar, as&iacute; que usamos un <em>hash</em> secundario para definirlas.</p>

<p>Podemos pasar cualquier n&uacute;mero de validaciones para un atributo con un &uacute;nico comando.  Si bien esto es bastante &uacute;til en la mayor&iacute;a de situaciones, puede llegar a ser poco manejable si tenemos muchas validaciones.</p>

<h3>C&oacute;mo escribir nuestros propios validadores</h3>

<p>Veamos ahora c&oacute;mo podemos hacer que la opci&oacute;n <code>:format</code> sea m&aacute;s concisa.  Nos interesar&aacute; frecuentemente validar direcciones de correo y tener la misma kilom&eacute;trica expresi&oacute;n regular en cada validador es poco elegante e introduce una repetici&oacute;n innecesaria en el c&oacute;digo.  Podemos extraer esto a su propia validaci&oacute;n creando una clase en el directorio <code>/lib</code> de nuestra aplicaci&oacute;n.  Lo llamaremos <code>email_format_validator.rb</code>.</p>

<p class="codeFilePath">/lib/email_format_validator.rb</p>
<pre class="ruby">
class EmailFormatValidator &lt; ActiveModel::EachValidator
  def validate_each(object, attribute, value)
    unless value =~ /^([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})$/i
      object.errors[attribute] &lt;&lt; (options[:message] || &quot;is not formatted properly&quot;)
    end
  end
end
</pre>

<p>La clase <code>EmailFormatValidator</code> hereda de <code>ActiveModel::EachValidator</code>.  Tenemos que definir un m&eacute;todo llamado <code>validate_each</code>, que recibir&aacute; tres par&aacute;metros llamados<code>object</code>, <code>attribute</code> y <code>value</code> y comprobar&aacute; que el valor casa con la expresi&oacute;n regular que usamos para validar direcciones de correo.  Si esto no es as&iacute;, a&ntilde;adir&aacute; el atributo a <code>errors</code>.</p>

<p>Con esta t&eacute;cnica podemos definir cualquir tipo de validaci&oacute;n que deseemos (por ejemplo, en la anotaci&oacute;n del blog mencionado anteriormente se utiliza un conjunto m&aacute;s completo de validaciones sobre la direcci&oacute;n de correo).  Ahora que ya tenemos nuestro propio validador podemos utilizarlo en el modelo <code>User</code>.</p>


<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
class User &lt; ActiveRecord::Base
  validates :email, :presence =&gt; true, :uniqueness =&gt; true, :email_format =&gt; true
end
</pre>

<p>La presencia de la clave <code>email_format</code> en el <em>hash</em> <code>validates</code> singifica que el validador buscar&aacute; una clase llamada <code>email_format_validator</code> y pasar&aacute; el comportamiento de validaci&oacute;n a la clase que acabamos de escribir.</p>

<p>Si creamos un usuario e introducimos una direcci&oacute;n de correo incorrecta ahora vereoms el siguiente mensaje de error.</p>


<div class="imageWrapper">
  <img src="/system/photos/376/original/E211I03.png" width="802" height="405" alt="Clase de error que muestra un mensaje de error."/>
</div>

<p>Con la posibilidad de crear nuestros propios validadores podemos reorganizar las validaciones en nuestros modelos y hace que sea f&aacute;cil eliminar cualquier duplicaci&oacute;n en las validaciones.</p>
