<p>A continuaci&oacute;n aparece una captura de pantalla de una aplicaci&oacute;n Rails 3 que muestra un listado de productos bastante largo.  En  lugar de mostrar los elementos como una lista &uacute;nica queremos que este listado quede paginado.</p>


<div class="imageWrapper">
  <img src="/system/photos/581/original/E254I01.png" width="815" height="432" alt="The Long List of Products."/>
</div>

<p>La primera opci&oacute;n para implementar esta paginaci&oacute;n en Rails es 
<a href="https://github.com/mislav/will_paginate/wiki">will_paginate</a>, sin embargo la versi&oacute;n actual no soporta Rails 3.  Existe una versi&oacute;n de prelanzamiento que funciona pero que no ha sido actualizada desde hace varios meses.   Si esta gema ya no est&aacute; en desarrollo activo, &iquest;qu&eacute; otras opciones nos quedan?</p>

<p>Una alternativa es <a href="https://github.com/amatsuda/kaminari">Kaminari</a>. Por lo que parece proporciona una implementaci&oacute;n m&aacute;s limpia y ofrece algunas funcionalidades extra, as&iacute; que vamos a intentar incorporarla en nuestra aplicaci&oacute;n.  Kaminari se instala de la forma habitual: primero a&ntilde;adiendo una referencia en el fichero <code>Gemfile</code> de la aplicaci&oacute;n y luego ejecutando <code>bundle</code> para instalar la gema en nuestro sistema.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &quot;kaminari&quot;</pre>

<h3>Uso de Kaminari</h3>

<p>Kaminari nos da un &aacute;mbito llamado <code>page</code> que podemos aplicar sobre cualquier modelo de ActiveRecord.  Se puede utilizar en la acci&oacute;n <code>index</code> del controlador <code>ProductsController</code> para paginar el listado de productos, pas&aacute;ndole la p&aacute;gina que queremos mostrar, en nuestro caso pasaremos el par&aacute;metro <code>page</code> recibido en la cadena de petici&oacute;n.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">def index
  @products = Product.order(&quot;name&quot;).page(params[:page])
end</pre>

<p>En la plantilla <code>index</code> donde mostramos el listado de productos podemos invocar al m&eacute;todo <code>paginate</code> que da Kaminari pas&aacute;ndole la lista sobre la que estamos paginando.</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">&lt;% title &quot;Products&quot; %&gt;
&lt;%= paginate @products %&gt;
&lt;div id=&quot;products&quot;&gt;
  &lt;%= render @products %&gt;
&lt;/div&gt;
&lt;p&gt;&lt;%= link_to &quot;New Product&quot;, new_product_path %&gt;&lt;/p&gt;</pre>

<p>Al cargar de nuevo la p&aacute;gina veremos los enlaces de paginaci&oacute;n en la parte superior.</p>

<div class="imageWrapper">
  <img src="/system/photos/582/original/E254I02.png" width="815" height="432" alt="El listado paginado."/>
</div>

<p>Kaminari muestra por defecto 25 elementos por p&aacute;gina pero esto se puede cambiar f&aacute;cilmente mediante el uso de otro &aacute;mbito llamado
<code>per</code>. que usaremos para cambiar el n&uacute;mero de elementos por p&aacute;gina a 5.</p>
	
<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">def index
  @products = Product.order(&quot;name&quot;).page(params[:page]).per(5)
end</pre>

<p>Con esto tendremos cinco productos por p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="/system/photos/583/original/E254I03.png" width="808" height="530" alt="Cinco elementos por página."/>
</div>

<p>Esta sintaxis encaja muy bien con las nuevas consultas ActiveRecord de Rails 3.  Podemos mover la llamada <code>order</code> a cualquier sitio de la consulta y seguir&iacute;a funcionando igual, porque lo que estamos haciendo es encadenar &aacute;mbitos contra nuestro modelo.  Podr&iacute;amos incluso mover las llamadas a <code>page</code> y <code>per</code> a otros &aacute;mbitos definidos en el modelo, y funcionar&iacute;an como es de esperar.  La &uacute;nica excepci&oacute;n a esto es que <code>per</code> debe colocarse despu&eacute;s de <code>page</code>.  El motivo es que <code>page</code> a&ntilde;ade autom&aacute;ticamente el &aacute;mbito <code>per</code>, si se llama a <code>per</code> antes de <code>page</code> obtendremos un error porque su &aacute;mbito todav&iacute;a ha sido creado.</p>

<h3>Cambio del aspecto</h3>

<p>Existen varias formas de cambiar el aspecto de la paginaci&oacute;n.  Si queremos cambiar las palabras &ldquo;prev&rdquo; y &ldquo;next&rdquo; en el listado de p&aacute;ginas as&iacute; como las flechas  que las acompa&ntilde;anan podemos hacerlo a&ntilde;adiendo entradas en el fichero de localizaci&oacute;n.  De esta forma es muy f&aacute;cil cambiar estos elementos, en particular si nuestra aplicaci&oacute;n debe soportar distintos lenguajes.  Los elementos que tenemos que a&ntilde;adir deben ir en <code>view/pagination</code> y los textos pueden cambiarse con las claves <code>previous</code> y <code>next</code>.  Para cambiar el texto que se muestra cuando se trunca el listado se puede editar la clave <code>truncate</code>.  Obs&eacute;rvese que hay que escapar el HTML, porque el texto se mostrar&aacute; en la p&aacute;gina tal cual.</p>

<p class="codeFilePath">/config/locales/en.yml</p>
<pre class="ruby">en:
  hello: &quot;Hello world&quot;
  views:
    pagination:
      previous: &quot;&amp;lt; Previous&quot;
      next: &quot;Next &amp;gt;&quot;
      truncate: &quot;&amp;hellip;&rdquo;</pre>

<p>Si ahora recargamos la p&aacute;gina veremos el texto modificado.</p>


<div class="imageWrapper">
  <img src="/system/photos/584/original/E254I04.png" width="815" height="309" alt="Ha cambiado el texto en el listado de páginas."/>
</div>

<p>Podemos meter m&aacute;s cambios a&ntilde;adiendo CSS para las clases que utilizan las diferentes partes de la aplicaci&oacute;n.  Como nota interesante, la navegaci&oacute;n utiliza el elemento <code>nav</code> de HTML 5.</p>

<pre class="erb">&lt;nav class=&#x27;pagination&#x27;&gt;
  &lt;span class=&quot;prev&quot;&gt;
    &lt;a href=&quot;/products&quot; class=&quot;prev&quot; rel=&quot;prev&quot;&gt;&amp;lt; Previous&lt;/a&gt;
  &lt;/span&gt;
  &lt;span class=&quot;page first&quot;&gt;
    &lt;a href=&quot;/products&quot;&gt;1&lt;/a&gt;
  &lt;/span&gt;
  &lt;span class=&quot;page current&quot;&gt;2&lt;/span&gt;
  ...</pre>

<p>Si bien con CSS se puede modificar gran parte del aspecto de la navegaci&oacute;n, hay otros cambios que no son posibles de esta manera.  Por ejemplo, puede ser que queramos que el enlace a &ldquo;Previous&rdquo; aparezca en la primera p&aacute;gina pero con color gris e inhabilitado, en lugar de no aparecer como es el comportamiento por defecto.</p>

<p>Kaminari es un Engine de Rails, y viene con un n&uacute;mero de vistas que se pueden personalizar para ajustarlas a nuestra aplicaci&oacute;n.  Para ayudar con esto podemos utilizar un generador que viene con Kaminari y al que tenemos que pasar el nombre de un tema como argumento, si utilizamos <code>default</code> utilizar&aacute; el tema por defecto.</p>

<pre class="terminal">$ rails g kaminari:views default
      create  app/views/kaminari/_current_page.html.erb
      create  app/views/kaminari/_first_page_link.html.erb
      create  app/views/kaminari/_last_page_link.html.erb
      create  app/views/kaminari/_next_link.html.erb
      create  app/views/kaminari/_next_span.html.erb
      create  app/views/kaminari/_page_link.html.erb
      create  app/views/kaminari/_paginator.html.erb
      create  app/views/kaminari/_prev_link.html.erb
      create  app/views/kaminari/_prev_span.html.erb
      create  app/views/kaminari/_truncated_span.html.erb</pre>

<p>Hay otros temas disponibles (v&eacute;ase <a href="https://github.com/amatsuda/kaminari_themes">Kaminari Themes project</a> en GitHub).  Ahora mismo hay pocos disponibles pero no cabe duda de que pronto aparecer&aacute;n m&aacute;s seg&uacute;n los usuarios empiecen a desarrollar sus propios temas.</p>

<p>El generador crea un nuevo directorio <code>kaminari</code> en <code>app/views</code>, donde colocar&aacute; un n&uacute;mero de archivos parciales.  Podemos cambiarlos para personalizar el funcionamiento de la paginaci&oacute;n.  El fichero principal es <code>_paginator.html.erb</code>, y si bien esto parece algo complicado, es muy f&aacute;cil de entender y modificar.</p>


<pre class="codeFilePath">/app/views/kaminari/_paginator.html.erb</pre>
<pre class="ruby">&lt;%# The container tag
  - available local variables
    current_page:  the page number of currently displayed page
    num_pages:     total number of pages
    per_page:      number of items to fetch per page
    remote:        data-remote
    paginator:     the paginator that renders the pagination tags inside
-%&gt;
&lt;%= paginator.render do -%&gt;
  &lt;nav class=&#x27;pagination&#x27;&gt;
    &lt;%= current_page &gt; 1 ? prev_link_tag : prev_span_tag %&gt;
    &lt;% each_page do |page| -%&gt;
      &lt;% if page.current? -%&gt;
        &lt;%= current_page_tag %&gt;
      &lt;% elsif page.left_outer? || page.right_outer? || page.inside_window? -%&gt;
        &lt;% if page.first? -%&gt;
          &lt;%= first_page_link_tag %&gt;
        &lt;% elsif page.last? -%&gt;
          &lt;%= last_page_link_tag %&gt;
        &lt;% else -%&gt;
          &lt;%= page_link_tag %&gt;
        &lt;% end -%&gt;
      &lt;% elsif !page.was_truncated? -%&gt;
        &lt;%= truncated_span_tag %&gt;
      &lt;% end -%&gt;
    &lt;% end -%&gt;
    &lt;%=num_pages &gt; current_page ? next_link_tag : next_span_tag %&gt;
  &lt;/nav&gt;
&lt;% end -%&gt;</pre>

<p>Es f&aacute;cil ver el elemento <code>nav</code> en la p&aacute;gina y el c&oacute;digo que viene justo despu&eacute;s que muestra el enlace 
 &ldquo;previous&rdquo;.  Este c&oacute;digo llamar&aacute; a <code>prev_link_tag</code> o <code>prev_span_tag</code> dependiendo si la p&aacute;gina es la primera o no. Cada uno de estos m&eacute;todos invoca a un parcial y como queremos cambiar lo que ocurre en la primera p&aacute;gina cambiaremos <code>_prev_span.html.erb</code>.</p>

<p class="codeFilePath">/app/view/kaminari/_prev_span.html.erb</p>
<pre class="ruby">&lt;%# &quot;Previous&quot; without link
  - available local variables
    current_page:  the page number of currently displayed page
    num_pages:     total number of pages
    per_page:      number of items to fetch per page
    remote:        data-remote
-%&gt;
&lt;span class=&quot;prev&quot;&gt;&lt;/span&gt;</pre>

<p>Lo &uacute;nico que hay que hacer es a&ntilde;adir un poco de c&oacute;digo al elemento <code>span</code>, si miramos <code>_prev_link.html.erb</code> veremos que muestra un enlace.  Podemos copiar el c&oacute;digo que genera el texto para el enlace y pegarlo en el elemento <code>span</code>.</p>

<p class="codeFilePath">/app/view/kaminari/_prev_span.html.erb</p>
<pre class="ruby">&lt;%# &quot;Previous&quot; without link
  - available local variables
    current_page:  the page number of currently displayed page
    num_pages:     total number of pages
    per_page:      number of items to fetch per page
    remote:        data-remote
-%&gt;
&lt;span class=&quot;prev disabled&quot;&gt;
  &lt;%= raw(t &#x27;views.pagination.previous&#x27;) %&gt;
&lt;/span&gt;</pre>

<p>El c&oacute;digo que muestra el texto utiliza el m&eacute;todo <code>t</code> para recuperar el fragmento de texto traducido a partir del archivo de traducciones que vimos anteriormente, y le pasa dicho texto al m&eacute;todo <code>raw</code> para evitar que sea escapado.  Tambi&eacute;n hemos a&ntilde;adido la clase <code>disabled</code> al elemento <code>span</code> para que pueda aparecer en gris a&ntilde;adiendo lo siguiente al CSS:</p>

<p class="codeFilePath">/public/stylesheets/application.css</p>
<pre class="css">.disabled { color: #999; }</pre>

<p>Al volver a cargar la primera p&aacute;gina de los productos veremos el texto en gris.</p>

<div class="imageWrapper">
  <img src="/system/photos/585/original/E254I05.png" width="801" height="376" alt="El enlace a  &ldquo;previous&rdquo; aparece tal y como queremos."/>
</div>

<p>Est&aacute; claro que queremos hacer lo mismo con el enlace a  &ldquo;Next&rdquo; en la &uacute;ltima p&aacute;gina, pero eso queda como ejercicio para el lector.</p>

<p>Con esto terminamos nuestro repaso a la gema Kaminari, que merece la pena considerar si necesitamos implementar una paginaci&oacute;n en una aplicaci&oacute;n Rails 3.  No hemos cubierto las opciones que acepta el m&eacute;todo de paginaci&oacute;n, como la posibilidad de cambiar c&oacute;mo se muestra el listado de p&aacute;ginas, o a&ntilde;adir par&aacute;metros a los enlaces de paginaci&oacute;n o que estos enlaces funcionen con AJAX.</p>
