<p>En este episodio continuaremos nuestro repaso de las nuevas funcionalidades de Rails 3, esta vez veremos <a href="http://github.com/carlhuda/bundler">Bundler</a> que es la nueva manera de gestionar dependencias de gemas en las aplicaciones Rails.</p>
<p>A d&iacute;a de hoy las actualizaciones de Bundler se suceden con frecuencia, as&iacute; que antes de hacer nada con &eacute;l merece la pena asegurarnos de que tenemos la &uacute;ltima versi&oacute;n ejecutando</p>
<pre class="terminal">
gem install bundler
</pre>
<p>Obs&eacute;rvese que no estamos usando <code>sudo</code> para instalar la gema porque tenemos una versi&oacute;n de Ruby que hemos instalado con rvm.</p>

<h3>Uso de Bundler para instalar gemas</h3>
<p>En el episodio anterior cuando intent&aacute;bamos arrancar el servidor web de nuestra aplicaci&oacute;n &eacute;sta se quejaba de que le faltaba la gema <code>sqlite3-ruby</code>.  Resolv&iacute;amos el problema instalando manualmente la gema con <code>gem install</code>.</p>

<pre class="terminal">
gem install sqlite3-ruby
</pre>

<p>En lugar de esto podr&iacute;amos haber utilizado Bundler porque <code>sqlite3-ruby</code> aparece en el listado del <code>Gemfile</code> de la aplicaci&oacute;n y por tanto esta gema es considerada como una dependencia. Para instalarla usando Bundler podemos ejecutar <code>bundle install</code>, lo que recorrer&aacute; todas las dependencias de gemas de la aplicaci&oacute;n y las instalar&aacute;.</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
Installing abstract (1.0.0) from system gems 
Installing actionmailer (3.0.0.beta) from system gems 
Installing actionpack (3.0.0.beta) from system gems 
Installing activemodel (3.0.0.beta) from system gems 
Installing activerecord (3.0.0.beta) from system gems 
Installing activeresource (3.0.0.beta) from system gems 
Installing activesupport (3.0.0.beta) from system gems 
Installing arel (0.2.1) from rubygems repository at http://gemcutter.org 
Installing builder (2.1.2) from system gems 
Installing bundler (0.9.5) from system gems 
Installing erubis (2.6.5) from system gems 
Installing i18n (0.3.3) from system gems 
Installing mail (2.1.2) from system gems 
Installing memcache-client (1.7.8) from system gems 
Installing mime-types (1.16) from system gems 
Installing rack (1.1.0) from system gems 
Installing rack-mount (0.4.7) from rubygems repository at http://gemcutter.org 
Installing rack-test (0.5.3) from system gems 
Installing rails (3.0.0.beta) from system gems 
Installing railties (3.0.0.beta) from system gems 
Installing rake (0.8.7) from system gems 
Installing sqlite3-ruby (1.2.5) from system gems 
Installing text-format (1.0.0) from system gems 
Installing text-hyphen (1.0.0) from system gems 
Installing thor (0.13.1) from rubygems repository at http://gemcutter.org 
Installing tzinfo (0.3.16) from system gems 
Your bundle is complete!
</pre>

<p>Podemos ver por la salida del comando anterior que Bundler ha instalado todas las gemas necesarias para el funcionamiento de la aplicaci&oacute;n, incluyendo <code>sqlite3-ruby</code>. De haber sido necesario, Bundler la hubiera descargado de Gemcutter y la hubiera instalado.</p>
<p>As&iacute;, ante cualquier duda, debemos ejecutar <code>bundle install</code>. Deber&iacute;amos hacerlo cada vez que creemos una nueva aplicaci&oacute;n para asegurarnos de que tenemos las gemas correctas instaladas, y tambi&eacute;n deber&iacute;amos hacerlo cada vez que desplegamos una aplicaci&oacute;n para que se instalen las gemas correctas en el servidor, a&ntilde;adi&eacute;ndolo a la receta de despliegue.</p>
<p>Es importante tener cuenta que jam&aacute;s deber&iacute;amos ejecutar <code>sudo</code> para ejecutar <code>bundle install</code> a&uacute;n cuando habitualmente utilicemos <code>sudo</code> para instalar las gemas.</p>

<h3>Dependencias entre gemas</h3>
<p>Ahora que sabemos c&oacute;mo gestionar nuestras gemas, &iquest;c&oacute;mo instalamos y a&ntilde;adimos nuevas dependencias en nuestra aplicaci&oacute;n?  En las versiones anteriores de Rails lo hac&iacute;amos editando el fichero <code>/config/environment.rb</code> pero en Rails 3 la configuraci&oacute;n de gemas se hace en un fichero en el directorio ra&iacute;z de nuestra aplicaci&oacute;n llamado <code>Gemfile</code>. Este fichero por defecto tiene el siguiente aspecto:</p>

<pre class="ruby">
# Edit this Gemfile to bundle your application&#x27;s dependencies.
source &#x27;http://gemcutter.org&#x27;


gem &quot;rails&quot;, &quot;3.0.0.beta&quot;

## Bundle edge rails:
# gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;

# ActiveRecord requires a database adapter. By default,
# Rails has selected sqlite3.
gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;

## Bundle the gems you use:
# gem &quot;bj&quot;
# gem &quot;hpricot&quot;, &quot;0.6&quot;
# gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;
# gem &quot;aws-s3&quot;, :require =&gt; &quot;aws/s3&quot;

## Bundle gems used only in certain environments:
# gem &quot;rspec&quot;, :group =&gt; :test
# group :test do
#   gem &quot;webrat&quot;
# end
</pre>

<p>En este fichero ya figuran un par de gemas, incluyendo <code>rails</code> y <code>sqlite3-ruby</code>.  N&oacute;tese que la linea que hacerreferencia a la gema <code>rails</code> trae un n&uacute;mero de versi&oacute;n: adem&aacute;s de hacer referencia a la gema podemos se&ntilde;alar un n&uacute;mero de versi&oacute;n concreta. Si queremos actualizar la versi&oacute;n de Rails en alg&uacute;n momento podemos cabiar la versi&oacute;n aqu&iacute; en lugar de hacerlo en el fichero <code>environment.rb</code>.</p>
<p>Si queremos utilizar gemas extra en nuestra aplicaci&oacute;n tan s&oacute;lo tenemos que a&ntilde;adirlas en este archivo.  Por ejemplo, si queremos utilizar <code>will_paginate</code> podemos escribir la siguiente referencia:</p>

<pre class="ruby">
gem &quot;will_paginate&quot;, &quot;&gt;=2.3.12&quot;
</pre>

<p>El segundo par&aacute;metro es el n&uacute;mero de versi&oacute;n, lo que significa que Bundler instalar&aacute; la versi&oacute;n 2.3.12 (o una versi&oacute;n posterior si es que la encuentra)  Una vez a&ntilde;adida la referencia a esta gema podemos instalarla con <code>bundle install</code>, pero antes de hacerlo veremos otro comando: <code>bundle check</code>.</p>

<p>Podemos ejecutar <code>bundle check</code> para enumerar las gemas de las que depende nuestra aplicaci&oacute;n pero que no est&aacute;n instaladas. En nuestro caso veremos que la gema <code>will_paginate</code> que hemos a&ntilde;adido no est&aacute; a&uacute;n instalada.</p>


<pre class="terminal">
$ bundle check
The following dependencies are missing
  * will_paginate (&gt;= 2.3.12, runtime)We can install the missing gems by running bundle install again. 
</pre>

<p>Para ver qu&eacute; otros comandos est&aacute;n disponibles podemos ejecutar <code> bundle help</code>.</p>

<pre class="terminal">$ bundle help
Tasks:
  bundle check        # Checks if the dependencies listed in Gemfile are satisfied by currently installed gems
  bundle exec         # Run the command in context of the bundle
  bundle help [TASK]  # Describe available tasks or one specific task
  bundle init         # Generates a Gemfile into the current working directory
  bundle install      # Install the current environment to the system
  bundle lock         # Locks the bundle to the current set of dependencies, including all child dependencies.
  bundle pack         # Packs all the gems to vendor/cache
  bundle show         # Shows all gems that are part of the bundle.
  bundle unlock       # Unlock the bundle. This allows gem versions to be changed
</pre>

<h3>Otras opciones de Gemfile</h3>

<p>Volvamos a nuestro Gemfile para ver qu&eacute; m&aacute;s podemos hacer con &eacute;l. Una nueva funcionalidad interesante es la posibilidad de obtener una gema de un repositorio git.  Por ejemplo, si queremos vivir al l&iacute;mite y utilizar la &uacute;ltima versi&oacute;n de Rails en nuestra aplicaci&oacute;n podemos apuntar la gema Rails a su repositorio Git.</p>

<pre class="ruby">
# Bundle edge rails:
gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;
</pre>

<p>Esta funcionalidad es bastante poderosa. Si una gema no funciona exactamente como queremos podemos desdoblar el proyecto en Github, modificar el c&oacute;digo a nuestro gusto y luego anotar que la gema depende de nuestra versi&oacute;n.</p>

<p>Tambi&eacute;n podemos hacer que ciertas gemas queden restringidas a un entorno determinado.  Si queremos utilizar RSpec para hacer pruebas podemos pasar la opci&oacute;n <code>:group</code> para ce&ntilde;ir su uso al entorno de test.</p>

<pre class="ruby">
gem &quot;rspec&quot;, :group =&gt; :test
</pre>

<p>Alternativamente, podemos pasar un bloque si queremos aplicar esta restricci&oacute;n a todo un conjunto de gemas.</p>

<pre class="ruby">
group :test do
  gem &quot;webrat&quot;
  get &quot;rspec&quot;
end
</pre>

<p>Si ejecutamos ahora <code>bundle install</code> se instalar&aacute;n todas las gemas que hemos especificado para cada entorno.</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
...
Installing rspec (1.3.0) from rubygems repository at http://gemcutter.org 
...
Installing webrat (0.7.0) from rubygems repository at http://gemcutter.org 
Installing will_paginate (2.3.12) from system gems 
Your bundle is complete!
</pre>

<p>Se han instalado las dos nuevas gemas que hemos especificado en nuestro <code>Gemfile</code>, como puede verse por la salida anterior (que hemos truncado).</p>

<p>Si queremos instalar gemas pero evitar aquellas que pertenecen a cierto entorno, podemos utilizar la opci&oacute;n <code>--without</code>.  Por ejemplo podemos ejecutar lo siguiente para instalar las gemas que no  pertenecen al entorno de test:</p>

<pre class="terminal">
bundle install --without=test
</pre>

<p>Esto puede sernos &uacute;til cuando instalemos la aplicaci&oacute;n en nuestro servidor de producci&oacute;n y no queramos instalar las gemas que s&oacute;lo se utilizan en el entorno de pruebas.</p>

<h3>Cierre de gemas</h3>

<p>Otro comando &uacute;til es <code>bundle lock</code>.  Esto <em>cierra</em> la versi&oacute;n espec&iacute;fica de las gemas que utiliza nuestra aplicaci&oacute;n, y tras ejecutarlo nuestro proyecto tendr&aacute; un nuevo archivo llamado <code>Gemfile.lock</code>. En este archivo aparecen todas las gemas instaladas para nuestra aplicaci&oacute;n junto con la versi&oacute;n espec&iacute;fica que utilizan. Despu&eacute;s de ejecutar <code>bundle lock</code> cuando volvamos a ejecutar <code>bundle install</code> s&oacute;lo se instalar&aacute;n las versiones espec&iacute;ficas que aparecen en el archivo <code>Gemfile.lock</code>, incluso aunque existan versiones m&aacute;s recientes.</p>

<p>Cabr&iacute;a preguntarse por qu&eacute; querr&iacute;amos utilizar <code>bundle lock</code>. Merece la pena su uso cuando un proyecto se utilice desde diferentes lugares, por ejemplo: si estamos trabajando con otros desarrolladores Rails en un proyecto podemos utilizar este <em>cierre de gemas</em> para que todos usen las mismas versiones de las gemas.  Lo mismo puede aplicarse cuando despleguemos la aplicaci&oacute;n en producci&oacute;n.  Como la aplicaci&oacute;n pasar&aacute; a ejecutarse en un servidor diferente nos interesa asegurarnos que en la m&aacute;quina de producci&oacute;n se instalan las mismas versiones exactas que en nuestra m&aacute;quina de desarrollo.</p>

<p>Si necesit&aacute;semos efectuar cambios sobre las gemas de una aplicaci&oacute;n despu&eacute;s de la ejecuci&oacute;n de <code>bundle lock</code> no deber&iacute;amos cambiar el fichero <code>Gemfile.lock</code> sino que actualizaremos el fichero <code>Gemfile</code>  igual que antes.  Sin embargo, una vez que hayamos hecho estos cambios no podremos actualizar las gemas con <code>bundle install</code> porque el Gemfile est&aacute; bloqueado.  Para hacerlo tenemos que pasar la opc&oacute;n <code>--relock</code>.</p>

<pre class="terminal">
bundle install --relock
</pre>

<p>Esto desbloquear&aacute; el <code>Gemfile</code>, actualizar&aacute; las gemas y luego lo volver&aacute; a cerrar.</p>

<h3>Empaquetado de Gemas de una aplicaci&oacute;n.</h3>
<p>Con esto hemos cubierto pr&aacute;cticamente el flujo de trabajo normal de Bundler pero a&uacute;n nos queda espacio para ver una &uacute;ltima funcionalidad, que es el comando <code>bundle pack</code>.</p>

<p>Bundler instala las gemas en un fichero <code>.bundle</code> en el directorio de nuestra cuenta  de usuario.</p>

<pre class="terminal">
$ ls ~/.bundle
cache		doc		gems		ruby		specifications
</pre>

<p>Esto quiere decir que las gemas no se distribuyen con nuestra aplicaci&oacute;n y por tanto no se incluyen en el sistema de control de versiones de nuestro proyecto.  Si queremos almacenar las gemas dentro de nuestra aplicaci&oacute;n pdoemos ejecutar <code>bundle pack</code>.</p>

<pre class="terminal">bundle pack
Copying .gem files into vendor/cache
  * memcache-client-1.7.8.gem
  * rspec-1.3.0.gem
  * thor-0.13.3.gem
  * tzinfo-0.3.16.gem
  * builder-2.1.2.gem
  * nokogiri-1.4.1.gem
  * mime-types-1.16.gem
  * sqlite3-ruby-1.2.5.gem
  * i18n-0.3.3.gem
  * abstract-1.0.0.gem
  * erubis-2.6.5.gem
  * text-hyphen-1.0.0.gem
  * bundler-0.9.6.gem
  * rake-0.8.7.gem
  * will_paginate-2.3.12.gem
  * text-format-1.0.0.gem
  * rack-1.1.0.gem
  * rack-test-0.5.3.gem
  * webrat-0.7.0.gem
  * rack-mount-0.4.7.gem
  * activesupport-3.0.0.beta.gem
  * mail-2.1.2.gem
  * arel-0.2.1.gem
  * activemodel-3.0.0.beta.gem
  * actionpack-3.0.0.beta.gem
  * actionmailer-3.0.0.beta.gem
  * activerecord-3.0.0.beta.gem
  * activeresource-3.0.0.beta.gem
  * railties-3.0.0.beta.gem
  * rails-3.0.0.beta.gem
</pre>  

<p>Esto generar&aacute; los fichero <code>.gem</code> necesarios para nuestra aplicaci&oacute;n y los copiar&aacute; al directorio <code>/vendor/cache</code> cr&eacute;andolo si es necesario. Las gemas ahora se instalar&aacute;n desde este directorio en lugar de hacerlo remotamente desde, por ejemplo, Gemcutter.</p>

<p>Esto no deber&iacute;a ser necesario tener que hacerlo con mucha frecuencia, pero podr&iacute;a sernos &uacute;til si no queremos o no podemos hacer que nuestro servidor de producci&oacute;n se conecte a Gemcutter para descargar las gemas.</p>

<p>Eso es todo por este episodio, esperamos haber dado una buena visi&oacute;n general del uso de Bundler para gestionar las gemas en nuestra aplicaci&oacute;n. Puede que tardemos un poco en acostumbrarnos a usar Bundler pero a largo plazo nos ahorrar&aacute; muchos de los problemas que hemos podido sufrir en el pasado debido a las dependencias de gemas.</p>

<p>Terminamos con la recomendaci&oacute;n de visitar <a href="http://railsplugins.org/">railsplugins.org</a>. Probablemente nos preguntemos qu&eacute; gemas y <em>plugins</em> funcionan con Rails 3 y este es el lugar al que acudir para averiguarlo.  En este sitio podremos hojear los <em>plugins</em> y ver si funcionan con Rails 3 y Ruby 1.9.</p>

<div class="imageWrapper">
  <img src="/system/photos/328/original/E201I01.png" alt="El sitio web de RailsPlugins." height="634" width="767" />
</div>

<p>Tenemos una oportunidad &uacute;nica para echar una mano si vemos que alguna gema que queramos utilizar con Rails 3 aparece como que no funciona o no est&aacute; probada, de esta manera podremos conseguir que el m&aacute;ximo n&uacute;mero de gemas y <em>plugins</em> funcionen bajo Rails 3.</p>