<p>Dans cet &eacute;pisode, nous allons continuer de regarder les nouvelles fonctionnalit&eacute;s de Rails&nbsp;3. Cette fois, nous allons voir <a href="http://github.com/carlhuda/bundler">bundler</a> qui est le nouveau syst&egrave;me de gestion de d&eacute;pendances de gems pour les applications Rails.</p>

<p>Bundler est mis &agrave; jour souvent ces derniers temps. Prenez donc le temps de le mettre &agrave; jour avant de faire quelque chose avec. Vous pouvez v&eacute;rifier que vous avez la derni&egrave;re version en faisant&nbsp;:</p>

<pre class="terminal">
gem install bundler
</pre>

<p>Notez que nous n&#x27;utilisons pas <code>sudo</code> lorsque nous installons la gem parce que nous fonctionnons avec une version de Ruby install&eacute;e avec rvm.</p>

<h3>Utiliser Bundler pour installer des gems</h3>

<p>Dans l&#x27;&eacute;pisode pr&eacute;c&eacute;dent, quand nous avons essay&eacute; de lancer le serveur web de notre application, il s&#x27;est plaint de l&#x27;absence de la gem sqlite-ruby. Nous avons r&eacute;solu ce probl&egrave;me en installant la gem &agrave; la main avec <code>gem install</code>.</p>

<pre class="terminal">
gem install sqlite3-ruby
</pre>

<p>Nous aurions pu cependant le faire gr&acirc;ce &agrave; bundler vu que sqlite3-ruby est une d&eacute;pendance bundler de notre application (elle est list&eacute;e dans le <code>Gemfile</code> de l&#x27;application). Pour ce faire, nous appelons <code>bundle install</code> qui va parcourir la liste des gems dont l&#x27;application d&eacute;pend et les installer.</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
Installing abstract (1.0.0) from system gems 
Installing actionmailer (3.0.0.beta) from system gems 
Installing actionpack (3.0.0.beta) from system gems 
Installing activemodel (3.0.0.beta) from system gems 
Installing activerecord (3.0.0.beta) from system gems 
Installing activeresource (3.0.0.beta) from system gems 
Installing activesupport (3.0.0.beta) from system gems 
Installing arel (0.2.1) from rubygems repository at http://gemcutter.org 
Installing builder (2.1.2) from system gems 
Installing bundler (0.9.5) from system gems 
Installing erubis (2.6.5) from system gems 
Installing i18n (0.3.3) from system gems 
Installing mail (2.1.2) from system gems 
Installing memcache-client (1.7.8) from system gems 
Installing mime-types (1.16) from system gems 
Installing rack (1.1.0) from system gems 
Installing rack-mount (0.4.7) from rubygems repository at http://gemcutter.org 
Installing rack-test (0.5.3) from system gems 
Installing rails (3.0.0.beta) from system gems 
Installing railties (3.0.0.beta) from system gems 
Installing rake (0.8.7) from system gems 
Installing sqlite3-ruby (1.2.5) from system gems 
Installing text-format (1.0.0) from system gems 
Installing text-hyphen (1.0.0) from system gems 
Installing thor (0.13.1) from rubygems repository at http://gemcutter.org 
Installing tzinfo (0.3.16) from system gems 
Your bundle is complete!
</pre>

<p>Nous pouvons voir, dans l&#x27;affichage ci-dessus, que bundler a install&eacute; toutes les gems dont l&#x27;application a besoin, y compris sqlite3-ruby. Si elle n&#x27;avait pas &eacute;t&eacute; d&eacute;j&agrave; install&eacute;e, bundler l&#x27;aurait t&eacute;l&eacute;charg&eacute;e depuis Gemcutter et l&#x27;aurait install&eacute;e.</p>

<p>En clair, dans le doute, faites <code>bundle install</code>. Vous devriez le faire chaque fois que vous cr&eacute;ez une nouvelle application Rails ou que vous clonez l&#x27;application de quelqu&#x27;un d&#x27;autre. Cela vous assure d&#x27;avoir les bonnes gems install&eacute;es. Vous devriez &eacute;galement le faire lorsque vous d&eacute;ployez une application de fa&ccedil;on &agrave; ce que les gems soient install&eacute;es sur le serveur. Vous pouvez m&ecirc;me l&#x27;ajouter &agrave; vos recettes de d&eacute;ploiement pour que &ccedil;a soit fait chaque fois que vous d&eacute;ployez votre application.</p>

<p>Il est important de noter que vous ne devriez jamais utiliser <code>sudo</code> lorsque vous appelez <code>bundle install</code>, m&ecirc;me si vous utilisez <code>sudo</code> d&#x27;habitude lors de l&#x27;installation de gems.</p>

<h3>Ajouter des d&eacute;pendances sur des gems</h3>

<p>Maintenant que nous savons comment g&eacute;rer nos gems, comment ajoutons-nous de nouvelles d&eacute;pendances &agrave; notre application ? Dans les versions pr&eacute;c&eacute;dentes de Rails nous devions g&eacute;rer cela dans le fichier <code>/config/environment.rb</code> de notre application mais  avec Rails&nbsp;3, la configuration des gems se fait dans un fichier appel&eacute; <code>Gemfile</code> &agrave; la racine de l&#x27;application. Le Gemfile par d&eacute;faut ressemble &agrave; ceci&nbsp;:</p>

<pre class="ruby">
# Edit this Gemfile to bundle your application&#x27;s dependencies.
source &#x27;http://gemcutter.org&#x27;


gem &quot;rails&quot;, &quot;3.0.0.beta&quot;

## Bundle edge rails:
# gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;

# ActiveRecord requires a database adapter. By default,
# Rails has selected sqlite3.
gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;

## Bundle the gems you use:
# gem &quot;bj&quot;
# gem &quot;hpricot&quot;, &quot;0.6&quot;
# gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;
# gem &quot;aws-s3&quot;, :require =&gt; &quot;aws/s3&quot;

## Bundle gems used only in certain environments:
# gem &quot;rspec&quot;, :group =&gt; :test
# group :test do
#   gem &quot;webrat&quot;
# end
</pre>

<p>Un certain nombre de gems est d&eacute;j&agrave; pr&eacute;sent dans le fichier, y compris <code>rails</code> et <code>sqlite3-ruby</code>. Notez que la ligne r&eacute;f&eacute;ren&ccedil;ant la gem <code>rails</code> inclue un num&eacute;ro de version. Nous pouvons sp&eacute;cifier une num&eacute;ro de version pour chaque gem pour choisir la version install&eacute;e. Si nous voulons mettre Rails &agrave; jour, nous pouvons changer le num&eacute;ro de version ici plut&ocirc;t que dans le fichier <code>environment.rb</code>.</p>

<p>Pour utiliser n&#x27;importe quelle gem suppl&eacute;mentaire dans notre application, nous devons juste les ajouter dans le <code>Gemfile</code>. Par exemple, si nous voulons utiliser will_paginate, nous pouvons y faire r&eacute;f&eacute;rence comme ceci&nbsp;:</p>

<pre class="ruby">
gem &quot;will_paginate&quot;, &quot;&gt;=2.3.12&quot;
</pre>

<p>Le second param&egrave;tre est un num&eacute;ro de version et, utilis&eacute; ici, il signifie que bundler va installer la version 2.3.12 ou toute version plus r&eacute;cente trouv&eacute;e. Une fois la r&eacute;f&eacute;rence &agrave; la gem ajout&eacute;e, nous pouvons l&#x27;installer avec <code>bundle install</code> mais avant de le faire, nous allons montrer une autre commande de bundler, <code>bundle check</code>.</p>

<p>Nous pouvons lancer <code>bundle check</code> pour lister les gems dont notre application d&eacute;pend mais qui ne sont pas install&eacute;es. Si nous lan&ccedil;ons cette commande pour notre application, elle va nous montrer que la gem will_paginate est r&eacute;f&eacute;renc&eacute;e mais non install&eacute;e.</p>

<pre class="terminal">
$ bundle check
The following dependencies are missing
  * will_paginate (&gt;= 2.3.12, runtime)We can install the missing gems by running bundle install again. 
</pre>

<p>Pour voir les autres commandes de bundle disponibles, nous pouvons lancer <code>bundle help</code>.</p>

<pre class="terminal">
$ bundle help
Tasks:
  bundle check        # Checks if the dependencies listed in Gemfile are satisfied by currently installed gems
  bundle exec         # Run the command in context of the bundle
  bundle help [TASK]  # Describe available tasks or one specific task
  bundle init         # Generates a Gemfile into the current working directory
  bundle install      # Install the current environment to the system
  bundle lock         # Locks the bundle to the current set of dependencies, including all child dependencies.
  bundle pack         # Packs all the gems to vendor/cache
  bundle show         # Shows all gems that are part of the bundle.
  bundle unlock       # Unlock the bundle. This allows gem versions to be changed
</pre>

<h3>Les autres options du Gemfile</h3>

<p>Retournons dans notre Gemfile pour voir ce que nous pouvons faire d&#x27;autre avec. Une nouvelle fonctionnalit&eacute; sympathique, est la possibilit&eacute; de r&eacute;cup&eacute;rer une gem depuis un d&eacute;p&ocirc;t git. Par exemple, si nous voulons &ecirc;tre &agrave; la pointe et utiliser la toute derni&egrave;re version de Rails dans notre application, nous pouvons pointer sur son d&eacute;p&ocirc;t Git.</p>

<pre class="ruby">
# Bundle edge rails:
gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;
</pre>

<p>C&#x27;est une fonctionnalit&eacute; puissante. Si une gem ne fonctionne pas comme nous le souhaitons, nous pouvons cr&eacute;er un fork sur Github, modifier le code pour l&#x27;adapter &agrave; nos besoins et pointer sur notre d&eacute;p&ocirc;t pour utiliser notre version.</p>

<p>Nous pouvons &eacute;galement restreindre les gems &agrave; un certain environnement. Si nous voulons utiliser RSpec pour les tests, nous pouvons passer l&#x27;option <code>:group</code> pour le restreindre &agrave; l&#x27;environnement de test.</p>

<pre class="ruby">
gem &quot;rspec&quot;, :group =&gt; :test
</pre>

<p>Dans le cas o&ugrave; nous avons un certain nombre de gems &agrave; restreindre &agrave; un environnement donn&eacute;, nous pouvons utiliser <code>group</code> et lui passer un bloc.</p>

<pre class="ruby">
group :test do
  gem &quot;webrat&quot;
  get &quot;rspec&quot;
end
</pre>

<p>Si nous lan&ccedil;ons <code>bundle install</code> maintenant, cela va installer toutes les gems ajout&eacute;es &agrave; cet environnement.</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
...
Installing rspec (1.3.0) from rubygems repository at http://gemcutter.org 
...
Installing webrat (0.7.0) from rubygems repository at http://gemcutter.org 
Installing will_paginate (2.3.12) from system gems 
Your bundle is complete!
</pre>

<p>Comme nous pouvons le voir sur l&#x27;affichage (tronqu&eacute;) ci-dessus, deux gems de notre <code>Gemfile</code> sont install&eacute;es.</p>

<p>Si nous voulons installer des gems mais en excluant celles d&#x27;un certain environnement, nous pouvons utiliser l&#x27;option <code>--without</code>. Pour installer les gems qui ne sont pas dans le groupe test, nous pouvons lancer&nbsp;:</p>

<pre class="terminal">
bundle install --without=test
</pre>

<p>C&#x27;est utile lors de l&#x27;installation de votre application sur un serveur de production et que vous ne voulez pas installer les gems utiles uniquement pour les tests.</p>

<h3>Verrouiller les gems</h3>

<p>Une autre commande utile est <code>bundle lock</code>. Cela verrouille les versions sp&eacute;cifiques des gems que votre application utilise. Apr&egrave;s que nous l&#x27;ayons lanc&eacute;e, notre projet aura un nouveau fichier nomm&eacute; <code>Gemfile.lock</code>. Ce fichier liste toutes les gems install&eacute;es pour notre application ainsi que les versions utilis&eacute;es. Apr&egrave;s avoir lanc&eacute; <code>bundle lock</code>, seules les versions list&eacute;es dans le fichier <code>Gemfile.lock</code> seront install&eacute;es lorsque nous lancerons <code>bundle install</code>, m&ecirc;me s&#x27;il existe des versions plus r&eacute;centes.</p>

<p>Vous pouvez vous demander quand vous pourriez avoir besoin de <code>bundle lock</code>. Et bien c&#x27;est utile lorsque le projet est utilis&eacute; dans plusieurs endroits. Si nous travaillons avec d&#x27;autres d&eacute;veloppeurs web sur un projet, nous pouvons utiliser <code>bundle lock</code> pour &ecirc;tre s&ucirc;r que tout le monde travaille avec les m&ecirc;mes versions des gems utilis&eacute;es par l&#x27;application. Cela est valable &eacute;galement lors du d&eacute;ploiement de l&#x27;application en production. Comme l&#x27;application est d&eacute;ploy&eacute;e sur un autre serveur, nous voulons &ecirc;tre s&ucirc;rs que les versions exactes des gems install&eacute;es sur notre machine de d&eacute;veloppement soient utilis&eacute;es sur le serveur de production.</p>

<p>Si nous avons besoin de modifier la liste des gems apr&egrave;s avoir appel&eacute; <code>bundle lock</code>, nous ne devons pas changer le fichier <code>Gemfile.lock</code> directement. Nous devrions plut&ocirc;t mettre &agrave; jour le fichier <code>Gemfile</code> comme avant. Une fois nos changements effectu&eacute;s dans le fichier <code>Gemfile</code>, lancer <code>bundle install</code> ne va pas mettre les gems de l&#x27;application &agrave; jour puisque le <code>Gemfile</code> est verrouill&eacute;. Pour mettre les gems &agrave; jour, nous devons passer l&#x27;option <code>--relock</code>.</p>

<pre class="terminal">
bundle install --relock
</pre>

<p>Cela va d&eacute;verrouiller le <code>Gemfile</code>, mettre les gems &agrave; jour et re-verrouiller.</p>

<h3>Empaqueter les gems dans une application</h3>

<p>Cela couvre &agrave; peu pr&egrave;s le workflow basique de bundler et devrait vous donner assez pour travailler avec bundler dans vos applications. Une derni&egrave;re fonctionnalit&eacute; de bundler que nous allons voir est <code>bundle pack</code>.</p>

<p>Bundler installe les gems dans un dossier <code>.bundle</code> &agrave; la racine de notre compte.</p>

<pre class="terminal">
$ ls ~/.bundle
cache		doc		gems		ruby		specifications
</pre>

<p>Cela signifie que les gems ne sont pas embarqu&eacute;es dans notre application et ne sont pas inclues dans notre syst&egrave;me de contr&ocirc;le de versions. Si nous voulons stocker les gems dans notre application, nous pouvons lancer <code>bundle pack</code>.</p>

<pre class="terminal">
bundle pack
Copying .gem files into vendor/cache
  * memcache-client-1.7.8.gem
  * rspec-1.3.0.gem
  * thor-0.13.3.gem
  * tzinfo-0.3.16.gem
  * builder-2.1.2.gem
  * nokogiri-1.4.1.gem
  * mime-types-1.16.gem
  * sqlite3-ruby-1.2.5.gem
  * i18n-0.3.3.gem
  * abstract-1.0.0.gem
  * erubis-2.6.5.gem
  * text-hyphen-1.0.0.gem
  * bundler-0.9.6.gem
  * rake-0.8.7.gem
  * will_paginate-2.3.12.gem
  * text-format-1.0.0.gem
  * rack-1.1.0.gem
  * rack-test-0.5.3.gem
  * webrat-0.7.0.gem
  * rack-mount-0.4.7.gem
  * activesupport-3.0.0.beta.gem
  * mail-2.1.2.gem
  * arel-0.2.1.gem
  * activemodel-3.0.0.beta.gem
  * actionpack-3.0.0.beta.gem
  * actionmailer-3.0.0.beta.gem
  * activerecord-3.0.0.beta.gem
  * activeresource-3.0.0.beta.gem
  * railties-3.0.0.beta.gem
  * rails-3.0.0.beta.gem
</pre>  

<p>Cela va g&eacute;n&eacute;rer le fichier <code>.gem</code> dont notre application a besoin et les copier dans son dossier <code>/vendor/cache</code>, en cr&eacute;ant le dossier si besoin. Les gems seront maintenant install&eacute;es directement depuis ce fichiers <code>.gem</code> au lieu d&#x27;&ecirc;tre r&eacute;cup&eacute;r&eacute;es depuis, par exemple, Gemcutter.</p>

<p>Vous ne devriez pas en avoir besoin tr&egrave;s souvent mais si vous &ecirc;tes dans une situation o&ugrave; vous ne voulez pas que le serveur de production se connecte &agrave; Gemcutter pour t&eacute;l&eacute;charger les gems, c&#x27;est une bonne solution.</p>

<p>C&#x27;est tout pour cet &eacute;pisode. J&#x27;esp&egrave;re que cela vous a donn&eacute; un bon aper&ccedil;u de comment bundler g&egrave;re les gems de vos applications. Bundler peut prendre un peu de temps &agrave; appr&eacute;hender mais il r&egrave;gle de nombreux probl&egrave;mes li&eacute;s &agrave; la gestion de d&eacute;pendances que l&#x27;on pouvait rencontrer par le pass&eacute;.</p>

<p>Nous terminerons en vous encourageant &agrave; visiter <a href="http://railsplugins.org/">railsplugins.org</a>. Vous vous demandez probablement quelles gems et quels plugins sont compatibles avec Rails&nbsp;3. C&#x27;est l&#x27;endroit o&ugrave; trouver la r&eacute;ponse. Sur ce site, vous pouvez parcourir les plugins et voir s&#x27;ils fonctionnent avec Rails&nbsp;3 et Ruby&nbsp;1.9.</p>

<div class="imageWrapper">
  <img src="/system/photos/328/original/E201I01.png" width="767" height="634" alt="Le site RailsPlugins." />
</div>

<p>Si vous voulez utiliser une gem avec Rails&nbsp;3 mais qu&#x27;elle est list&eacute;e comme ne fonctionnant pas ou n&#x27;&eacute;tant pas test&eacute;e, c&#x27;est une bonne opportunit&eacute; de lever des tickets ou d&#x27;aider &agrave; corriger cela. De cette fa&ccedil;on, vous pouvez aider et vous impliquer dans l&#x27;effort fait pour que le plus de plugins et de gems soient compatibles avec Rails&nbsp;3.</p>