<p>&#x4E0A;&#x4E00;&#x96C6;&#x6211;&#x4EEC;&#x7ED9;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#x7684;&#x5206;&#x9875;&#x52A0;&#x4E0A;&#x4E86;AJAX&#x529F;&#x80FD;&#x3002;&#x4E0E;&#x901A;&#x5E38;&#x7684;HTML&#x94FE;&#x63A5;&#x4E0D;&#x540C;&#xFF0C;&#x901A;&#x8FC7;&#x975E;&#x4FB5;&#x5165;&#x5F0F;&#x7684;JavaScript&#x5728;&#x5206;&#x9875;&#x94FE;&#x63A5;&#x4E0A;&#x7ED1;&#x5B9A;click&#x4E8B;&#x4EF6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x70B9;&#x51FB;&#x65F6;&#x53D1;&#x51FA;AJAX&#x8BF7;&#x6C42;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#x66FF;&#x6362;&#x4E3A;&#x4E00;&#x9875;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x5185;&#x5BB9;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/164/original/E175I01.png" width="823" height="429" alt="Our products page."/>
</div>

<h3>AJAX&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;</h3>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;AJAX&#x6765;&#x66F4;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x65B0;&#x7684;&#x4E00;&#x9875;&#x4EA7;&#x54C1;&#x88AB;&#x52A0;&#x8F7D;&#x65F6;URL&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x3001;&#x6216;&#x8005;&#x6536;&#x5F55;&#x4E66;&#x7B7E;&#x540E;&#x518D;&#x6253;&#x5F00;&#x90A3;&#x4E00;&#x9875;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x7BA1;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5728;&#x54EA;&#x4E00;&#x9875;&#xFF0C;&#x90FD;&#x53EA;&#x4F1A;&#x663E;&#x793A;&#x7B2C;&#x4E00;&#x9875;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;AJAX&#x7684;&#x540E;&#x679C;&#x662F;&#xFF0C;&#x7FFB;&#x9875;&#x4EE5;&#x540E;&#x4E0A;&#x4E00;&#x9875;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x8BB0;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6CA1;&#x6CD5;&#x7528;&#x8FD4;&#x56DE;&#x3001;&#x524D;&#x8FDB;&#x6309;&#x94AE;&#x5728;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x8FC7;&#x7684;&#x9875;&#x9762;&#x4E2D;&#x524D;&#x540E;&#x6D4F;&#x89C8;&#x3002;</p>

<p>&#x8FD9;&#x4E9B;&#x662F;&#x4F7F;&#x7528;&#x4E86;AJAX&#x65B9;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#xFF1B;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x5417;&#xFF1F;&#x8FD9;&#x5C06;&#x662F;&#x672C;&#x96C6;&#x6211;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x96C6;&#x4F1A;&#x66F4;&#x591A;&#x5730;&#x8BA8;&#x8BBA;JavaScript&#x3001;&#x800C;&#x4E0D;&#x662F;Ruby on Rails&#x3002;</p>

<p>&#x6709;&#x5F88;&#x591A;JavaScript&#x7A0B;&#x5E8F;&#x5E93;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5728;Google code&#x4E0A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x65E9;&#x7684;&#x53EB;<a href="http://code.google.com/p/reallysimplehistory/">reallysimplehistory</a>&#x7684;&#x3002;Yahoo&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x53EB;<a href="http://developer.yahoo.com/yui/history/">Browser History Manager</a>&#x7684;&#x3002;Yahoo&#x6709;&#x5F88;&#x591A;JavaScript&#x7A0B;&#x5E8F;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5F88;&#x503C;&#x5F97;&#x4E00;&#x770B;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x662F;Asual&#x7684;<a href="http://www.asual.com/swfaddress/">SWFAddress</a>&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;Flash&#x3001;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;JavaScript&#x3002;</p>

<p>&#x6240;&#x6709;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5E93;&#x90FD;&#x662F;&#x652F;&#x6301;&#x7EAF;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;jQuery&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x80FD;&#x652F;&#x6301;&#x5B83;&#x7684;&#x3002;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;Asual&#x66FE;&#x7ECF;&#x53D1;&#x5E03;&#x8FC7;&#x4E00;&#x4E2A;&#x53EB;<a href="http://www.asual.com/jquery/address/">jQuery Address</a>&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x7684;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#xFF0C;&#x53EB;<a href="http://benalman.com/projects/jquery-url-utils-plugin/">jQuery URL Utils plugin</a>&#x3002;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x867D;&#x7136;&#x5C0F;&#xFF08;&#x538B;&#x7F29;&#x540E;&#x4E0D;&#x5230;4KB&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x529F;&#x80FD;&#x5F88;&#x4E30;&#x5BCC;&#xFF0C;&#x4E5F;&#x6709;&#x5F88;&#x597D;&#x7684;&#x6587;&#x6863;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5148;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x76EE;&#x5F55;<code>/public/javascripts</code>&#x4E0B;&#x4FDD;&#x5B58;&#x4E3A;<code>jquery.ba-url.js</code>&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x4EA7;&#x54C1;index&#x9875;&#x9762;&#x4E2D;&#x5F15;&#x7528;&#x5B83;&#x3002;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x5728;<code>pagination.js</code>&#x4E4B;&#x524D;&#x5F15;&#x7528;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5F15;&#x7528;JavaScript&#x7684;&#x90A3;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x628A;&#x5B83;&#x52A0;&#x5230;<code>pagination</code>&#x7684;&#x524D;&#x9762;&#x3002;</p>

<pre class="ruby">
&lt;% javascript &#x27;jquery.ba-url&#x27;, &#x27;pagination&#x27; %&gt;  
</pre>

<h3>&#x6539;&#x8FDB;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x9875;&#x4EE3;&#x7801;</h3>

<p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x6765;&#x7528;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x4E0A;&#x96C6;&#x4E2D;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x5206;&#x9875;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<pre class="javascript">
$(function () {   
  $(&#x27;.pagination a&#x27;).live(&quot;click&quot;, function () {   
    $(&#x27;.pagination&#x27;).html(&#x27;Page is loading...&#x27;);   
    $.get(this.href, null, null, &#x27;script&#x27;);   
    return false;   
  });   
}); 
</pre>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7A0D;&#x7A0D;&#x505A;&#x4E9B;&#x6539;&#x8FDB;&#x3002;&#x4E0D;&#x518D;&#x4F7F;&#x7528;<code>$.get</code>&#x800C;&#x662F;&#x7528;<code>$.getScript</code>&#x6765;&#x53D1;&#x8D77;AJAX&#x8BF7;&#x6C42;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x8C03;&#x7528;&#x7684;URL&#x3002;</p>

<pre class="javascript">
$.getScript(this.href);  
</pre>

<p><code>$.getScript</code>&#x51FD;&#x6570;&#x5411;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x5165;&#x7684;URL&#x53D1;&#x8D77;&#x4E00;&#x4E2A;GET&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x8FD4;&#x56DE;&#x7684;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x529F;&#x80FD;&#x548C;<code>$.get</code>&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x6D01;&#x3002;</p>

<h3>&#x4E3A;&#x6BCF;&#x4E00;&#x9875;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;URL</h3>

<p>&#x73B0;&#x5728;&#x6765;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x5206;&#x9875;&#x94FE;&#x63A5;&#x88AB;&#x70B9;&#x51FB;&#x540E;&#xFF0C;&#x7528;JavaScript&#x6765;&#x66F4;&#x65B0;URL&#x3002;&#x8FD9;&#x6837;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x9875;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;URL&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x52A0;&#x5230;&#x4E66;&#x7B7E;&#x91CC;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;&#x6211;&#x4EEC;&#x6240;&#x5728;&#x4EA7;&#x54C1;&#x9875;&#x5BF9;&#x5E94;&#x7684;&#x552F;&#x4E00;URL&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x951A;&#x6807;&#x7B7E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x9875;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x662F;&#x5728;&#x672C;&#x5730;&#x8FD0;&#x884C;&#xFF0C;URL&#x5C06;&#x4F1A;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p>
<pre class="terminal">
http://localhost:3000/#page=2
</pre>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4E4B;&#x524D;&#x4E0B;&#x8F7D;&#x7684;&#x63D2;&#x4EF6;&#x6765;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;URL&#x3002;&#x63D2;&#x4EF6;&#x6709;&#x4E00;&#x4E2A;&#x53EB;<code>$.setFragment</code>&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x80FD;&#x591F;&#x4FEE;&#x6539;&#x5F53;&#x524D;URL&#x7684;&#x951A;&#x6807;&#x7B7E;&#x90E8;&#x5206;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;pagination&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6765;&#x7528;&#xFF1A;</p>
<pre class="javascript">
$(function () {   
  $(&#x27;.pagination a&#x27;).live(&quot;click&quot;, function () {   
    $.setFragment({ page: $.queryString(this.href).page });   
    $(&#x27;.pagination&#x27;).html(&#x27;Page is loading...&#x27;);   
    $.getScript(this.href);   
    return false;   
  });   
}); 
</pre>

<p>&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x7ED9;<code>$.setFragment</code>&#x4F20;&#x5165;&#x4E00;&#x4E2A;JavaScript&#x7684;&#x539F;&#x503C;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4F1A;&#x628A;&#x4ED6;&#x4EEC;&#x8F6C;&#x6210;&#x8C61;querystring&#x4E00;&#x6837;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5F62;&#x5982;<code>page=x</code>&#x7684;&#x951A;&#x6807;&#x7B7E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x952E;&#x662F;<code>page</code>&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5F97;&#x5230;&#x9875;&#x7801;&#x503C;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x7801;&#x503C;&#x5DF2;&#x7ECF;&#x5728;&#x6211;&#x4EEC;AJAX&#x8C03;&#x7528;&#x7684;URL&#x7684; querystring&#x91CC;&#x9762;&#x4E86;&#x3002;&#x8981;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>$.queryString</code>&#x51FD;&#x6570;&#x628A;querystring&#x4E2D;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x8F6C;&#x5316;&#x4E3A;JavaScript&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x4ECE;<code>page</code>&#x9879;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8BD5;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x4FEE;&#x6539;&#x540E;&#x7684;pagination&#x4EE3;&#x7801;&#x3002;&#x52A0;&#x8F7D;&#x5B8C;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x9875;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&ldquo;&#x4E0B;&#x4E00;&#x9875;&rdquo;&#xFF0C;&#x968F;&#x7740;AJAX&#x8BF7;&#x6C42;&#x7684;&#x53D1;&#x51FA;&#xFF0C;URL&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#x73B0;&#x5728;&#x4E5F;&#x662F;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x8BF4;&#x660E;&#x4E0A;&#x4E00;&#x9875;&#x5DF2;&#x7ECF;&#x88AB;&#x8BB0;&#x5F55;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/165/original/E175I02.png" width="823" height="403" alt="The current page is now show in the URL&rsquo;s anchor."/>
</div>
 
<h3>&#x641E;&#x5B9A;&#x8FD4;&#x56DE;&#x6309;&#x94AE;</h3>

<p>&#x4E8B;&#x60C5;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x3002;&#x867D;&#x7136;&#x8FD4;&#x56DE;&#x548C;&#x524D;&#x8FDB;&#x6309;&#x94AE;&#x53EF;&#x4EE5;&#x7528;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x70B9;&#x51FB;&#x5B83;&#x4EEC;&#x65F6;&#x5E76;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x9875;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x6211;&#x4EEC;&#x6536;&#x5F55;&#x7684;&#x4E66;&#x7B7E;&#x9875;&#xFF0C;&#x6216;&#x8005;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4E0D;&#x7BA1;URL&#x4E2D;&#x951A;&#x6807;&#x7B7E;&#x7684;&#x9875;&#x7801;&#x503C;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x663E;&#x793A;&#x7684;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x9875;&#x7684;&#x4EA7;&#x54C1;&#x9879;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x89E3;&#x51B3;&#x8FD4;&#x56DE;&#x548C;&#x524D;&#x8FDB;&#x6309;&#x94AE;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x5B83;&#x4EEC;&#x80FD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FA6;&#x542C;URL&#x4E2D;&#x951A;&#x6807;&#x7B7E;&#x53D8;&#x5316;&#x65F6;&#x7684;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x6240;&#x652F;&#x6301;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;pagination&#x4EE3;&#x7801;&#x4E2D;&#x589E;&#x52A0;&#x4E0B;&#x9762;&#x4E00;&#x884C;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x6FC0;&#x6D3B;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p>

<pre class="javascript">
$.fragmentChange(true);
</pre> 

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4FA6;&#x542C;&#x5230;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>$(document).bind</code>&#x51FD;&#x6570;&#xFF0C;&#x4F20;&#x5165;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x8981;&#x4FA6;&#x542C;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x540D;&#x5B57;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x518D;&#x4F20;&#x5165;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x90A3;&#x4E2A;&#x951A;&#x6807;&#x7B7E;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5C31;&#x53EA;&#x4F1A;&#x5728;&#x90A3;&#x4E2A;&#x951A;&#x6807;&#x7B7E;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#x88AB;&#x89E6;&#x53D1;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x4E8B;&#x4EF6;&#x88AB;&#x89E6;&#x53D1;&#x65F6;&#x80FD;&#x591F;&#x88AB;&#x6267;&#x884C;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5F39;&#x51FA;&#x4E00;&#x4E2A;<code>alert</code>&#x6765;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x662F;&#x4E0D;&#x662F;&#x4E07;&#x4E8B;&#x4FF1;&#x5907;&#x3002;</p>

<pre class="javascript">
$(document).bind(&quot;fragmentChange.page&quot;, function () {   
  alert(&#x27;fragment changed!&#x27;);   
});  
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x9875;&#x9762;&#x5E76;&#x4E14;&#x70B9;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5F39;&#x51FA;&#x7684;alert&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x770B;&#x5230;URL&#x4E2D;&#x7684;&#x951A;&#x6807;&#x7B7E;&#x4E5F;&#x53D8;&#x5316;&#x4E86;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x70B9;&#x51FB;&#x8FD4;&#x56DE;&#x6216;&#x8005;&#x524D;&#x8FDB;&#x6309;&#x94AE;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;alert&#x5F39;&#x51FA;&#x6765;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/166/original/E175I03.png" width="825" height="405" alt="The fragmentChange event is fired when the back button is clicked."/>
</div>
 
<p>&#x73B0;&#x5728;&#x70B9;&#x51FB;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x90FD;&#x53EF;&#x4EE5;&#x6355;&#x83B7;&#x5230;<code>fragmentChange</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x628A;AJAX&#x8BF7;&#x6C42;&#x642C;&#x5230;&#x90A3;&#x4E2A;&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#x53BB;&#x4E86;&#x3002;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x70B9;&#x51FB;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#x4E5F;&#x53EF;&#x4EE5;&#x53D1;&#x51FA;AJAX&#x8BF7;&#x6C42;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x70B9;&#x5C0F;&#x95EE;&#x9898;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x642C;&#x8FC7;&#x53BB;&#x7684;&#x90A3;&#x884C;&#x4EE3;&#x7801;&#x3002;</p>

<pre class="javascript">
$.getScript(this.href);
</pre>  

<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x8981;&#x5F15;&#x7528;&#x7684;&#x5206;&#x9875;&#x94FE;&#x63A5;&#x5DF2;&#x7ECF;&#x6CA1;&#x6CD5;&#x518D;&#x5F97;&#x5230;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x7528;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x9875;&#x7801;&#x503C;&#x3002;&#x6240;&#x5E78;&#xFF0C;&#x70B9;&#x51FB;&#x94FE;&#x63A5;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x6539;&#x53D8;URL&#x4E2D;&#x7684;&#x951A;&#x6807;&#x7B7E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x90A3;&#x91CC;&#x5F97;&#x5230;&#x9875;&#x7801;&#x503C;&#x3002;</p>
<pre class="javascript">
$.getScript(   
  $.queryString(   
    document.location.href, { &#x27;page&#x27;:$.fragment().page }   
  )   
); 
</pre>

<p>&#x8FD9;&#x5757;&#x4EE3;&#x7801;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x5206;&#x89E3;&#x6210;&#x591A;&#x884C;&#x4F7F;&#x5176;&#x66F4;&#x6E05;&#x6670;&#x4E00;&#x4E9B;&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;URL&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;<code>$.queryString</code>&#x51FD;&#x6570;&#xFF0C;&#x4F20;&#x5165;&#x53C2;&#x6570;<code>document.location.href</code>&#x6765;&#x83B7;&#x5F97;&#x9875;&#x9762;URL&#x7684;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#xFF0C;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x4E3A;<code>page</code>&#x7684;JavaScript&#x5BF9;&#x8C61;&#x6765;&#x6784;&#x9020;querystring&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>$.fragment().page</code>&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;URL&#x7684;&#x951A;&#x6807;&#x7B7E;&#x90E8;&#x5206;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x9875;&#x7801;&#x503C;&#x3002;&#x6784;&#x9020;&#x51FA;&#x6B63;&#x786E;&#x7684;URL&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4F5C;&#x4E3A;<code>$.getScript</code>&#x7684;&#x53C2;&#x6570;&#x6765;&#x53D1;&#x8D77;AJAX&#x8BF7;&#x6C42;&#x4E86;&#x3002;</p>

<p>&#x5982;&#x679C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x9875;&#x9762;&#x5E76;&#x4E14;&#x70B9;&#x51FB;&#x8FD9;&#x4E9B;&#x94FE;&#x63A5;&#xFF0C;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#x4F9D;&#x7136;&#x53EF;&#x7528;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x518D;&#x70B9;&#x51FB;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#xFF0C;<code>fragmentChange</code>&#x4E8B;&#x4EF6;&#x5C06;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;AJAX&#x8BF7;&#x6C42;&#x4F1A;&#x66F4;&#x65B0;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#xFF0C;&#x4ECE;&#x800C;&#x663E;&#x793A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x4EA7;&#x54C1;&#x9875;&#x3002;</p>

<h3>&#x4E66;&#x7B7E;&#x6536;&#x5F55;&#x548C;&#x9875;&#x9762;&#x5237;&#x65B0;</h3>

<p>&#x5927;&#x529F;&#x5373;&#x5C06;&#x544A;&#x6210;&#xFF0C;&#x4E0D;&#x8FC7;&#x9875;&#x9762;&#x4E0A;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x4E0D;&#x5982;&#x4EBA;&#x610F;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x6D4F;&#x89C8;&#x67D0;&#x4E00;&#x4EA7;&#x54C1;&#x9875;&#x65F6;&#x5237;&#x65B0;&#x4E86;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x7B2C;&#x4E00;&#x9875;&#x4EA7;&#x54C1;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6536;&#x5F55;&#x4E86;&#x67D0;&#x4E00;&#x9875;&#x5230;&#x4E66;&#x7B7E;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6253;&#x5F00;&#x5B83;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>

<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5F53;&#x9875;&#x9762;&#x7684;URL&#x4E2D;&#x5B58;&#x5728;&#x951A;&#x6807;&#x7B7E;&#x65F6;&#xFF0C;&#x5728;&#x9875;&#x9762;&#x5237;&#x65B0;&#x65F6;&#x80FD;&#x591F;&#x89E6;&#x53D1;<code>fragmentChange</code>&#x4E8B;&#x4EF6;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;pagination&#x4E2D;&#x5728;&#x52A0;&#x5165;&#x51E0;&#x884C;JavaScript&#x4EE3;&#x7801;&#x3002;</p>

<pre class="javascript">
if ($.fragment().page) {   
  $(document).trigger(&quot;fragmentChange.page&quot;);   
}
</pre>

<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x9875;&#x9762;&#x5237;&#x65B0;&#x7684;&#x65F6;&#x5019;&#x770B;URL&#x4E2D;&#x662F;&#x5426;&#x6709;&#x4E00;&#x4E2A;&#x951A;&#x6807;&#x7B7E;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5C31;&#x89E6;&#x53D1;<code>fragmentChange</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x6B63;&#x786E;&#x7684;&#x4EA7;&#x54C1;&#x9875;&#x4E86;&#x3002;</p>

<p>&#x6700;&#x7EC8;&#x5B8C;&#x6574;&#x7684;pagination&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>

<pre class="javascript">
$(function () {   
    $(&#x27;.pagination a&#x27;).live(&quot;click&quot;, function () {   
        $.setFragment({ page: $.queryString(this.href).page });   
        $(&#x27;.pagination&#x27;).html(&#x27;Page is loading...&#x27;);   
        return false;   
    });   
       
    $.fragmentChange(true);   
    $(document).bind(&quot;fragmentChange.page&quot;, function () {   
        $.getScript($.queryString(document.location.href, { &#x27;page&#x27;: $.fragment().page }));   
    });   
       
    if ($.fragment().page) {   
        $(document).trigger(&quot;fragmentChange.page&quot;);   
    }   
}); 
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;AJAX&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5BF9;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#x7FFB;&#x9875;&#xFF0C;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x524D;&#x8FDB;&#x548C;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x5C06;&#x5176;&#x4E2D;&#x67D0;&#x4E00;&#x9875;&#x6536;&#x5F55;&#x5230;&#x4E66;&#x7B7E;&#x91CC;&#x3002;</p>

<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;jQuery&#x5F00;&#x53D1;&#x4E86;&#x5206;&#x9875;&#x529F;&#x80FD;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7528;&#x6237;&#x662F;&#x4F7F;&#x7528;Prototype&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;ProtoType&#xFF0C;<a href="http://prototypextensions.com/history#main=quickstart">Prototypextensions</a>&#x7A0B;&#x5E8F;&#x5E93;&#x4E2D;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x652F;&#x6301;AJAX&#x6D4F;&#x89C8;&#x8BB0;&#x5F55;&#x7684;&#x529F;&#x80FD;&#x3002;</p>