
<p>Las im&aacute;genes de avatar juegan cada vez un papel m&aacute;s importante en la web, sobre todo en las aplicaciones sociales.  Si queremos a&ntilde;adir im&aacute;genes de avatar a una aplicaci&oacute;n escrita por nosotros deber&iacute;amos considerar el uso de <a href='http://en.gravatar.com'>Gravatar</a>, que proporciona una forma muy c&oacute;moda de hacerlo.  Lo &uacute;nico que tenemos que gestionar es una direcci&oacute;n de correo para cada usuario, y no hace falta que nos preocupemos de la subida de archivos, el recorte de im&aacute;genes o que los usuarios suban im&aacute;genes inapropiadas, porque esto lo gestionar&aacute; Gravatar.  Tan s&oacute;lo le tenemos que dar una direcci&oacute;n de correo y nos devolver&aacute; el avatar de dicho usuario.</p>

<p>En este episodio integraremos Gravatar con una aplicaci&oacute;n Rails sencilla que tiene un modelo <code>User</code>.  Ahora mismo dicho modelo dispone de tres instancias o usuarios (cada uno de ellos con una direcci&oacute;n de correo electr&oacute;nico diferente) y la acci&oacute;n <code>index</code> muestra una columna <code>avatar</code> que aparece marcada como pendiente.  Con Gravatar a&ntilde;adiremos una imagen de avatar para cada usuario.</p>

<div class="imageWrapper">
  <img src="/system/photos/531/original/E244I01.png" width="800" height="347" alt="La p치gina de los usuarios de la aplicaci칩n."/>
</div>

<p>Est&aacute;n disponibles varias extensiones que permiten a&ntilde;adir Gravatar a Rails pero es algo tan f&aacute;cil de hacer que no vamos a usar ninguna de ellas.  Empezaremos modificando el c&oacute;digo de la vista que muestra la tabla anterior, que tiene el siguiente aspecto:</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;TODO&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>Cambiaremos el texto TODO de la primera celda de la table por una etiqueta <code>image_tag</code>.  La URL de la imagen vendr&aacute; dada por un m&eacute;todo de ayuda que escribiremos m&aacute;s adelante llamado <code>avatar_url</code>, y que recibe como argumento un usuario.</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= image_tag avatar_url(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>Escribamos a continuaci&oacute;n el m&eacute;todo <code>avatar_url</code> en la clase <code>ApplicationHelper</code>.  Lo &uacute;nico complicado aqu&iacute; es generar el identificador que Gravatar espera recibir de nosotros.  Se trata de un <em>hash</em> MD5 en min&uacute;sculas generado a partir de la direcci&oacute;n de correo del usuario:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png&quot;
  end
end</pre>

<p>Si ahora se recarga la p&aacute;gina veremos las im&aacute;genes de avatar de las dos cuentas de usuarios que tienen asociada una imagen de Gravatar.  Para el usuario que no lo tiene se muestra la imagen por defecto de Gravatar.</p>


<div class="imageWrapper">
  <img src="/system/photos/532/original/E244I02.png" width="800" height="539" alt="Ya aparecen las im치genes de Gravatar."/>
</div>

<h3>Personalizaci&oacute;n de las im&aacute;genes de Gravatar</h3>

<p>Hay varios par&aacute;metros que podemos pasar en la solicitud de URL a Gravatar para modificar su comportamiento, y los detalles se pueden encontrar en la  <a href="http://en.gravatar.com/site/implement/images">web de Gravatar</a>. Por ejemplo si se a&ntilde;ade el par&aacute;metro <code>s</code> se puede modificar el tama&ntilde;o de la imagen de avatar:</p>

<pre class="ruby">http://gravatar.com/avatar/9a295994737a47683a4da4ed47aef7dd.png?s=200</pre>

<p>La opci&oacute;n <code>d</code> se puede utilizar para pasar una imagen por defecto alternativa si no se encuentra un avatar para el usuario:</p>


<pre class="ruby">http://gravatar.com/avatar/84ce1adb94b67014236a909fa4c1269d.png?d=http%3A%2F%2Fasciicasts.com%2Fimages%2Frails.png</pre>

<p>Tambi&eacute;n se puede pasar la opci&oacute;n <code>r</code> para modificar la clasificaci&oacute;n de la imagen o, si nuestro sitio utiliza HTTPS, podemos recuperar las im&aacute;genes de forma segura utilizando <code>https://segure.gravatar.com</code> como dominio de la URL.  Vamos a usar un par de estas opciones para modificar el tama&ntilde;o de las im&aacute;genes de avatar a 48 p&iacute;xeles, que es el mismo tama&ntilde;o que utiliza Twitter, y para pasar una imagen por defecto distinta:</p>

<p class="codeFilePath">/application/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    default_url = &quot;#{root_url}images/guest.png&quot;
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
  end
end</pre>

<p>Si se recarga la p&aacute;gina las im&aacute;genes aparecer&aacute;n m&aacute;s peque&ntilde;as y ahora se mostrar&aacute; nuestra imagen por defecto para la cuenta que no tiene imagen de Gravatar.</p>

<div class="imageWrapper">
  <img src="/system/photos/533/original/E244I03.png" width="800" height="442" alt="Ahora se muestra nuestro avatar por defecto."/>
</div>

<h3>Uso de im&aacute;genes de otros sitios con OmniAuth</h3>

<p>Esta soluci&oacute;n de im&aacute;genes de avatar funciona especialmente bien con OmniAuth.  Los que no est&eacute;n familiarizados con OmniAuth encontr&aacute;n informaci&oacute;n en el episodio 241 [<a href="http://railscasts.com/episodes/241-simple-omniauth">verlo</a>, <a href="http://asciicasts.com/episodes/241-simple-omniauth">leerlo</a>] donde se explicaba como empezar a usarlo con una aplicaci&oacute;n Rails.  El motivo por el que OmniAuth funciona muy bien con Gravatar es que si un usuario inicia la sesi&oacute;n en nuestro sitio utilizando Facebook o Twitter ya tendr&aacute; una imagen de avatar de estos servicios, imagen que se puede recuperar utilizando la propiedad <code>image</code> del <em>hash</em> <code>user_info</code> devuelto por OmniAuth.  Si el usuario no ha iniciado sesi&oacute;n por uno de estos servicios se puede utilizar Gravatar como &uacute;ltimo recurso de forma que todos los usuarios tengan alg&uacute;n avatar.</p>

<p>No a&ntilde;adiremos OmniAuth a esta aplicaci&oacute;n pero como apa&ntilde;o hemos a&ntilde;adido un campo <code>avatar_url</code> al modelo <code>User</code> para simular este dato de OmniAuth.  Primero modificaremos uno de los usuarios para ponerle una imagen de avatar de Twitter.</p>

<div class="imageWrapper">
  <img src="/system/photos/534/original/E244I04.png" width="801" height="351" alt="Asignaci칩n de avatar_url de un usuario."/>
</div>

<p>A continuaci&oacute;n tenemos que cambiar el m&eacute;todo <code>avatar_url</code> de <code>ApplicationHelper</code> para que utilice el avatar almacenado de un usuario si est&aacute; presente.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    if user.avatar_url.present?
      user.avatar_url
    else
      default_url = &quot;#{root_url}images/guest.png&quot;
      gravatar_id = Digest::MD5::hexdigest(user.email).downcase
      &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
    end
  end
end</pre>

<p>Al cargar la p&aacute;gina veremos que ahora la cuenta que tiene su propio avatar en Twitter  mostrar&aacute; esta imagen mientras que las otras se obtendr&aacute;n de Gravatar.</p>


<div class="imageWrapper">
  <img src="/system/photos/535/original/E244I05.png" width="802" height="468" alt="Ahora se muestra el avatar de Twitter."/>
</div>

<p>Y con esto concluye este episodio, breve pero esperamos que haya servido para que empecemos a usar avatares en nuestras aplicaciones Rails.</p>

