<p>Atualmente avatars s&atilde;o muito importantes, especialmente em aplica&ccedil;&otilde;es sociais. Se voc&ecirc; quer adicionar imagens de avatar para alguma aplica&ccedil;&atilde;o, voc&ecirc; deve dar uma olhada no <a href="http://en.gravatar.com">Gravatar</a>, que fornece uma maneira interessante de fazer isso. Tudo que voc&ecirc; precisa &eacute; de um endere&ccedil;o de email para cada usu&aacute;rio, e assim n&atilde;o h&aacute; necessidade da sua aplica&ccedil;&atilde;o tratar arquivos anexos, crop de imagens, ou se preocupar se os usu&aacute;rios est&atilde;o fazendo upload de imagens inapropriadas, pois isso &eacute; feito pelo Gravatar. Apenas forne&ccedil;a um endere&ccedil;o de email para o avatar do usu&aacute;rio ser&aacute; fornecido.</p>

<p>Vamos adicionar o Gravatar em uma simples aplica&ccedil;&atilde;o Rails com um modelo <code>User</code>. Ela tem atualmente tr&ecirc;s usu&aacute;rios, cada um com um diferente endere&ccedil;o de email e a p&aacute;gina  <code>index</code> mostra uma coluna <code>avatar</code> com &quot;TODO&quot;.</p>

<div class="imageWrapper">
  <img src="/system/photos/531/original/E244I01.png" width="800" height="347" alt="The users page of our application."/>
</div>

<p>Existem muitos plugins dispon&iacute;veis para adicionar o Gravatar ao Rails, mas &eacute; t&atilde;o f&aacute;cil fazer isso do zero que n&oacute;s n&atilde;o queremos usar um plugin. Vamos come&ccedil;ar modificando a view que renderiza a tabela mostrada acima. A view est&aacute; assim:</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;TODO&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>Vamos substituir o texto TODO, na primeira c&eacute;lula da tabela, com uma <code>image_tag</code>. A url da imagem ser&aacute; gerada por um m&eacute;todo helper, que vamos escrever, chamado <code>avatar_url</code>. Ele recebe um usu&aacute;rio como par&acirc;metro.</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= image_tag avatar_url(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>Agora vamos escrever o m&eacute;todo <code>avatar_url</code> no <code>ApplicationHelper</code>. O &uacute;nico truque &eacute; a gera&ccedil;&atilde;o do id que o Gravatar espera. O id &eacute; um hash MD5 em min&uacute;sculas do endere&ccedil;o de email do usu&aacute;rio, o que &eacute; bastante simples.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png&quot;
  end
end</pre>

<p>Quando recarregarmos a p&aacute;gina agora, vamos ver as imagens dos avatars para as duas contas que tem imagens do Gravatar associadas a elas. Para a que n&atilde;o tem, vamos ver uma imagem padr&atilde;o do Gravatar.</p>

<div class="imageWrapper">
  <img src="/system/photos/532/original/E244I02.png" width="800" height="539" alt="Images from Gravatar are now shown."/>
</div>

<h3>Customizando imagens do Gravatar</h3>

<p>Existem alguns par&acirc;metros que podem ser passados na url do Gravatar para customizar seu comportamento e mais detalhes podem ser encontrados no <a href="http://en.gravatar.com/site/implement/images">site do Gravatar</a>. Passando, por exemplo, o par&acirc;metro <code>s</code>, vamos mudar o tamanho do avatar, assim:</p>

<pre class="ruby">http://gravatar.com/avatar/9a295994737a47683a4da4ed47aef7dd.png?s=200</pre>

<p>A op&ccedil;&atilde;o <code>d</code> pode ser usada para fornecer uma imagem alternativa, se n&atilde;o for encontrado um avatar para o usu&aacute;rio.</p>

<pre class="ruby">http://gravatar.com/avatar/84ce1adb94b67014236a909fa4c1269d.png?d=http%3A%2F%2Fasciicasts.com%2Fimages%2Frails.png</pre>

<p>Podemos passar a op&ccedil;&atilde;o <code>r</code> para mudar a classifica&ccedil;&atilde;o e se o seu site usa HTTPS, ent&atilde;o podemos obter imagens com seguran&ccedil;a usando o endere&ccedil;o <code>https://secure.gravatar.com/</code>. Vamos usar algumas dessas op&ccedil;&otilde;es para redimensionar os avatars para 48 pixels, assim como o Twitter usa, e para fornecer uma imagem alternativa diferente.</p>

<p class="codeFilePath">/application/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    default_url = &quot;#{root_url}images/guest.png&quot;
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
  end
end</pre>

<p>Quando recarregarmos a p&aacute;gina agora, as imagens estar&atilde;o menores e nossa imagem padr&atilde;o customizada ser&aacute; mostrada para a conta que n&atilde;o tem uma imagem no Gravatar.</p>

<div class="imageWrapper">
  <img src="/system/photos/533/original/E244I03.png" width="800" height="442" alt="Our custom default avatar is now shown."/>
</div>

<h3>Usando imagens de outros sites com OmniAuth</h3>

<p>Essa solu&ccedil;&atilde;o de avatar funciona especialmente quando est&aacute; junto com o OmniAuth. Se voc&ecirc; n&atilde;o est&aacute; familiarizado com o OmniAuth, o epis&oacute;dio 241 [<a href="http://railscasts.com/episodes/241-simple-omniauth">assistir</a>, <a href="http://asciicasts.com/episodes/241-simple-omniauth">ler</a>] aborda como us&aacute;-lo em uma aplica&ccedil;&atilde;o Rails. O motivo do OmniAuth funcionar bem aqui &eacute; que se um usu&aacute;rio entrar no seu site atrav&eacute;s do Facebook ou Twitter, ent&atilde;o ele j&aacute; ter&aacute; um avatar desses servi&ccedil;os e ela pode ser obtida da propriedade <code>image</code> do hash <code>user_info</code> que o OmniAuth retorna. Se um usu&aacute;rio n&atilde;o entrou atrav&eacute;s de um desses servi&ccedil;os, ent&atilde;o podemos usar o Gravatar como uma alternativa, para que cada usu&aacute;rio sempre tenha um avatar.</p>

<p>N&atilde;o vamos adicionar o OmniAuth nessa aplica&ccedil;&atilde;o, mas vamos adicionar um campo <code>avatar_url</code> ao nosso modelo <code>User</code> para simular essa parte dos dados do OmniAuth. Primeiro vamos modificar um dos usu&aacute;rios para adicionar o avatar do Twitter.</p>

<div class="imageWrapper">
  <img src="/system/photos/534/original/E244I04.png" width="801" height="351" alt="Adding an avatar_url to a user."/>
</div>

<p>Depois vamos modificar nosso <code>avatar_url</code> no <code>ApplicationHelper</code> para que ele use o avatar j&aacute; armazenado, se ele existir.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    if user.avatar_url.present?
      user.avatar_url
    else
      default_url = &quot;#{root_url}images/guest.png&quot;
      gravatar_id = Digest::MD5::hexdigest(user.email).downcase
      &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
    end
  end
end</pre>

<p>Quando recarregamos a p&aacute;gina, o usu&aacute;rio que tiver um avatar armazenado, ser&aacute; mostrado. Para os outros, ainda pegaremos do Gravatar.</p>

<div class="imageWrapper">
  <img src="/system/photos/535/original/E244I05.png" width="802" height="468" alt="The avatar from Twitter is now shown."/>
</div>

<p>&Eacute; isso. Foi r&aacute;pido mas espero que tenha abordado tudo para voc&ecirc; usar avatar nas suas aplica&ccedil;&otilde;es Rails.</p>
