<p>
  &#x410;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43A;&#x438; &#x438;&#x433;&#x440;&#x430;&#x44E;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x443;&#x44E; &#x440;&#x43E;&#x43B;&#x44C; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x441;&#x430;&#x439;&#x442;&#x43E;&#x432;, &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445;.
  &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43E;&#x432; &#x432; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x432;&#x430;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;
  <a href="http://ru.gravatar.com">Gravatar</a>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x44D;&#x442;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;.
  &#x412;&#x441;&#x435; &#x447;&#x442;&#x43E; &#x432;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; - &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x442;&#x44C; email &#x430;&#x434;&#x440;&#x435;&#x441; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;. &#x418; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43E;&#x43A; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43E;&#x43A;, &#x43F;&#x43E;&#x434;&#x433;&#x43E;&#x43D;&#x43A;&#x438;, 
  &#x43E;&#x431;&#x440;&#x435;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x430; &#x438; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x435;&#x435;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; email &#x430;&#x434;&#x440;&#x435;&#x441; &#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x43C; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;.
</p>

<p>
  &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x44D;&#x43F;&#x438;&#x437;&#x43E;&#x434;&#x435; &#x43C;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; Gravatar &#x432; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x435; Rails &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x438; &#x441;&#x432;&#x44F;&#x436;&#x435;&#x43C; &#x441; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C;&#x44E; <code>User</code>.
  &#x423; &#x43D;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; 3 &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;, &#x443; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x439; email. &#x421;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; <code>index</code> &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43A;&#x43E;&#x43B;&#x43E;&#x43D;&#x43A;&#x443; <code>avatar</code>
  &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x435; &quot;TODO&quot; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; Gravatar &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;.
</p>

<div class="imageWrapper">
  <img src="/system/photos/531/original/E244I01.png" width="800" height="347" alt="The users page of our application."/>
</div>

<p>
  &#x415;&#x441;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; Gravatar, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x43D;&#x430; &#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x445; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;.
  &#x41D;&#x430;&#x447;&#x43D;&#x435;&#x43C; &#x441; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x43C; &#x43A;&#x43E;&#x434; view, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x443;, &#x43D;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x439;:
</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;TODO&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>
  &#x41C;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; TODO &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x435; &#x43D;&#x430; <code>image_tag</code>. 
  URL &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43E;&#x43A; &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x448;&#x44C;&#x44E; &#x445;&#x435;&#x43B;&#x43F;&#x435;&#x440;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43C;&#x44B; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x435;&#x43C; <code>avatar_url</code> &#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x434;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; user.
</p>

<p class="codeFilePath">/app/views/users/index.html.erb</p>
<pre class="ruby">&lt;% for user in @users %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= image_tag avatar_url(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= user.email %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Show&quot;, user %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Edit&quot;, edit_user_path(user) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &quot;Destroy&quot;, user, :confirm =&gt; &#x27;Are you &crarr;
      sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;</pre>

<p>
  &#x414;&#x430;&#x43B;&#x435;&#x435; &#x43C;&#x44B; &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x438;&#x43C; &#x445;&#x435;&#x43B;&#x43F;&#x435;&#x440; <code>avatar_url</code> &#x432; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x435; <code>ApplicationHelper</code>.
  &#x421;&#x430;&#x43C;&#x430;&#x44F; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x432; &#x43D;&#x435;&#x43C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; id, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43D;&#x443;&#x436;&#x435;&#x43D; gravatar.
  &#x42D;&#x442;&#x43E; MD5 &#x445;&#x44D;&#x448; &#x432; &#x43D;&#x438;&#x436;&#x43D;&#x435;&#x43C; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x435; &#x43E;&#x442; email &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;.
</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png&quot;
  end
end</pre>

<p>
  &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;, &#x43C;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x435;&#x43C; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x434;&#x432;&#x443;&#x445; &#x430;&#x43A;&#x43A;&#x430;&#x443;&#x43D;&#x442;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x442;&#x434;&#x430;&#x43B; Gravatar.
  &#x414;&#x43B;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E;, &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440; &#x43F;&#x43E;-&#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;.
</p>

<div class="imageWrapper">
  <img src="/system/photos/532/original/E244I02.png" width="800" height="539" alt="Images from Gravatar are now shown."/>
</div>

<h3>&#x41D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43E;&#x43A; Gravatar</h3>

<p>
  &#x415;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x435; URL, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x43E;&#x442;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; Gravatar&#x27;&#x43E;&#x43C; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;.
  &#x414;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x430; <a href="http://ru.gravatar.com/site/implement/images">&#x441;&#x430;&#x439;&#x442;&#x435; Gravatar</a>.
  &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x434;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x430;:
</p>

<pre class="ruby">http://gravatar.com/avatar/9a295994737a47683a4da4ed47aef7dd.png?s=200</pre>

<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; <code>d</code> &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x44B; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x430; &#x43F;&#x43E;-&#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;, &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x435; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;:</p>

<pre class="ruby">http://gravatar.com/avatar/84ce1adb94b67014236a909fa4c1269d.png?d=http%3A%2F%2Fasciicasts.com%2Fimages%2Frails.png</pre>

<p>
  &#x41C;&#x44B; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x438;&#x44E; <code>r</code>, &#x434;&#x43B;&#x44F; &#x441;&#x43C;&#x435;&#x43D;&#x44B; &#x440;&#x435;&#x439;&#x442;&#x438;&#x43D;&#x433;&#x430; &#x438; &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x430;&#x448; &#x441;&#x430;&#x439;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; HTTPS,
  &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; <code>https://secure.gravatar.com/</code>
  &#x432; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; URL. &#x41C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x443; &#x438;&#x437; &#x44D;&#x442;&#x438;&#x445; &#x43E;&#x43F;&#x446;&#x438;&#x439;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43A;&#x438; &#x434;&#x43E; 48 &#x43F;&#x438;&#x43A;&#x441;&#x435;&#x43B;&#x435;&#x439;.
  &#x42D;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43E;&#x43A; &#x432; Twitter.
</p>

<p class="codeFilePath">/application/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    default_url = &quot;#{root_url}images/guest.png&quot;
    gravatar_id = Digest::MD5::hexdigest(user.email).downcase
    &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
  end
end</pre>

<p>
  &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;, &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x441;&#x44F; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440; &#x43F;&#x43E;-&#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x442;&#x435;&#x439;,
  &#x443; &#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x442; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43A;&#x438; Gravatar.
</p>

<div class="imageWrapper">
  <img src="/system/photos/533/original/E244I03.png" width="800" height="442" alt="Our custom default avatar is now shown."/>
</div>

<h3>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x441;&#x430;&#x439;&#x442;&#x43E;&#x432; &#x441; OmniAuth</h3>

<p>
  &#x42D;&#x442;&#x43E; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43B;&#x44F; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43E;&#x43A; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43F;&#x430;&#x440;&#x435; &#x441; OmniAuth.
  &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x438; &#x44D;&#x43F;&#x438;&#x437;&#x43E;&#x434; &#x43E; OmniAuth [<a href="http://railscasts.com/episodes/241-simple-omniauth">&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C;</a>,
  <a href="http://asciicasts.com/episodes/241-simple-omniauth">&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C;</a>], &#x432; &#x43D;&#x435;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; 
  OmniAuth &#x432; &#x441;&#x432;&#x43E;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x430; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x432;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; Facebook &#x438;&#x43B;&#x438; Twitter,
  &#x442;&#x43E; &#x443; &#x43D;&#x438;&#x445; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43E;&#x432; &#x43E;&#x442; &#x44D;&#x442;&#x438;&#x445; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x43E;&#x432;, &#x43D;&#x43E; &#x43C;&#x44B; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C;, &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x432; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; <code>image</code> &#x432; &#x445;&#x44D;&#x448;&#x435; <code>user_info</code>,
  &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; OmniAuth.
  &#x415;&#x441;&#x43B;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x437;&#x430;&#x448;&#x435;&#x43B; &#x43D;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &#x44D;&#x442;&#x438; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x44B;, &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Gravatar, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443; &#x432;&#x441;&#x435;&#x445; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x431;&#x44B;&#x43B; &#x441;&#x432;&#x43E;&#x439; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;.
</p> 

<p>
  &#x41C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; OmniAuth &#x434;&#x43B;&#x44F; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43B;&#x438; <code>avatar_url</code>
  &#x432; &#x441;&#x432;&#x43E;&#x44E; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; <code>User</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; OmniAuth.
  &#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x43C; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x437; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x435;&#x43C;&#x443; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440; &#x43E;&#x442; Twitter.
</p>

<div class="imageWrapper">
  <img src="/system/photos/534/original/E244I04.png" width="801" height="351" alt="Adding an avatar_url to a user."/>
</div>

<p>
  &#x41F;&#x43E;&#x442;&#x43E;&#x43C; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x448; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>avatar_url</code> &#x432; <code>ApplicationHelper</code>,
  &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x44B;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x44B;.
</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">module ApplicationHelper
  def avatar_url(user)
    if user.avatar_url.present?
      user.avatar_url
    else
      default_url = &quot;#{root_url}images/guest.png&quot;
      gravatar_id = Digest::MD5::hexdigest(user.email).downcase
      &quot;http://gravatar.com/avatar/#{gravatar_id}.png?s=48&amp;d=#{CGI.escape(default_url)}&quot;
    end
  end
end</pre>

<p>
  &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;, &#x43F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x437;&#x44F;&#x442;&#x430; &#x43F;&#x43E; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43C;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x438;, &#x430; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x432;&#x44B;&#x434;&#x430;&#x441;&#x442; Gravatar.
</p>

<div class="imageWrapper">
  <img src="/system/photos/535/original/E244I05.png" width="802" height="468" alt="The avatar from Twitter is now shown."/>
</div>

<p>
  &#x412;&#x43E;&#x442; &#x438; &#x432;&#x441;&#x435; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x44D;&#x43F;&#x438;&#x437;&#x43E;&#x434;&#x430;. &#x41E;&#x43D; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x441;&#x44F; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x43C;, &#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C; &#x442;&#x435;&#x43C;, &#x43A;&#x442;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x430;&#x432;&#x430;&#x442;&#x430;&#x440;&#x43A;&#x438; &#x443; &#x441;&#x435;&#x431;&#x44F; Rails &#x432; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438;.
</p>