<style type="text/css">.inlineThumbnail { border: solid 1px #333; float: left; margin: 0 8px 8px 0; }</style>

<p><a href="http://www.jruby.org/">JRuby</a> es una implementaci&oacute;n estable de Ruby sobre la M&aacute;quina Virtual de Java.  JRuby es de mucho inter&eacute;s incluso aunque no seamos programadores de Java y en este episodio vamos a ver c&oacute;mo empezar con JRuby y centrarnos en algunas &aacute;reas en las que difiere de la implementaci&oacute;n est&aacute;ndar MRI.</p>

<h3>Instalaci&oacute;n de JRuby</h3>

<p>Una forma de instalar JRuby es descarg&aacute;ndolo del sitio web pero tambi&eacute;n lo podemos hacer con gestor de entornos de Ruby como RVM o rbenv.  Vamos a usar rbenv para instalar la &uacute;ltima versi&oacute;n, que en el momento de escribir este art&iacute;culo es la 1.7.0.preview2.</p>


``` terminal
$ rbenv install jruby-1.7.0-preview2
```


<p>N&oacute;tese que si estamos usando OS X Mountain Lion es posible que nos solicite instalar una m&aacute;quina virtual de Java.  Y dependiendo tambi&eacute;n de nuestra configuraci&oacute;n puede ser que tengamos que poner una <code>j</code> delante de las &oacute;rdenes normales de Ruby para indicar que queremos usar la versi&oacute;n de JRuby, lo que quiere decir que tendr&iacute;amos que ejecutar <code>jruby</code> y <code>jirb</code> en lugar de <code>ruby</code> o <code>irb</code>.</p>


``` terminal
$ rbenv shell jruby-1.7.0-preview2
$ ruby -v
jruby 1.7.0.preview2 (1.9.3p203) 2012-08-07 4a6bb0a on Java HotSpot(TM) 64-Bit Server VM 1.6.0_35-b10-428-11M3811 [darwin-x86_64]
```


<p>Comenzaremos nuestro repaso de JRuby experimentando en la consola.  Podemos ejecutar las &oacute;rdenes de Ruby igual que si estuvi&eacute;semos ejecutando Ruby MRI 1.9.3, y probablemente no encontremos ninguna diferencia, pero un cambio grande es que ahora tenemos acceso al mundo de Java y todas sus librer&iacute;as.  La clave para ello es con la l&iacute;nea  <code>require &quot;java&quot;</code>, que otorga acceso a varias clases de Java como el HashMap.  Crearemos un nuevo HashMap, a&ntilde;adi&eacute;ndole un valor para luego recuperarlo.</p>


``` console
>> require "java"
=> true
>> h = java.util.HashMap.new
=> {}
>> h.put(:foo, "bar")
=> nil
>> h.get(:foo)
=> "bar"
```


<p>JRuby incluye algunos m&eacute;todos de conveniencia para las clases importantes de Java.  Por ejemplo con nuestro <code>HashMap</code> podemos acceder a los valores de forma similar a como lo har&iacute;amos en Ruby.  Podemos incluso iterar sobre las claves con <code>.each</code> y mucho m&aacute;s, aunque estemos usando una clase de Java.</p>


``` console
>> h[:foo]
=> "bar"
```


<p>Otro uso m&aacute;s interesante de JRuby el poder crear interfaces de usuario con Swing.</p>


``` console
>> javax.swing.JOptionPane.showMessageDialog(nil, "Hello World!")
=> nil￼
```


<p><img src="http://asciicasts.com/system/photos/1336/original/E376I01.png" width="262" height="167" alt="A Swing alert box." class="inlineThumbnail"/> Este c&oacute;digo muestra una caja de di&aacute;logo, y podr&iacute;amos crear interfaces completas de usuario de esta manera, lo que no ser&iacute;a muy &uacute;til para las aplicaciones Rails pero s&iacute; que nos puede venir bien para crear <em>scripts</em> administrativos.  JRuby proporciona una forma alternativa para hacer esto m&aacute;s al estilo de Ruby, de esta manera:</p>


``` console
>> Java::JavaxSwing::JOptionPane.show_message_dialog(nil, "Hello")
=> nil
```


<p>Esto muestra una caja de di&aacute;logo similar a la que vimos anteriormente.  A continuaci&oacute;n veremos un ejemplo m&aacute;s completo de lo que se puede hacer con Swing.</p>


``` swing.rb
require "java"

java_import javax.swing.JFrame
java_import javax.swing.JButton
java_import javax.swing.JOptionPane

class HelloWorld < JFrame
  def initialize
    super "Example"
    
    setSize(150, 100)
    setDefaultCloseOperation(JFrame::EXIT_ON_CLOSE)
    setLocationRelativeTo(nil)
    
    button = JButton.new("Say Hello")
    add(button)
    
    button.addActionListener do |e|
      JOptionPane.showMessageDialog(nil, "Hello World")
    end
    
    setVisible(true)
  end
end

HelloWorld.new
```


<p>Al principio de todo hacemos <code>require &quot;java&quot;</code> igual que hicimos en irb para tener acceso a Swing y luego usamos <code>java_import</code> para importar algunas clases directamente a este <em>script</em>.  Luego creamos una clase Ruby que hereda de la clase <code>JFrame</code> de Java, que crear&aacute; una ventana.  En nuestra clase establecemos el tama&ntilde;o y otras propiedades, tras lo cual creamos un bot&oacute;n y se lo a&ntilde;adimos a la ventana junto con una funci&oacute;n para atender un evento que se activa cuando se hace clic en el bot&oacute;n que hemos creado.  En Java usar&iacute;amos una funci&oacute;n an&oacute;nima para definirla, pero en JRuby usaremos un bloque.  Tras esto hacemos que la ventana sea visible y, por &uacute;ltimo, creamos una nueva instancia de nuestra clase.  Ejecutaremos este archivo con la orden <code>ruby</code> y veremos que aparece una ventana peque&ntilde;a con el bot&oacute;n que acabamos de crear.  Al hacer clic aparece el siguiente mensaje de di&aacute;logo.</p>

<div class="imageWrapper" style="margin: 0 auto;">
  <img src="http://asciicasts.com/system/photos/1337/original/E376I02.png" width="350" height="350" alt="Nuestra aplicación Swing trivial."/>
</div>

<h3>La concurrencia mejorada de JRuby</h3>

<p>Tender puentes entre Ruby y Java es &uacute;til pero como desarrolladores Rails puede ser que no nos lo parezca.  Lo que es m&aacute;s interesante en JRuby es que el soporte de <em>threads</em> mejora la ejecuci&oacute;n concurrente de nuestro c&oacute;digo.  Podemos demostrar esto creando un nuevo <em>script</em> de Ruby que calcula n&uacute;meros de Fibonacci.</p>


``` fib.rb
def fib(n)
  n < 2 ? n : fib(n-1) + fib(n-2)
end

start = Time.now

1.upto(5).map do |n|
  Thread.new { puts "Thread #{n}: #{fib(32)}" }
end.each(&:join)

puts "Time: #{Time.now - start}"
```


<p>Se trata de invocar cinco veces un m&eacute;todo sencillo que calcula n&uacute;meros de Fibonacci, pero en <em>threads</em> separados.  Cuando el programa termina imprimimos el tiempo que ha tardado en ejecutarse.  En JRuby tarda menos de un segundo en completar su ejecuci&oacute;n, pero en la implementaci&oacute;n MRI de Ruby tarda m&aacute;s de tres.  El m&oacute;tivo principal de esta lentitud es el Bloqueo Global de Int&eacute;rprete.  Matt Aimonetti  <a href="http://merbist.com/2011/10/03/about-concurrency-and-the-gil/">escribi&oacute; un art&iacute;culo</a> en 2011 donde explicaba este tema en detalle pero la conclusi&oacute;n es que este bloqueo impide que la secuencia de Fibonacci se ejecute concurrentemente en hilos separados, por lo que si tenemos una m&aacute;quina con varios n&uacute;cleos la diferencia de tiempo ser&aacute; a&uacute;n m&aacute;s notable.  Si no procesamos permanentemente c&oacute;digo Ruby sino que estamos esperando la respuesta de una base de datos o la lectura de un archivo este bloqueo global no surte efecto, lo que podemos simular con una llamada a <code>sleep</code> en nuestro c&oacute;digo de Fibonacci.</p>


``` fib.rb
def fib(n)
  n < 2 ? n : fib(n-1) + fib(n-2)
end

start = Time.now

1.upto(5).map do |n|
  Thread.new { puts "Thread #{n}: #{sleep(0.5)}" }
end.each(&:join)

puts "Time: #{Time.now - start}"
```


<p>Si ejecutamos este c&oacute;digo bajo MRI Ruby s&oacute;lo tarda medio segundo en completarse porque el bloqueo no tiene efecto mientras el <em>thread</em> est&aacute; inactivo.</p>


<p>Si estamos desarrollando una aplicaci&oacute;n Rails multihilo y nos preguntamos cu&aacute;l podr&iacute;a ser la ganancia de rendimiento usando JRuby la respuesta es que depende de la relaci&oacute;n entre el  tiempo que nuestra aplicaci&oacute;n emplea en acceder a la base de datos y el tiempo que est&aacute; ejecutando c&oacute;digo Ruby, as&iacute; como del n&uacute;mero de n&uacute;cleos del que disponga la m&aacute;quina.  Por supuesto hay muchas m&aacute;s cosas que debemos considerar cuando comparamos el rendimiento entre un caso y otro pero en general si queremos ejecutar una aplicaci&oacute;n Rails multihilo en producci&oacute;n con MRI Ruby tendremos que establecer procesos separados ejecutando la aplicaci&oacute;n para aprovechar al m&aacute;ximo la concurrencia.  Sin embargo con JRuby es posible que podamos controlarlo todo en un &uacute;nico proceso.</p>

<h3>Una aplicaci&oacute;n JRuby on Rails</h3>

<p>Vamos a terminar este episodio mostrando c&oacute;mo hacer que una aplicaci&oacute;n Rails sea compatible con JRuby.  Primero vamos a conmutar a JRuby en la consola y luego instalaremos la gema Rails.  Tras instalar todas las gemas podremos crear una nueva aplicaci&oacute;n Rails que llamaremos <code>blog</code>.</p>


``` terminal
$ rbenv shell jruby-1.7.0-preview2 
$ gem install rails
$ rails new blog
```


<p>El generador de Rails es bastante sofisticado y har&aacute; que nuestra aplicaci&oacute;n sea compatible con JRuby al detectar que lo estamos usando.  Las diferencias clave se pueden encontrar en el <code>Gemfile</code>, la primera es que no usamos la gema <code>sqlite3</code> para acceder a SQLite sino algo distinto.</p>


``` /Gemfile
gem 'activerecord-jdbcsqlite3-adapter'
```


<p>JDBC es la interfaz est&aacute;ndar que usan las aplicaciones Java para comunicarse con la base de datos.  La gema lo utiliza para que ActiveRecord pueda hablar con la base de datos de nuestra aplicaci&oacute;n.  Es importante entender que algunas gemas no son compatibles con JRuby porque dependen de extensiones en C, y la gema <code>sqlite3</code> es una de ellas.  Esta gema no se puede instalar en JRuby, produci&eacute;ndose un fallo al instalar las extensiones nativa.  Se puede intentar soslayar este problema pero lo mejor es buscar una gema alternativa compatible con JRuby.  En el wiki de JRuby <a href="https://github.com/jruby/jruby/wiki/C-Extension-Alternatives">hay una p&aacute;gina</a> dedicada a las alternativas a las extensiones en C, lo que hace que sea un buen sitio para empezar la b&uacute;squeda.  Otro recurso &uacute;til es la  <a href="https://github.com/jruby/jruby-lint">gema JRuby-Lint</a>, que incluye la orden <code>jrlint</code> que podemos ejecutar sobre un proyecto para ver si tiene incompatibilidades con JRuby.  No lo comprueba todo, pero s&iacute; que busca extensiones en C y otros problemas potenciales.</p>

<p>De vuelta en el <code>Gemfile</code> de nuestra aplicaci&oacute;n vemos que aparece la gema <code>jruby-openssl</code> que emula la librer&iacute;a OpenSSL de Ruby.  La otra gema espec&iacute;fica de JRuby es <code>therubyrhino</code> que se usa para ejecutar JavaScript.  Esta son las gemas principales que tendremos que a&ntilde;adir si estamos convirtiendo una aplicaci&oacute;n Rails ya existente para que use JRuby, tras lo cual deber&iacute;amos poder seguir trabajando con nuestra aplicaci&oacute;n Rails, para demostrarlo vamos a generar el andamiaje necesario para un modelo sencillo llamado <code>Article</code>.</p>


``` terminal
$ rails g scaffold article name
$ rake db:migrate
$ rails s
```


<p>Esto genera las p&aacute;ginas habituales de andamiaje con las que podremos crear, modificar y listar art&iacute;culos igual que con cualquier otra aplicaci&oacute;n que utilice la implementaci&oacute;n MRI de Ruby.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1338/original/E376I03.png" width="800" height="309" alt="Una aplicación Rails ejecutándose con JRuby."/>
</div>

<p>La carga de la aplicaci&oacute;n completa Rails en JRuby puede tardar un poco.  En general JRuby tardar&aacute; mucho m&aacute;s en cargar el c&oacute;digo inicialmente pero es bastante r&aacute;pido ejecut&aacute;ndolo una vez porque ha logrado cargarlo por completo.  Si tenemos problema con esto podemos intentar hacer que la aplicaci&oacute;n sea compatible tanto con MRI como con JRuby de forma que podamos usar MRI en desarrollo (que es cuando estaremos continuamente reiniciando la aplicaci&oacute;n).   Esto puede conseguirse con la opci&oacute;n <code>platform</code> del <code>Gemfile</code> de forma que s&oacute;lo se carguen ciertas gemas dependiendo de la implementaci&oacute;n de Ruby.</p>


``` /Gemfile
source 'https://rubygems.org'

gem 'rails', '3.2.8'

platform :jruby do
 gem 'activerecord-jdbcsqlite3-adapter'
 gem 'jruby-openssl'
 gem 'therubyrhino'
end

plaform :ruby do
  gem 'sqlite3'
end

# Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem 'sass-rails',   '~> 3.2.3'
  gem 'coffee-rails', '~> 3.2.1'
  gem 'uglifier', '>= 1.0.3'
end

gem 'jquery-rails'
```


<p>Si pasamos a usar Ruby MRI 1.9.3 y ejecutamos <code>bundle</code> para que se instalen las gemas veremos que la aplicaci&oacute;n Rails tambi&eacute;n se ejecuta correctamente.  Por supuesto es importante tener una bater&iacute;a de tests completa para que podamos garantizar que la aplicaci&oacute;n funciona bajo JRuby y MRI.</p>
