<style type="text/css">.inlineThumbnail { border: solid 1px #333; float: left; margin: 0 8px 8px 0; }</style>

<p>Ryan Bates escribi&oacute; hace unos a&ntilde;os una aplicaci&oacute;n llamada  <a href="http://dailystamp.com">Daily Stamp</a>, en la que pod&iacute;amos introducir aquellas tareas que quer&iacute;amos hacer todos los d&iacute;as, tras lo cual se nos mostraba un calendario y un sello que pod&iacute;amos usar para marcar los d&iacute;as en los que hab&iacute;amos logrado cumplir dicha tarea.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1321/original/E374I01.png" width="824" height="539" alt="La aplicación The Daily Stamp."/>
</div>

<p>En este episodio nos centraremos en la posibilidad de personalizar el sello.  La aplicaci&oacute;n tiene una p&aacute;gina donde podemos escoger de entre una lista de sellos o usar uno propio.  La imagen que subamos ser&aacute; redimensionada y se le aplicar&aacute;n efectos para que parezca un sello de caucho.  Tambi&eacute;n podemos escoger varios colores para nuestro sello.  En este episodio vamos a ver c&oacute;mo a&ntilde;adir la capacidad para hacer este tipo de manipulaci&oacute;n de im&aacute;genes.  La herramienta clave es  <a href="http://www.imagemagick.org/script/index.php">ImageMagick</a>, con la que muchos tienen una relaci&oacute;n de amor-odio porque puede ser dif&iacute;cil de usar y configurar, si bien es una librer&iacute;a muy potente para realizar manipulaciones de im&aacute;genes una vez que la tenemos funcionando.  Un buen comienzo es inspeccionar sus <a href="http://www.imagemagick.org/script/command-line-tools.php">herramientas de la l&iacute;nea de &oacute;rdenes</a>, con las que nos podremos hacer una idea de las capacidades de ImageMagick y los pasos que hacen falta para procesar una imagen.</p>

<p>La instalaci&oacute;n de ImageMagick puede ser complicada y si estamos usando Mac OS X es buena idea usar Homebrew, con lo cual lo &uacute;nico que nos hace falta es ejecutar la orden <code>brew install imagemagick</code>, que nos deber&iacute;a instalar la orden <code>convert</code> junto con otras que tambi&eacute;n sirven para procesar im&aacute;genes.</p>

<p>Adem&aacute;s de la imagen con la que vamos a trabajar, que es un PNG del Octocat de GitHub, tenemos otra imagen que es una capa de textura consistente en una imagen blanca con cierta transparencia que le da el aspecto de un sello de caucho.  Nuestro primer objetivo es reescalar y recortar la imagen original para que encaje correctamente con nuestra textura.  En la  <a href="http://www.imagemagick.org/script/convert.php">documentaci&oacute;n de la orden <code>convert</code></a></code> podemos ver la lista de opciones que recibe, incluyendo las opciones para recortar o reescalar una imagen.  Ambas opciones aceptan un par&aacute;metro de geometr&iacute;a en cuya  <a href="http://www.imagemagick.org/script/command-line-processing.php#geometry"> documentaci&oacute;n</a> se nos indican las diferentes formas en las que los argumentos cambian su comportamiento.  Esto es muy c&oacute;modo si estamos intentando hacer una miniatura cuadrada a partir de una imagen con un tama&ntilde;o extra&ntilde;o, como es nuestro caso.  Primero usaremos la opci&oacute;n con un circunflejo que nos permite rellenar la imagen manteniendo la proporci&oacute;n.  Empezaremos con la terminal para reescalar la imagen a 70x70 p&iacute;xeles.  Tambi&eacute;n la recortaremos a estas dimensiones, guardando el fichero como <code>source.png</code>.</p>


``` terminal
$ convert octocat.png -resize '70x70^' -crop '70x70+0+0' source.png
```



<p><img src="http://asciicasts.com/system/photos/1322/original/E374I02.png" width="70" height="70" alt="Nuestro primer intento de generación de imagen en miniatura nos da una imagen descentrada." class="inlineThumbnail"/>  La imagen resultante tiene el siguiente aspecto.  Sus dimensiones son las correctas, pero est&aacute; descentrada.  Queremos recortar justo en el centro, lo que podemos hacer con la opcion <code>gravity</code> que se establece antes de recortar, indicando que queremos centrar la imagen antes del corte.</p>


```terminal
$ convert octocat.png -resize '70x70^' -gravity center -crop '70x70+0+0' source.png
```


<p><img src="http://asciicasts.com/system/photos/1323/original/E374I03.png" width="70" height="70" alt="La imagen está correctamente centrada." class="inlineThumbnail"/> Vemos que esto recorta la imagen correctamente, por lo que ya tenemos una orden que podemos usar para convertir cualquier imagen en una miniatura.  Queremos convertir dicha miniatura en una imagen en tono de grises y a&ntilde;adirle algo de contraste para que sirva como sello.  Esto podemos hacerlo a&ntilde;adiendo varias opciones como <code>quantize</code> para establecer la paleta de color a tonos de gris, <code>colors</code> para hacer la conversi&oacute;n y <code>contrast</code> para que la imagen destaque un poco m&aacute;s.  N&oacute;tese que la opci&oacute;n que se pasa a <code>quantize</code> va en may&uacute;sculas.</p>


``` terminal
$ convert octocat.png -resize '70x70^' -gravity center -crop '70x70+0+0' -quantize GRAY -colors 256 -contrast source.png
```


<p><img src="http://asciicasts.com/system/photos/1324/original/E374I04.png" width="70" height="70" alt="Ya tenemos la imagen en tono de grises." class="inlineThumbnail"/> Ya tenemos la imagen en tono de grises sobre la que podemos componer la transparencia para obtener la textura de un sello.  Podemos hacerlo con la orden <code>composite</code> que coloca una imagen encima de la otra.  Vamos a componer la transparencia sobre nuestra imagen original.</p>


``` terminal
$ composite stamp_overlay.png source.png source.png
```


<p><img src="http://asciicasts.com/system/photos/1329/original/E374I05.png" width="70" height="70" alt="La imagen con el sello aplicado." class="inlineThumbnail"/> La imagen aparece ya con la textura del sello sobreimpresa, lo siguente que queremos hacer es a&ntilde;adirle algo de color.  La orden <code>convert</code> puede usarse no s&oacute;lo para modificar im&aacute;genes ya existentes sino para crearlas desde cero.  Crearemos una imagen de 70x70 p&iacute;xeles de color rojo.  Lo haremos con la opci&oacute;n <code>canvas</code>, si bien algunas versiones de ImageMagick esperan la opci&oacute;n <code>cx</code>.</p>


``` terminal
$ convert -size 70x70 canvas:red colour.png
```


<p>Con esto generamos una imagen roja cuadrada que podemos componer con la imagen original.  En lugar de gestionar otro archivo, podemos gestionar la composici&oacute;n con la misma orden.  Cargaremos la imagen original y configuraremos c&oacute;mo se debe componer con la otra, usando la configuraci&oacute;n <code>copy-opacity</code>, indicando que debe componer la imagen original con el lienzo rojo.</p>


``` terminal
$ convert -size 70x70 canvas:red source.png -compose copy-opacity -composite stamp.png
```


<p><img src="http://asciicasts.com/system/photos/1325/original/E374I06.png" width="70" height="70" alt="Nos falta invertir la imagen compuesta." class="inlineThumbnail"/> La imagen generada se acerca mucho a lo que queremos pero por lo que parece tendremos que invertir la imagen original para obtener el resultado final que buscamos.  Podemos hacerlo pasando el nombre de la imagen entre par&eacute;ntesis y utilizando la opci&oacute;n <code>negate</code>, que invierte los colores de la imagen original.</p>


``` terminal
convert -size 70x70 canvas:red \( source.png -negate \) -compose copy-opacity -composite stamp.png
```


<p><img src="http://asciicasts.com/system/photos/1326/original/E374I07.png" width="70" height="70" alt="Ya tenemos la imagen que queremos." class="inlineThumbnail"/> La imagen tiene el aspecto exacto que queremos.  Es f&aacute;cil configurar nuestra orden para cambiar el color de los diferentes sellos.  Podemos combinarlo todo en una &uacute;nica orden para reescalar la imagen y convertirla en un sello de una &uacute;nica pasada.  Es una orden larga y compleja:</p>


``` terminal
convert -size 70x70 canvas:red \( octocat.png -resize '70x70^' -gravity center -crop '70x70+0+0' -quantize GRAY -colors 256 -contrast stamp_overlay.png -composite -negate \) -compose copy-opacity -composite stamp.png
```


<h3>C&oacute;mo hacer esto en una aplicaci&oacute;n Rails</h3>

<p>El siguiente paso es hacer que esto funcione en una aplicaci&oacute;n Rails.  Una opci&oacute;n es ejecutar esta orden desde Ruby, que no es mala idea.  Hay varias gemas que hacen precisamente esto, como por ejemplo  <a href="https://github.com/EricR/image_sorcery">Image Sorcery</a> y  <a href="https://github.com/probablycorey/mini_magick">MiniMagick</a>.  La interfaz de estas dos gemas puede resultar un poco complicada cuando tenemos que hacer manipulaciones complejas de las im&aacute;genes, por lo que a veces es mejor idea tener toda la orden en una cadena y ejecutarla cuando haga falta.  Tambi&eacute;n est&aacute; la cl&aacute;sica <a href="http://rmagick.rubyforge.org/">gema RMagick</a>.  No tiene actualizaciones recientes y muchos la critican por perder memoria, pero sigue siendo una opci&oacute;n v&aacute;lida si queremos una alternativa a la l&iacute;nea de &oacute;rdenes.  Se trata de un recubrimiento de la librer&iacute;a C, por lo que las opciones no son siempre las mismas que las de la l&iacute;nea de &oacute;rdenes.  En su favor apuntaremos que dispone de una completa  <a href="http://studio.imagemagick.org/RMagick/doc/">gu&iacute;a del usuario</a>. Veamos c&oacute;mo tendr&iacute;amos que usar RMagick para generar la misma imagen del sello.  Lo primero es instalar la gema.</p>


``` terminal
$ gem install rmagick
```


<p>Antes de pasar a la aplicaci&oacute;n Rails vamos a manipular la imagen usando un sencillo <em>script</em> en Ruby.</p>


``` stamp.rb
require "rmagick"

source = Magick::Image.read("octocat.png").first
source = source.resize_to_fill(70, 70).quantize(256, Magick::GRAYColorspace).contrast(true)
overlay = Magick::Image.read("stamp_overlay.png").first
source.composite!(overlay, 0, 0, Magick::OverCompositeOp)
colored = Magick::Image.new(70, 70) { self.background_color = "red" }
colored.composite!(source.negate, 0, 0, Magick::CopyOpacityCompositeOp)
colored.write("stamp.png")
```


<p>Primero requerimos <code>rmagick</code> y luego cargamos la imagen de origen.  La lectura de una imagen nos devuelve una lista de capas, por lo que escogemos la primera.  Podemos utilizar el m&eacute;todo <codE>resize_to_fill</codE> para recortar y reescalar la imagen, e invocar <code>quantize</code> sobre la miniatura para convertirla a escala de grises, para luego llamar <code>contrast</code> para incrementar el contraste.</p>

<p>A continuaci&oacute;n componemos la transparencia.  La cargamos igual que la imagen original e invocamos a <code>composite!</code> sobre la imagen original para realizar la composici&oacute;n, tras lo cual creamos una nueva imagen con un fondo rojo y la componemos sobre la imagen original invertida.  N&oacute;tese el argumento <code>Magick::CopyOpacityCompositeOp</code> que es el mismo que la opci&oacute;n <code>-compose copy-opacity</code>que us&aacute;bamos en la l&iacute;nea de &oacute;rdenes.  Por &uacute;ltimo, escribimos la imagen.</p>

<p><img src="http://asciicasts.com/system/photos/1327/original/E374I08.png" width="70" height="70" alt="La imagen de sello generada con RMagick." class="inlineThumbnail"/>
Ya podemos hacer la prueba.  Si ejecutamos nuestro <em>script</em> la imagen devuelta tiene el mismo aspecto que la que generamos en la l&iacute;nea de &oacute;rdenes, por lo que parece que todo funciona.  En comparaci&oacute;n, el otro enfoque del que habl&aacute;bamos tiene el siguiente aspecto:</p>


``` stamp.rb
# Or through the command line:
system <<-COMMAND
convert -size 70x70 canvas:red \\( octocat.png \
  -resize '70x70^' -gravity center -crop '70x70+0+0' \
  -quantize GRAY -colors 256 -contrast stamp_overlay.png \
  -composite -negate \
\\) -compose copy-opacity -composite stamp.png
COMMAND
```


<p>Si usamos este &uacute;ltimo m&eacute;todo tenemos que tener cuidado con los ataques de inyecci&oacute;n de &oacute;rdenes de <em>shell</em> si aceptamos par&aacute;metros que env&iacute;e el usuario.  RMagick parece m&aacute;s verboso pero tambi&eacute;n es m&aacute;s din&aacute;mico.</p>

<p>Ya hemos creado una sencilla aplicaci&oacute;n Rails para demostrar c&oacute;mo convertir una imagen reci&eacute;n subida.  Tenemos una p&aacute;gina con un di&aacute;logo de subida de archivo que convertir&aacute; cualquier imagen que queramos subir en un sello.  Hemos usado RMagick junto con CarrierWave para gestionar las subidas (ya vimos CarrierWave en el  <a href="http://railscasts.com/episodes/253-carrierwave-file-uploads">episodio 253</a>.)</p>


``` /Gemfile
gem 'rmagick'
gem 'carrierwave'
```


<p>Tenemos un modelo <code>Stamp</code> que monta un <em>uploader</em> de CarrierWave llamado <code>StampUploader</code>.</p>


``` /app/models/stamp.rb
class Stamp < ActiveRecord::Base
  attr_accessible :image
  mount_uploader :image, StampUploader
end
```


<p>La clase <code>StampUploader</code> es muy sencilla, aparte del c&oacute;digo del procesamiento de la imagen.</p>


``` /app/uploaders/stamp_uploader.rb
# encoding: utf-8

class StampUploader < CarrierWave::Uploader::Base
  include CarrierWave::RMagick

  include Sprockets::Helpers::RailsHelper
  include Sprockets::Helpers::IsolatedHelper

  storage :file

  def store_dir
    "uploads/#{model.class.to_s.underscore}/#{mounted_as}/#{model.id}"
  end

  def extension_white_list
    %w(jpg jpeg gif png)
  end

  %w[red green blue purple black].each do |color|
    version(color) { process stamp: color }
  end

  def stamp(color)
    manipulate! format: "png" do |source|
      overlay_path = Rails.root.join("app/assets/images/stamp_overlay.png")
      overlay = Magick::Image.read(overlay_path).first
      source = source.resize_to_fill(70, 70).quantize(256, Magick::GRAYColorspace).contrast(true)
      source.composite!(overlay, 0, 0, Magick::OverCompositeOp)
      colored = Magick::Image.new(70, 70) { self.background_color = color }
      colored.composite(source.negate, 0, 0, Magick::CopyOpacityCompositeOp)
    end
  end
end
```


<p>El procesamiento se hace en el m&eacute;todo <code>stamp</code>, que es todo lo que hace falta para gestionar las versiones en forma de sello.  Lo que hacemos es iterar sobre una lista de colores y hacer una versi&oacute;n para cada uno.  En el m&eacute;todo <code>stamp</code> invocamos a <code>manipulate!</code>, que es un m&eacute;todo de CarrierWave y le decimos que queremos usar RMagick para generar la imagen PNG.  El m&eacute;todo recibe un bloque al que se le pasa la imagen original.  El c&oacute;digo del bloque deber&iacute;a devolver la imagen modificada, y se trata b&aacute;sicamente del mismo c&oacute;digo que vimos antes, que en una aplicaci&oacute;n de producci&oacute;n deber&iacute;amos llevar a un proceso de segundo plano.  Dado que cada color es una versi&oacute;n diferente, podemos cambiar f&aacute;cilmente el color del sello que se muestra en la vista simplemente usando otra versi&oacute;n.</p>


``` /app/views/stamps/index.html.erb
<h1>Stamps</h1>

<% @stamps.each do |stamp| %>
  <div class="stamp">
    <%= image_tag stamp.image_url(:blue) %>
  </div>
<% end %>
<div class="clear"></div>

<p><%= link_to "New Stamp", new_stamp_path %></p>
```


<p>Ahora nuestros sellos salen en otro color.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1328/original/E374I09.png" width="800" height="360" alt="Podemos escoger de entre varios colores para el sello."/>
</div>
