<p>&#x4E0B;&#x9762;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x9875;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4EA7;&#x54C1;&#x9875;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7ED9;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x9875;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x8981;&#x4FEE;&#x6539;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x5728;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x540C;&#x65F6;&#x80FD;&#x591F;&#x4E0A;&#x4F20;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x96C6;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x7528;&#x4E00;&#x4E2A;&#x53EB;&ldquo;<a href="http://github.com/thoughtbot/paperclip/tree/master">Paperclip</a>&rdquo;&#x7684;&#x63D2;&#x4EF6;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/75/original/E134I01.png" width="811" height="353" alt="The product page for our application."/>
</div>

<p>Paperclip &#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4F7F;&#x6211;&#x4EEC;&#x7ED9;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF08;model&#xFF09;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9644;&#x4EF6;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7ED9;&#x4EA7;&#x54C1;&#x6A21;&#x578B;&#xFF08;<code>Product</code> model&#xFF09;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#xFF08;field&#xFF09;&#xFF0C;&#x7528;&#x6765;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x90FD;&#x80FD;&#x6709;&#x4E00;&#x5F20;&#x4EA7;&#x54C1;&#x56FE;&#x7247;&#x3002;</p>

<p>Paperclip &#x7684;&#x5B89;&#x88C5;&#x65B9;&#x6CD5;&#x548C;&#x5176;&#x4ED6;&#x63D2;&#x4EF6;&#x7684;&#x5B89;&#x88C5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;rails&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Github&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#xFF1A;</p>

<pre class="terminal">
script/plugin install git://github.com/thoughtbot/paperclip.git
</pre>

<h3>&#x4FEE;&#x6539;&#x6A21;&#x578B;</h3>

<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5B89;&#x88C5;Paperclip&#x63D2;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x63D2;&#x4EF6;&#x7684;&#x751F;&#x6210;&#x5668;&#x6765;&#x7ED9;&#x4EA7;&#x54C1;&#x6A21;&#x578B;&#xFF08;<code>Product</code> model&#xFF09;&#x6DFB;&#x52A0;&#x9644;&#x4EF6;&#x5B57;&#x6BB5;&#x3002;</p>
<pre class="terminal">
script/generate paperclip product photo
</pre>

<p>&#x8FD9;&#x4E2A;&#x751F;&#x6210;&#x5668;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x6A21;&#x578B;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5728;&#x4F8B;&#x5B50;&#x4E2D;&#x4F20;&#x5165;&#x7684;&#x662F;&ldquo;Product&rdquo;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x65B0;&#x6DFB;&#x52A0;&#x7684;&#x9644;&#x4EF6;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x5B57;&#xFF08;photo&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x751F;&#x6210;&#x5668;&#x6267;&#x884C;&#x540E;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#xFF08;migration&#xFF09;&#xFF1A;&#x7ED9;&#x6A21;&#x578B;&#x6DFB;&#x52A0;&#x4E86;4&#x4E2A;&#x65B0;&#x5B57;&#x6BB5;&#x3002;</p>

<pre class="ruby">
add_column :products, :photo_file_name, :string  
add_column :products, :photo_content_type, :string  
add_column :products, :photo_file_size, :integer  
add_column :products, :photo_updated_at, :datetime  
</pre>
<p class="title">Paperclip&#x63D2;&#x4EF6;&#x751F;&#x6210;&#x5668;&#x6DFB;&#x52A0;&#x7684;4&#x4E2A;&#x65B0;&#x5B57;&#x6BB5; &#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5C06;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#xFF1A;<code>rake db:migrate</code> &#x6765;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8868;products&#x3002;</p>

<p>&#x4E0B;&#x4E00;&#x6B65; &#x4FEE;&#x6539;&#x6A21;&#x578B;&#xFF08;model&#xFF09;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528; <code>has_attached_file</code> &#x6765;&#x544A;&#x8BC9;&#x6A21;&#x578B;&#x6211;&#x4EEC;&#x7528;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x7684;&#x9644;&#x4EF6;&#x5B57;&#x6BB5;&#xFF08;attachment field&#xFF09;&#x7684;&#x540D;&#x5B57;&#x3002;</p>

<pre class="ruby">
class Product &lt; ActiveRecord::Base  
  belongs_to :category  
  has_attached_file :photo  
end  
</pre>

<h3>&#x4FEE;&#x6539;&#x89C6;&#x56FE;</h3>

<p>&#x521B;&#x5EFA;&#x548C;&#x66F4;&#x65B0;&#x4EA7;&#x54C1;&#x7684;&#x8868;&#x5355;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#x7684;&#x5B57;&#x6BB5;&#x3002;</p>

<pre class="ruby">
&lt;% form_for @product, :html =&gt; { :multipart =&gt; true } do |form| %&gt;  
  &lt;ol class=&quot;formList&quot;&gt;  
    &lt;!-- Other fields go here... --&gt;  
    &lt;li&gt;  
      &lt;%= form.label :photo, &quot;Photo&quot; %&gt;  
      &lt;%= form.file_field :photo %&gt;  
    &lt;li&gt;  
      &lt;%= form.submit &quot;Submit&quot; %&gt;  
    &lt;/li&gt;  
  &lt;/ol&gt;  
&lt;% end %&gt;  
</pre>
<p>&#x4E3A;&#x8868;&#x5355;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A; <code>file_field</code>&#x5B57;&#x6BB5;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>form_for</code>&#x6765;&#x4F7F;&#x8868;&#x5355;&#x80FD;&#x591F;&#x63A5;&#x6536;&#x6587;&#x4EF6;&#x9644;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;:<code>multipart =&gt; true</code>&#x7ED9;<code>:html</code> hash&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x5BBF;&#x4F1A;&#x7ED9;&#x751F;&#x6210;&#x7684;form&#x6807;&#x7B7E;&#x6DFB;&#x52A0;<code>enctype=&quot;multipart/form-data&quot;</code>&#x5C5E;&#x6027;&#x3002;</p>

<p>&#x5F53;&#x7136;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x53BB;&#x663E;&#x793A;&#x56FE;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x663E;&#x793A;&#x4EA7;&#x54C1;&#x7684;&#x89C6;&#x56FE;&#xFF08;<code>show</code>&#xFF09;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7ED9;&#x9875;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;<code>image_tag</code>&#x6807;&#x7B7E;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x6A21;&#x578B;&#xFF08;<code>Product</code> model&#xFF09;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x80FD;&#x591F;&#x751F;&#x6210;&#x6B63;&#x786E;&#x56FE;&#x7247;&#x8DEF;&#x5F84;<code>url</code>&#x65B9;&#x6CD5;&#x7684;<code>photo</code>&#x5BF9;&#x8C61;&#x3002;&#x8C03;&#x7528;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x3002;</p>

<pre class="ruby">
&lt;%= image_tag @product.photo.url %&gt;  
</pre>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x4E3A;&#x4E4B;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x770B;&#x7ED3;&#x679C;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/76/original/E134I02.png" width="785" height="591" alt="The product's page now shows an image."/>
</div>

<p>&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#x751F;&#x6548;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x663E;&#x793A;&#x4E86;&#xFF0C;&#x4F46;&#x56FE;&#x7247;&#x6709;&#x70B9;&#x592A;&#x5927;&#x4E86;&#x3002; &#x5F53;&#x7136;&#x6211;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EC5;&#x4EC5;&#x4E0A;&#x4F20;&#x6B63;&#x786E;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#x6765;&#x4FDD;&#x8BC1;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4FEE;&#x6539;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x4FDD;&#x8BC1;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#x4E86;&#x3002;Paperclip&#x63D2;&#x4EF6;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x3002;</p>

<h3>&#x8BBE;&#x7F6E;&#x56FE;&#x7247;&#x5C3A;&#x5BF8;</h3>

<p>&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x5230;&#x4EA7;&#x54C1;&#x6A21;&#x578B;&#xFF08;Product model&#xFF09;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;<code>has_attached_file</code> &#x6709;&#x5F88;&#x591A;&#x53C2;&#x6570;&#xFF08;<a href="http://dev.thoughtbot.com/paperclip/classes/Paperclip/ClassMethods.html#M000008">options</a>&#xFF09;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x662F;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x7ED9;&#x56FE;&#x7247;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5BF8;&#x7684;<code>styles</code>&#x53C2;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5B9A;&#x4E49;style&#x53C2;&#x6570;&#x5E76;&#x6307;&#x5B9A;&#x5C3A;&#x5BF8;&#x5C31;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7F29;&#x7565;&#x56FE;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>

<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; }  
</pre>

<p>&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x7684;style&#x4E4B;&#x540E; Paperclip&#x5C06;&#x4F1A;&#x7ED9;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x751F;&#x6210;&#x4E00;&#x5F20;&#x9002;&#x5E94;150&times;150&#x8C61;&#x7D20;&#x5C3A;&#x5BF8;&#x7684;&#x7F29;&#x7565;&#x56FE;&#x3002; &#x5C3A;&#x5BF8;&#x53C2;&#x6570;&#x7ED3;&#x5C3E;&#x7684;&#x5927;&#x4E8E;&#x53F7;&#x544A;&#x8BC9;Paperclip&#x8981;&#x4FDD;&#x6301;&#x56FE;&#x7247;&#x7684;&#x7EB5;&#x6A2A;&#x6BD4;&#xFF0C;&#x907F;&#x514D;&#x56FE;&#x7247;&#x62C9;&#x4F38;&#x53D8;&#x5F62;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4F60;&#x5FC5;&#x987B;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B89;&#x88C5; <a href="http://www.imagemagick.org/script/index.php">ImageMagick</a> &#x6765;&#x4FDD;&#x8BC1;&#x751F;&#x6210;&#x7F29;&#x7565;&#x56FE;&#x529F;&#x80FD;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>

<p>&#x4E3A;&#x4E86;&#x8BA9;&#x5408;&#x9002;&#x7684;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#x80FD;&#x591F;&#x5728;&#x4EA7;&#x54C1;&#x89C6;&#x56FE;&#xFF08;<code>show</code>&#xFF09;&#x4E2D;&#x663E;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>image_tag</code>&#x4F7F;&#x56FE;&#x7247;&#x6807;&#x7B7E;&#x7684;url&#x6307;&#x5411;&#x5C0F;&#x7248;&#x672C;&#x56FE;&#x7247;&#x3002;</p>

<pre class="ruby">
&lt;%= image_tag @product.photo.url(:small) %&gt;  
</pre>
<p>&#x7ED9;url&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x521A;&#x521A;&#x8BBE;&#x7F6E;&#x7684;style :small&#x53C2;&#x6570;&#x6B63;&#x786E;&#x7684;&#x5C0F;&#x56FE;&#x7247;&#x5C06;&#x88AB;&#x8FD4;&#x56DE;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4E0A;&#x4F20;&#x7684;&#x65F6;&#x5019;&#x624D;&#x80FD;&#x751F;&#x6210;&#x56FE;&#x7247;&#xFF0C;&#x56E0;&#x6B64;&#x4E3A;&#x4E86;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x56FE;&#x7247;&#x5C3A;&#x5BF8;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x7F16;&#x8F91;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x91CD;&#x65B0;&#x4E0A;&#x4F20;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C; &#x6307;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x56FE;&#x7247;&#x624D;&#x663E;&#x793A;&#x5728;&#x4EA7;&#x54C1;&#x9875;&#x9762;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/77/original/E134I03.png" width="808" height="492" alt="The product page now shows the image at the correct size."/>
</div>

<h3>&#x8BBE;&#x7F6E; Paperclip &#x8DEF;&#x5F84;</h3>

<p>Paperclip&#x9ED8;&#x8BA4;&#x5C06;&#x9644;&#x4EF6;&#x4FDD;&#x5B58;&#x5728;rails&#x9879;&#x76EE;&#x7684;<code>public/system</code>&#x76EE;&#x5F55;&#x4E0B;&#x3002;</p>

<pre class="terminal">
&lt;img alt=&quot;Phone_large&quot; src=&quot;/system/photos/1/small/phone_large.jpg?1238845838&quot; /&gt;
</pre>
<p>Paperclip &#x4F1A;&#x6839;&#x636E;&#x4EA7;&#x54C1;&#x7684; id &#x548C;&#x6A21;&#x578B;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;style&#x6765;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4FDD;&#x5B58;&#x9644;&#x4EF6;&#x7684;&#x81EA;&#x6709;&#x76EE;&#x5F55;&#x5C42;&#x6B21;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x9ED8;&#x8BA4;&#x7684;&#x76EE;&#x5F55;&#x5C42;&#x6B21;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x5C06;&#x56FE;&#x7247;&#x5B58;&#x50A8;&#x5230;&#x5176;&#x4ED6;&#x76EE;&#x5F55;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x9ED8;&#x8BA4;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x3002;</p>

<p>&#x53EA;&#x8981;&#x7ED9;&#x65B9;&#x6CD5; has_attached_file &#x4F20;&#x9012;&#x4E24;&#x4E2A;&#x53C2;&#x6570;url&#x548C;path&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x5230;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x3002;</p>

<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; },  
  :url =&gt; &quot;/system/:attachment/:id/:style/:basename.:extension&quot;,  
  :path =&gt; &quot;:rails_root/public/system/:attachment/:id/:style/:basename.:extension&quot;  
</pre>
<p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x53C2;&#x6570;url&#x548C;path&#x662F;Paperclip&#x4F7F;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;url&#x6307;&#x5B9A;&#x4E86;&#x76F8;&#x5BF9;&#x4E8E;public&#x7684;&#x8DEF;&#x5F84;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x9644;&#x4EF6;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x5B57;&#xFF08;attachment&#xFF09;&#x3001;&#x6A21;&#x578B;&#x7684;id&#x548C;style&#x66FF;&#x6362;&#x5360;&#x4F4D;&#x7B26;&#xFF08;placeholders&#xFF09;&#x3002;path&#x53C2;&#x6570;&#x503C;&#x4E2D;&#x4E5F;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x66FF;&#x6362;&#x5360;&#x4F4D;&#x7B26;&#x3002;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5C06;&#x56FE;&#x7247;&#x5B58;&#x50A8;&#x5230;assets&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x6539;&#x53D8;url&#x548C;path&#x7684;&#x503C;&#x3002;</p>

<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; },  
  :url =&gt; &quot;/assets/products/:id/:style/:basename.:extension&quot;,  
  :path =&gt; &quot;:rails_root/public/assets/products/:id/:style/:basename.:extension&quot;  
</pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E0A;&#x4F20;&#x7684;&#x4EFB;&#x4F55;&#x56FE;&#x7247;&#x5C06;&#x4F1A;&#x4FDD;&#x5B58;&#x5230;assets&#x76EE;&#x5F55;&#x76EE;&#x5F55;&#x800C;&#x4E0D;&#x662F;system/photos&#x76EE;&#x5F55;&#x3002;</p>

<h3>&#x9A8C;&#x8BC1;&#x9644;&#x4EF6;</h3>

<p>Paperclip&#x63D2;&#x4EF6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x6211;&#x4EEC;&#x4E0A;&#x4F20;&#x7684;&#x9644;&#x4EF6;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x4EA7;&#x54C1;&#x6A21;&#x578B;&#xFF08;<code>Product</code> model&#xFF09;&#x6DFB;&#x52A0;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x7684;&#x6821;&#x9A8C;&#x5668;&#xFF1A;</p>

<pre class="ruby">
validates_attachment_presence :photo  
validates_attachment_size :photo, :less_than =&gt; 5.megabytes  
validates_attachment_content_type :photo, :content_type =&gt; [&#x27;image/jpeg&#x27;, &#x27;image/png&#x27;]  
</pre>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#x68C0;&#x67E5;&#x4E86;&#xFF1A;&#x9644;&#x4EF6;&#x662F;&#x5426;&#x4E0A;&#x4F20;&#x3001;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x5C0F;&#x4E8E;5m&#x3001;&#x662F;&#x5426;&#x4E3A;JPEG&#x6216;PNG&#x683C;&#x5F0F;&#x3002;&#x7528;&#x8FD9;&#x79CD;&#x529E;&#x6CD5;&#x9A8C;&#x8BC1;&#x9644;&#x4EF6;&#x53EF;&#x4EE5;&#x548C;&#x9A8C;&#x8BC1;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x4E00;&#x6837;&#x3002;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;&#x68C0;&#x67E5;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019; Internet Explorer &#x53EF;&#x80FD;&#x4E0E;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x62A5;&#x544A;&#x4E0D;&#x540C;&#x7684;MIME&#x7C7B;&#x578B;&#xFF1A;IE&#x4F1A;&#x8BA4;&#x4E3A;JPEG&#x6587;&#x4EF6;&#x662F;<code>image/pjpeg</code>&#x800C;&#x4E0D;&#x662F;<code>image/jpeg</code>&#x6587;&#x4EF6;&#x3002;</p>
