<p>Poni&#380;ej mamy zaprezentowan&#261; stron&#281; produktu w aplikacji typu e-commerce. Chcieliby&#347;my doda&#263; zdj&#281;cie do produktu i zmodyfikowa&#263; system zarz&#261;dzania tak, aby zdj&#281;cie by&#322;o wczytywane, kiedy produkt jest tworzony lub edytowany. W tym odcinku poka&#380;emy wam, jak u&#380;y&#263; wtyczki <a href="http://github.com/thoughtbot/paperclip/tree/master">Paperclip</a>, aby to osi&#261;gn&#261;&#263;.</p>
<div class="imageWrapper">
  <img src="/system/photos/75/original/E134I01.png" width="811" height="353" alt="Strona produktu w naszej aplikacji."/>
</div>
<p>Paperclip umozliwia &#322;atwe dodawanie za&#322;&#261;cznik&#243;w do modelu. U&#380;yjemy go, aby doda&#263; pole do naszego modelu <code>Product</code>, tak&#380;e ka&#380;dy produkt b&#281;dzie m&#243;g&#322; posiada&#263; zdj&#281;cie.</p>

<p>Paperclip jest instalowany w ten sam spos&#243;b co inne wtyczki. Znajduj&#261;c si&#281; w katalogu naszej aplikacji mo&#380;emy go zainstalowa&#263; z GitHub&rsquo;a.</p>
<pre class="terminal">
script/plugin install git://github.com/thoughtbot/paperclip.git
</pre>

<h3>Aktualizacja modelu</h3>
<p>Teraz, kiedy Paperclip jest zainstalowany, mo&#380;emy u&#380;y&#263; jego generatora, aby doda&#263; pole za&#322;&#261;cznika do modelu <code>Product</code>.</p>
<pre class="terminal">
script/generate paperclip product photo
</pre>
<p>Generator wymaga podania dw&#243;ch argument&#243;w. Pierwszy to nazwa modelu (w naszym przypadku to nasz model <code>Product</code>), natomiast drugi to nazwa nowego pola za&#322;&#261;cznika w modelu. Generator stworzy migracj&#281;, kt&#243;ra doda cztery nowe pola do modelu.</p>
<pre class="ruby">
add_column :products, :photo_file_name, :string
add_column :products, :photo_content_type, :string
add_column :products, :photo_file_size, :integer
add_column :products, :photo_updated_at, :datetime
</pre>
<p class="title">Cztery nowe pola dodane przez generator Paperclip.</p>
<p>Musimy wyda&#263; polecenie <code>rake db:migrate</code>, aby zaktualizowa&#263; tabel&#281; produkt&#243;w w bazie danych.</p>

<p>Nast&#281;pnym krokiem b&#281;dzie modyfikacja kodu modelu. U&#380;yjemy <code>has_attached_file</code>, &#380;eby poda&#263; modelowi nazw&#281; pola za&#322;&#261;cznika okre&#347;lon&#261; w migracji.</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  belongs_to :category
  has_attached_file :photo
end
</pre>
<h3>Zmiana widoku</h3>
<p>Do formularza, kt&#243;ry tworzy lub aktualizuje produkt musi zosta&#263; dodane pole wczytania pliku.</p>
<pre class="ruby">
&lt;% form_for @product, :html =&gt; { :multipart =&gt; true } do |form| %&gt;
  &lt;ol class=&quot;formList&quot;&gt;
    &lt;!-- Tutaj inne pola... --&gt;
    &lt;li&gt;
      &lt;%= form.label :photo, &quot;Photo&quot; %&gt;
      &lt;%= form.file_field :photo %&gt;
    &lt;li&gt;
      &lt;%= form.submit &quot;Submit&quot; %&gt;
    &lt;/li&gt;
  &lt;/ol&gt;
&lt;% end %&gt;
</pre>
<p>Opr&#243;cz dodania pola <code>file_field</code> do formularza musimy zmodyfikowa&#263; <code>form_for</code> tak, &#380;eby formularz m&#243;g&#322; akceptowa&#263; pliki. Jest to realizowane poprzez dodanie <code>:multipart =&gt; true</code> do listy <code>:html</code>, kt&#243;re doda atrybut <code>enctype=&quot;multipart/form-data&quot;</code> do taga otwieraj&#261;cego formularza.</p>

<p>Oczywi&#347;cie nie ma sensu wczytywa&#263; obrazk&#243;w bez wy&#347;wietlania ich, dlatego te&#380; musimy dokona&#263; zmiany w widoku <code>show</code>. &#380;eby doda&#263; obrazek, musimy jedynie doda&#263; <code>image_tag</code> do strony. Nasz model <code>Product</code> b&#281;dzie teraz posiada&#322; obiekt <code>photo</code> jako w&#322;a&#347;ciwo&#347;&#263; z metod&#261; <code>url</code>, kt&#243;ra przechowuje &#347;cie&#380;k&#281; do obrazka.</p>
<pre class="ruby">
&lt;%= image_tag @product.photo.url %&gt;
</pre>
<p>Nast&#281;pnie mo&#380;emy wyedytowa&#263; produkt, doda&#263; do niego obrazek i zobaczy&#263; rezultat.</p>
<div class="imageWrapper">
  <img src="/system/photos/76/original/E134I02.png" width="785" height="591" alt="Strona produktu pokazuje ju&#380; obrazek."/>
</div>
<p>To dzia&#322;a! Nasz produkt ma zdj&#281;cie, lecz jest ono troch&#281; za du&#380;e. &#380;eby mie&#263; pewno&#347;&#263;, &#380;e wczytywane obrazy b&#281;d&#261; mia&#322;y poprawny rozmiar, by&#322;oby o wiele &#322;atwiej zmienia&#263; ich rozmiar po stronie serwera, co jest mo&#380;liwe przy u&#380;yciu Paperclip.</p>

<h3>Zmiana rozmiaru obraz&#243;w</h3>
<p>Metoda <code>has_attached_file</code>, kt&#243;r&#261; dodali&#347;my do modelu Product, mo&#380;e przyjmowa&#263; wiele <a href="http://dev.thoughtbot.com/paperclip/classes/Paperclip/ClassMethods.html#M000008">opcji</a>. Jedn&#261; z nich jest <code>styles</code>, kt&#243;ra pozwala nam zdefiniowa&#263; r&#243;&#380;ne rozmiary naszego obrazu. &#380;eby stworzy&#263; miniaturk&#281; dla ka&#380;dego obrazu, musimy jedynie zdefiniowa&#263; styl i okre&#347;li&#263; wymiary.</p>
<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; }
</pre>
<p>Z nowododanym stylem Paperclip wygeneruje dla ka&#380;dego obrazu miniaturk&#281;, kt&#243;ra zmie&#347;ci si&#281; w obszarze o wymiarach 150x150. Znak wi&#281;kszo&#347;ci na ko&#324;cu nakazuje Paperclip&rsquo;owi zachowa&#263; proporcje obrazu, tak &#380;e nie b&#281;dzie on zniekszta&#322;cony podczas zmiany rozmiaru. Prosz&#281; mie&#263; na uwadze to, &#380;e &#380;eby pozwoli&#263; na przeskalowanie musisz mie&#263; zainstalowany <a href="http://www.imagemagick.org/script/index.php">ImageMagick</a> na serwerze.</p>

<p>Aby wy&#347;wietli&#263; przeskalowany obraz w widoku <code>show</code> produktu, musimy zmodyfikowa&#263; <code>image_tag</code> tak, &#380;eby wskazywa&#322; na pomniejszony obrazek.</p>
<pre class="ruby">
&lt;%= image_tag @product.photo.url(:small) %&gt;
</pre>
<p>Je&#380;eli przeka&#380;emy styl do metody url, to zostanie zwr&#243;cony w&#322;a&#347;ciwy obraz. Mniejszy obrazek jest generowany tylko podczas wczytywania obrazu, wi&#281;c musimy wyedytowa&#263; produkt i wys&#322;a&#263; plik jeszcze raz, &#380;eby zosta&#322; pomniejszony. Jak tylko to zrobimy, zdj&#281;cie naszego produktu uka&#380;e si&#281; w zmniejszonej wersji.</p>
<div class="imageWrapper">
  <img src="/system/photos/77/original/E134I03.png" width="808" height="492" alt="Strona produktu pokazuje ju&#380; obrazek w poprawnym rozmiarze"/>
</div>

<h3>Ustawianie &#347;cie&#380;ki Paperclip&rsquo;a</h3>
<p>Domy&#347;lnie Paperclip przetrzymuje za&#322;&#261;czniki w katalogu <code>system</code> wewn&#261;trz katalogu <code>public</code> naszej aplikacji.</p>
<pre class="terminal">
&lt;img alt=&quot;Phone_large&quot; src=&quot;/system/photos/1/small/phone_large.jpg?1238845838&quot; /&gt;
</pre>
<p>Paperclip tworzy w&#322;asn&#261; hierarchi&#281; do przechowywania plik&#243;w na podstawie <code>id</code> produktu oraz <code>stylu</code> okre&#347;lonego w modelu. W wi&#281;kszo&#347;ci przypadk&#243;w ten katalog powinien by&#263; odpowiedni, ale jesli chcemy przechowywa&#263; pliki gdzie indziej, to mo&#380;emy go zmieni&#263;.</p>
<p>Aby przechowywa&#263; obrazy w innym miejscu, dodajemy jedynie dwie dodatkowe opcje do metody <code>has_attached_file</code> &mdash; adres url i &#347;cie&#380;k&#281;.</p>
<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; },
  :url =&gt; &quot;/system/:attachment/:id/:style/:basename.:extension&quot;,
  :path =&gt; &quot;:rails_root/public/system/:attachment/:id/:style/:basename.:extension&quot;
</pre>
<p>Powy&#380;szy url i &#347;cie&#380;ka s&#261; domy&#347;lnymi dla Paperclip&rsquo;a. Adres url jest relatywny w stosunku do katalogu <code>public</code> i znajduj&#261; si&#281; wnim znaczniki nazwy za&#322;&#261;cznika, id modelu i stylu. Podobne znaczniki znajduj&#261; si&#281; w &#347;cie&#380;ce. Je&#347;li chcemy, &#380;eby nasze obrazki by&#322;y przechowywane w katalogu <code>assets</code>, musimy zmodyfikowa&#263; url i &#347;cie&#380;k&#281;.</p>
<pre class="ruby">
has_attached_file :photo, :styles =&gt; { :small =&gt; &quot;150x150&gt;&quot; },
  :url =&gt; &quot;/assets/products/:id/:style/:basename.:extension&quot;,
  :path =&gt; &quot;:rails_root/public/assets/products/:id/:style/:basename.:extension&quot;
</pre>
<p>Ka&#380;dy obraz, kt&#243;ry zostanie wczytany b&#281;dzie teraz przechowywany w katalogu assets, a nie system/photos.</p>

<h3>Walidacja za&#322;&#261;cznik&#243;w</h3>

<p>U&#380;yteczn&#261; funkcj&#261; Paperclip&rsquo;a jest te&#380; to, &#380;e mo&#380;e sprawdza&#263; poprawno&#347;&#263; za&#322;&#261;cznik&#243;w, kt&#243;re s&#261; wczytywane. &#380;eby m&#243;c walidowa&#263; pliki mogliby&#347;my doda&#263; poni&#380;sze walidatory do modelu <code>Product</code>:</p>
<pre class="ruby">
validates_attachment_presence :photo
validates_attachment_size :photo, :less_than =&gt; 5.megabytes
validates_attachment_content_type :photo, :content_type =&gt; [&#x27;image/jpeg&#x27;, &#x27;image/png&#x27;]
</pre>
<p>W ten spos&#243;b sprawdzimy, czy wczytany za&#322;&#261;cznik jest niewi&#281;kszy ni&#380; pi&#281;&#263; megabajt&#243;w oraz czy jest obrazem JPEG lub PNG. U&#380;ywaj&#261;c powy&#380;szych w prosty spos&#243;b sprawdzimy poprawno&#347;&#263; za&#322;&#261;cznika, jak ka&#380;dego innego pola formularza. Jedn&#261; rzecz&#261;, kt&#243;r&#261; warto zapami&#281;ta&#263; jest to, &#380;e Internet Explorer mo&#380;e zg&#322;asza&#263; typ MIME r&#243;&#380;ny od innych przegl&#261;darek. Na przyk&#322;ad pliki JPEG mo&#380;e traktowa&#263; jako <code>image/pjpeg</code>, a nie <code>image/jpeg</code>.</p>