<p>Letztes Wochenende fand das Rails 3.1 HackFest statt und dank der harten Arbeit aller Beteiligten ist nun der 5. Release Kandidat von Rails 3.1 verf&uuml;gbar. Diese Release enth&auml;lt wichtige Verbesserungen f&uuml;r Mountable Enginges. Mountable Engines erlauben es eine Railsanwendung als sogenannte Engine in einer anderen Railsanwendung einzubinden, was auch Thema dieser Folge sein soll.</p>

<p>Vielleicht erinnerst du dich an das Exception Notification Plugin aus <a href="http://railscasts.com/episodes/104-exception-notifications">Folge 104</a>. Wenn man dieses einer Anwendung hinzuf&uuml;gt, speichert es jeden Fehler der Anwendung in der Datenbank. Des weiteren erlaubt das Plugin die Anzeige der Fehler &uuml;ber eine Benutzerschnittstelle. In dieser Folge erstellen wir das Plugin neu - allerdings dieses mal als Mountable Engine.</p>

<h3>Vorbereitung</h3>

<p>Bevor wir unsere Engine implementieren, m&uuml;ssen wir sicherstellen, dass wir Rails in der Version 3.1 Release Kandidat 5 oder neuer verwenden. Die neueste Version k&ouml;nnen wir wie folgt installieren</p>

<pre class="terminal">$ gem install rails --pre</pre>

<p>Haben wir erst einmal die richtige Railsversion installiert, k&ouml;nnen wir damit beginnen, unsere Mountable Engine zu erzeugen. Es ist nicht notwendig, dass wir diese in einer bereits existierenden Railsanwendung erstellen. Das erstellen einer Engine ist mit der Initiierung einer Railsanwendung &uuml;ber das Kommando <code>rails new</code> vergleichbar. Der einzige Unterschied ist, dass wir stattdessen <code>rails plugin new</code> ausf&uuml;hren. Da unsere Anwendung Ausnahmen behandelt, nennen wir sie <code>uhoh</code>. Zus&auml;tzlich m&uuml;ssen wir die Option <code>--mountable</code> verwenden, um tats&auml;chlich eine einbindbare - Mountable - Engine zu erhalten.</p> 

<pre class="terminal">$ rails plugin new uhoh --mountable</pre>

<p>Die Verzeichnisstruktur unserer Engine &auml;hnelt stark der einer normalen Railsanwendung, was sie ja auch grunds&auml;tzlich ist. Diese ist eben nur so gestaltet, dass sie in eine andere Anwendung eingebunden werden kann, weshalb dann doch kleine Unterschiede erkennbar sind. Innerhalb der Anwendung befinden sich einige &uuml;ber einen Namensraum abgegrenzte Verzeichnisse. Beispielsweise liegt die Datei <code>application_controller</code> im Verzeichnis <code>/app/controllers/uhoh</code>. Das gleiche gilt f&uuml;r die Dateien in den Verzeichnissen <code>assets</code>, <code>helpers</code> und <code>views</code>. Dies hilft den Code der Engine sauber vom Code der Anwendung in die sie eingebunden wird zu trennen. Das <code>assets</code> Verzeichnis bewirkt, dass wir nun nicht mehr st&auml;ndig &ouml;ffentliche Dateien (Assets) in den <code>public</code> Ordner der Railsanwendung kopieren m&uuml;ssen, sobald die Engine in diese eingebunden wird. Darum k&uuml;mmert sich nun die Asset Pipeline.</p>

<div class="imageWrapper">
  <img src="/system/photos/712/original/E277I01.png" width="800" height="502" alt="Die Verzeichnisstruktur einer Engine."/>
</div>

<p>Da &ouml;ffentliche Dateien ebenfalls &uuml;ber einen Namensraum, dh. &uuml;ber einen bestimmten Ordner, abgegrenzt sind, muss dieser Ordner bei Verlinkungen mit angegeben werden. F&uuml;r das Layouts Verzeichnis gilt das gleiche, auch wenn hier anscheinend ein Bug in RC5 eine zweite <code>application.html.erb</code> Datei erzeugt. Die zweite Datei au&szlig;erhalb des <code>uhoh</code> Verzeichnisses kann einfach gel&ouml;scht werden. Wenn wir uns die andere Datei anschauen, sehen wir, dass alle Verlinkungen zu den &ouml;ffentlichen Dateien auf das <code>uhoh</code> Verzeichnis verweisen. Immer wenn wir Bilder oder andere Anlagen verlinken, d&uuml;rfen wir diesen Namensraum nicht vergessen.</p>


<p class="codeFilePath">/app/views/layouts/uhoh/application.html.erb</p>
<pre class="ruby">&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
  &lt;title&gt;Uhoh&lt;/title&gt;
  &lt;%= stylesheet_link_tag    &quot;uhoh/application&quot; %&gt;
  &lt;%= javascript_include_tag &quot;uhoh/application&quot; %&gt;
  &lt;%= csrf_meta_tags %&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;%= yield %&gt;

&lt;/body&gt;
&lt;/html&gt;</pre>

<p>Als n&auml;chstes schauen wir uns eine der Schl&uuml;sseldateien der Engine, <code>engine.rb</code> im Verzeichnis <code>/lib/uhoh</code>, an.</p>

<p class="codeFilePath">/lib/uhoh/engine.rb</p>
<pre class="ruby">module Uhoh
  class Engine &lt; Rails::Engine
    isolate_namespace Uhoh
  end
end</pre>

<p>Diese Klasse erbt von <code>Rails::Engine</code> und ist der zentrale Punkt f&uuml;r spezifische Konfigurationen. Innerhalb der Klasse wird bereits <code>isolate_namespace</code> aufgerufen. Das bedeuted, dass die Engine als eigene isolierte Einheit behandelt wird und sich nicht um die Anwendung k&uuml;mmern braucht, in die sie eingebunden wird.</p>

<p>Der letzte Teil der Engine auf den wir bei dieser kurzen &Uuml;bersicht einen Blick werfen wollen, befindet sich im <code>/test</code> Verzeichnis. Innerhalb des Verzeichnisses <code>/test/dummy</code> ist eine Railsanwendung, welche uns zeigt, wie unsere Engine funktioniert, wenn sie eingebunden wird. Der Ordner <code>config</code> enth&auml;lt eine <code>routes.rb</code> Datei. In dieser wiederum wird <code>mount</code> mit der Klasse der Engine und einem Pfad, an dem die Engine eingebunden werden soll, aufgerufen.</p>

<p class="codeFilePath">/test/dummy/config/routes.rb</p>
<pre class="ruby">Rails.application.routes.draw do
  mount Uhoh::Engine =&gt; &quot;/uhoh&quot;
end</pre>

<p>Wenn jemand deine Engine in seiner Anwendung installieren m&ouml;chte, muss er genau dies tun - sie an einem selbst gew&auml;hlten Pfad einbinden. Dies ist eine Rackanwendung und somit wird jeder eintreffende Request an /uhoh weitergereicht an unsere <code>Engine</code> Klasse. Es ist eine gute Idee diese Zeile in die Installationsanweisung innerhalb der README Datei der Engine einzuf&uuml;gen, damit Nutzer wissen, wie sie die Engine in die routes Datei ihrer Anwendung einbinden.</p>

<p>Auch wenn diese Dummyanwendung sich im Verzeichnis <code>/test</code> befindet, ist sie dennoch auch gut f&uuml;r manuelle Tests geeignet. F&uuml;hren wir das Kommando <code>rails s</code> aus dem Verzeichnis unserer Engine aus, startet die Dummyanwendung. Rufen wir die Seite <a href="http://localhost:3000/uhoh/"><code>http://localhost:3000/uhoh/</code></a> auf, gelangen wir zu unserer Engine, da wir sie dort eingebunden haben. Wenn wir die Seite aufrufen, sehen wir eine Fehlermeldung, da wir den entsprechenden Controller noch nicht erstellt haben.</p>

<p>Das werden wir jetzt nachholen und einen <code>failures</code> Controller in der Engine erstellen. Hierf&uuml;r k&ouml;nnen wir genauso wie in einer Railsanwendung Railsgeneratoren verwenden. Obwohl wir uns innerhalb einer Engine befinden, brauchen wir keinen Namensraum angeben. Um das alles k&uuml;mmert sich Rails selbst.</p>

<pre class="terminal">$ rails g controller failures index</pre>

<p>Hierdurch werden die gleichen Dateien erzeugt, wie wir sie auch bei einem normalen Controller erwarten, mit der Ausnahme, dass alles &uuml;ber den Namensraum in die richtigen Verzeichnisse verteilt wird. Als n&auml;chstes passen wir das Routing der Engine an, so dass die <code>root</code> Route auf die Index Action des eben erstellten Controllers verweist. Dies erledigen wir in der Datei <code>/config/routes.rb</code> der Engine.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">Uhoh::Engine.routes.draw do
  root :to =&gt; &quot;failures#index&quot;
end</pre>

<p>Wenn wir nun <a href="http://localhost:3000/uhoh/"><code>http://localhost:3000/uhoh/</code></a> aufrufen, sehen wir die zu der Action geh&ouml;rige View.</p>

<div class="imageWrapper">
  <img src="/system/photos/713/original/E277I02.png" width="801" height="280" alt="Der Vorgabetext der Index View."/>
</div>

<p>Auf dieser Seite wollen wir eine Liste der aufgetretenen Ausnahmen anzeigen. Wir ben&ouml;tigen ein Model in dem wir diese Informationen speichern k&ouml;nnen und erzeugen deshalb ein einfaches <code>Failure</code> Model mit einem Message Feld.</p>

<pre class="terminal">$ rails g model failure message:text</pre>

<p>Nachdem wir das Model erstellt haben, stellt sich die Frage, wie wir die Datenbankmigrationen ansto&szlig;en? Innerhalb der Engine k&ouml;nnen wir wie &uuml;blich <code>rake db:migrate</code> ausf&uuml;hren und alles funktioniert wie erwartet. Allerdings wird die Migration so nicht funktionieren, wenn jemand versucht die Engine in seine eigene Anwendung einzubinden, da <code>rake</code> keine Migrationen von eingebundenen Engines ausf&uuml;hrt. Wir m&uuml;ssen unseren Nutzern mitteilen, das sie stattdessen <code>rake uhoh:install:migrations</code> ausf&uuml;hren sollen. Dadurch werden die Migrationen der Engine in die Anwendung selbst kopiert, sodass anschlie&szlig;end <code>rake db:migrate</code> wie gew&uuml;nscht auch die Migrationen der Engine startet. Es ist eine gute Idee diese Information in die Installationsanleitung der Engine aufzunehmen.</p>

<p>Die Railsconsole funktioniert ebenfalls wie wir es erwarten in einer Engine und wir werden sie nun zur Erstellung eines Beispiel-<code>Failure</code>s verwenden.</p>

<pre class="ruby">Uhoh::Failure.create!(:message =&gt; &quot;hello world!&quot;)</pre>

<p>Denk daran, dass wir immer den Namensraum mit angeben m&uuml;ssen, wenn wir auf eine Klasse verweisen. Da wir jetzt einen Failure erstellt haben, wollen wir ihn nun auch in unserer <code>index</code> Action unseres <code>FailuresController</code>s anzeigen.</p>

<p class="codeFilePath">/app/controllers/uhoh/failures_controller.rb</p>
<pre class="ruby">module Uhoh
  class FailuresController &lt; ApplicationController
    def index
      @failures = Failure.all
    end
  end
end</pre>

<p>Im Gegensatz zur Console brauchen wir hier keinen Namensraum angeben, da wir ja bereits innerhalb des <code>Uhoh</code> Moduls sind. In der View schreiben wir etwas Code, um &uuml;ber eine Schleife alle Fehler in einer Liste anzeigen zu lassen.</p>

<p class="codeFilePath">/app/views/uhoh/failures/index.html.erb</p>
<pre class="ruby">&lt;h1&gt;Failures&lt;/h1&gt;
&lt;ul&gt;
  &lt;% for failure in @failures %&gt;
  &lt;li&gt;&lt;%= failure.message %&gt;&lt;/li&gt;
  &lt;% end %&gt;
&lt;/ul&gt;</pre>

<p>Wenn wir nun die Seite neu laden, sehen wir den eben hinzugef&uuml;gten <code>Failure</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/714/original/E277I03.png" width="801" height="280" alt="Die Anzeige unseres Fehlers in der Liste."/>
</div>

<h3>Ausnahmen abfangen</h3>

<p>Jetzt wo wir die M&ouml;glichkeit haben Fehler festzuhalten, m&uuml;ssen wir nur jede Ausnahme, welche die Anwendung wirft, in die die Engine eingebunden ist, in unserer eigenen Fehlerklasse speichern. Um das auch Testen zu k&ouml;nnen, brauchen wir eine M&ouml;glichkeit Ausnahmen in der Dummyanwendung zu simulieren. Wir wechseln also in das Verzeichnis der Dummyanwendung unserer Engine und erstellen einen Controller <code>simulate</code> mit einer <code>failure</code> Action.</p>

<pre class="terminal">$ rails g controller simulate failure</pre>

<p>Innerhalb der Action erzeugen wir eine Ausnahme.</p>

<p class="codeFilePath">/test/dummy/app/controllers/simulate_controller.rb</p>
<pre class="ruby">class SimulateController &lt; ApplicationController
  def failure
    raise &quot;Simulating an exception&quot;
  end
end</pre>

<p>Wenn wir jetzt die Action &uuml;ber den Browser aufrufen, sehen wir die erwartete Ausnahme.</p>

<div class="imageWrapper">
  <img src="/system/photos/715/original/E277I04.png" width="800" height="420" alt="Die Ausnahme im Browser."/>
</div>

<p>Als n&auml;chstes m&uuml;ssen wir unsere Engine so anpassen, dass sie auf solche Ausnahmen wartet und entsprechend einen neuen <code>Failure</code> Record in der Datenbank erstellt. Die verwendete L&ouml;sung wird zwar nicht besonders effizient sein, aber d&uuml;rfte f&uuml;r unseren Fall erst einmal ausreichen. Wir beginnen damit einen Initilizer in unserer Engine zu erstellen. Aktuell existiert zwar kein <code>initilizers</code> Verzeichnis im config Ordner unserer Engine, allerdings k&ouml;nnen wir problemlos eines erstellen und jeder Initilizer, den wir dort ablegen, sollte funktionieren. Wir legen also in diesem Verzeichnis eine Datei <code>exception_handler.rb</code> an.</p>

<p class="codeFilePath">/app/config/initilizers/exception_handler.rb</p>
<pre class="ruby">ActiveSupport::Notifications.subscribe &crarr;
  &quot;process_action.action_controller&quot; do &crarr;
  |name, start, finish, id, payload|
  if payload[:exception]
    name, message = *payload[:exception]
    Uhoh::Failure.create!(:message =&gt; message)
  end
end</pre>

<p>In dieser Datei registrieren wir uns bei allen Systemnachrichten (=Notifikations - diese werden detailliert in Folge 204 behandelt [<a href="http://railscasts.com/episodes/249-notifications-in-rails-3">watch</a>, <a href="http://asciicasts.com/episodes/249-notifications-in-rails-3">read</a>]), die bei der Ausf&uuml;hrung einer Action erzeugt werden. Wenn eine Action ausgef&uuml;hrt wird, k&ouml;nnen wir pr&uuml;fen, ob in dem &uuml;bergebenen Parameter <code>payload</code> eine Ausnahme aufgef&uuml;hrt ist. Ist dies der Fall, wissen wir, dass die Action eine Ausnahme erzeugt hat und speichern deren Meldung in einem neuen <code>Failure</code> Record.</p>

<p>Um das testen zu k&ouml;nnen, m&uuml;ssen wir den Server neu starten. Anschlie&szlig;end rufen wir wieder <a href="http://localhost:3000/simulate/failure"><code>http://localhost:3000/simulate/failure</code></a> auf, um die Ausnahme erneut zu simulieren. Ist das gegl&uuml;ckt, sehen wir sie auch in der &Uuml;bersicht auf <a href="http://localhost:3000/uhoh"><code>http://localhost:3000/uhoh</code></a>.</p>

<div class="imageWrapper">
  <img src="/system/photos/716/original/E277I05.png" width="800" height="420" alt="Unsere neue Ausnahme wird in der Liste angezeigt."/>
</div>

<h3>URLs in Engines</h3>

<p>Jeden URL Helfer, welchen wir innerhalb einer Engine verwenden, wird URLs f&uuml;r diese Engine erzeugen. Wenn wir beispielsweise einen Link zur root URL in unserer Failures <code>index</code> Seite erstellen, zeigt dieser Link zur root URL der Engine und nicht zur root URL der Anwendung in die sie eingebunden ist.</p>

<p class="codeFilePath">/app/views/uhoh/failures/index.html.erb</p>
<pre class="ruby">&lt;p&gt;&lt;%= link_to &quot;Failures&quot;, root_url %&gt;&lt;/p&gt;</pre>

<p>Dieser Link verweist auf <a href="http://localhost:3000/uhoh"><code>http://localhost:3000/uhoh</code></a>, also auf die root URL der Engine. Das ist die selbe Seite auf der sich der Link befindet, da in der routes Datei als root URL die <code>index</code> Action des <code>FailuresController</code>&rsquo;s eingetragen ist. Um auf die einbindende Anwendung selbst zu verlinken, rufen wir die &uuml;blichen URL Helfer auf <code>main_app</code> wie folgt auf:</p>

<p class="codeFilePath">/app/views/uhoh/failures/index.html.erb</p>
<pre class="ruby">&lt;p&gt;&lt;%= link_to &quot;Failures&quot;, root_url %&gt;&lt;/p&gt;
&lt;p&gt;&lt;%= link_to &quot;Simulate Failure&quot;, main_app.simulate_failure_path %&gt;&lt;/p&gt;</pre>
  
<p>Damit erhalten wir einen Link auf die Fehlersimulationsseite der Anwendung <a href="http://localhost:3000/simulate/failure"><code>http://localhost:3000/simulate/failure</code></a>.</p>

<p>Wie k&ouml;nnen wir nun in die andere Richtung, von der Anwendung zur Engine, verlinken? Als erstes m&uuml;ssen wir die Zeile der routes Datei der Anwendung anpassen, in welcher die Engine eingebunden wird und der vorher definierten Route &uuml;ber die <code>:as</code> Option einen Namen zuweisen.</p>

<p class="codeFilePath">/test/dummy/config/routes.rb</p>
<pre class="ruby">Rails.application.routes.draw do

  get &quot;simulate/failure&quot;

  mount Uhoh::Engine =&gt; &quot;/uhoh&quot;, :as =&gt; &quot;uhoh_engine&quot;
end</pre>

<p>Anschlie&szlig;end haben wir Zugriff auf die URL Helfer der Engine, indem wir sie als Methode von <code>uhoh_engine</code> aufrufen. Um das zu demonstrieren, werden wir kurz die Failure Action so &auml;ndern, dass sie, anstatt eine Ausnahme zu erzeugen, zur root URL der Engine weiterleitet.</p>

<p class="codeFilePath">/test/dummy/app/controllers/simulate_controller.rb</p>
<pre class="ruby">class SimulateController &lt; ApplicationController
  def failure
    redirect_to uhoh_engine.root_url
  end
end</pre>

<p>Wenn wir die Seite <a href="http://localhost:3000/simulate/failure"><code>http://localhost:3000/simulate/failure</code></a> aufrufen, werden wir weitergeleitet zu <a href="http://localhost:3000/uhoh"><code>http://localhost:3000/uhoh</code></a>, da wir die Engine Helfer zur Weiterleitung auf eine ihrer URLs verwenden. Dies ist ein weiteres Feature welches du in der README Datei deiner Engine vielleicht erw&auml;hnen solltest.</p>

<p>Die Funktionalit&auml;t unserer Engine ist jetzt soweit ziemlich vollst&auml;ndig, nur die Fehlerliste sieht noch ziemlich &ouml;de aus, so dass wir sie nun noch etwas versch&ouml;nern wollen. Als erstes f&uuml;gen wir ein Bild hinzu. Wir haben bereits eines gefunden und dieses in das Verzeichnis <code>/app/assets/images/uhoh</code> kopiert. Um es auf der Seite einzubinden, k&ouml;nnen wir wie bei jedem anderen Bild auch den Helfer <code>image_tag</code> verwenden.</p>

<p class="codeFilePath">/app/views/uhoh/failures/index.html.erb</p>
<pre class="ruby">&lt;%= image_tag &quot;uhoh/alert.png&quot; %&gt;
&lt;h1&gt;Failures&lt;/h1&gt;
&lt;ul&gt;
  &lt;% for failure in @failures %&gt;
  &lt;li&gt;&lt;%= failure.message %&gt;&lt;/li&gt;
  &lt;% end %&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;%= link_to &quot;Failures&quot;, root_url %&gt;&lt;/p&gt;
&lt;p&gt;&lt;%= link_to &quot;Simulate Failure&quot;, &crarr;
  main_app.simulate_failure_path %&gt;&lt;/p&gt;</pre>
  
<p>Zus&auml;tzlich f&uuml;gen wir noch etwas CSS hinzu. SASS und CoffeeScript sind zwar standardm&auml;&szlig;ig nicht in Engines verf&uuml;gbar, k&ouml;nnen aber als Abh&auml;ngigkeiten hinzugef&uuml;gt werden. Wenn wir nun etwas CSS zu der Datei <code>failure.css</code> hinzuf&uuml;gen, wird dieses automatisch eingebunden.</p>

<p class="codeFilePath">/app/assets/stylesheets/uhoh/failures.css</p>
<pre class="css">html, body {
  background-color: #DDD;
  font-family: Verdana;
}

body {
  padding: 20px 200px;
}

img {
  display: block;
  margin: 0 auto;
}

a {
  color: #000;
}

ul {
  list-style: none;
  margin: 0;
  padding: 0;
}

li {
  background-color: #FFF;
  margin-bottom: 10px;
  padding: 5px 10px;
}</pre>

<p>Das gleich gilt f&uuml;r JavaScript. Jede Erg&auml;nzung in der Datei <code>failure.js</code> wird automatisch ber&uuml;cksichtigt.</p>

<p class="codeFilePath">/app/assets/javascripts/uhoh/failures.js</p>
<pre class="javascript">$(function() {
  $(&quot;li&quot;).click(function() {
    $(this).slideUp();
  });
});</pre>

<p>Wenn wir die Seite nun neu laden, sieht sie deutlich besser aus und um zu testen, dass das JavaScript richtig eingebunden wurde, klicken wir auf die angezeigten Ausnahmen, welche dann ausgeblendet werden sollten.</p>

<div class="imageWrapper">
  <img src="/system/photos/717/original/E277I06.png" width="799" height="436" alt="Unsere Fehlerseite mit CSS und JavaScript."/>
</div>

<p>Das wars f&uuml;r diese Folge. Mountable Engines sind eine gro&szlig;artige Neuerung in Rails 3.1. und definitiv einen Blick wert.</p>
