<p>Ruby on Rails es un <em>framework</em> de desarrollo muy potente pero puede intimidar a aquellos que tratan de aprenderlo por primera vez.  En esta serie de episodios solemos tratar temas de nivel medio, y a veces puede resultar dif&iacute;cil encontrar un sitio concreto a donde los nuevos programadores de Rails puedan acudir a resolver sus dudas.  En este episodio lo resolveremos.</p>

<h3>Instalaci&oacute;n de Rails</h3>

<p>La mejor forma de instalar Ruby y Rails bajo Windows es utilizando el  <a href="http://railsinstaller.org/">RailsInstaller</a>, que es un &uacute;nico paquete ejecutable que instalar&aacute; todo lo necesario para montar un entorno de desarrollo en Rails, por lo que tras hacerlo se puede saltar el resto de esta secci&oacute;n.</p>

<p>Los que trabajen sobre OS X preferir&aacute;n instalar  <a href="http://mxcl.github.com/homebrew/">Homebrew</a> antes de instalar Rails porque hace que sea mucho m&aacute;s f&aacute;cil instalar todas las dependencias.  Se instala lanzando una &uacute;nica orden, que se puede encontrar en la  <a href="https://github.com/mxcl/homebrew/wiki/installation">p&aacute;gina de instalaci&oacute;n</a>.  Tras instalar Homebrew podemos usarlo para instalar varios paquetes &uacute;tiles, entre ellos <code>git</code> para control de versiones y <code>sqlite</code> para la base de datos.  Se trata de paquetes necesarios que podemos instalar ejecutando esta orden:</p>

``` terminal
$ brew install git sqlite
```

<p>Los que utilicen Linux pueden instalar Sqlite y Git con el gestor de paquetes de la distribuci&oacute;n.</p>

<p>Lo siguiente es instalar la &uacute;ltima versi&oacute;n de Ruby.  En OS X o Linux lo m&aacute;s f&aacute;cil es hacerlo con  <a href="https://rvm.beginrescueend.com/">RVM</a>, que tambi&eacute;n se instala con una &uacute;nica orden que podremos encontrar en la p&aacute;gina de RVM.  Tras la instalaci&oacute;n de RVM podremos escoger la versi&oacute;n de Ruby que queramos utilizando la orden <code>rvm</code>.  Por ejemplo para instalar la &uacute;ltima versi&oacute;n de Ruby, la 1.9.3, podemos lanzar</p>

``` terminal
$ rvm install 1.9.3
```
<p>Con esto se descargar&aacute; y compilar&aacute; Ruby 1.9.3, tras lo cual podremos usar esta versi&oacute;n por defecto ejecutando</p>

``` terminal
$ rvm use 1.9.3 --default
```
<p>La opci&oacute;n <code>--default</code> es la que har&aacute; que esta sea la versi&oacute;n de Ruby por defecto en nuestro sistema.</p>

<p>Para los que tengan m&aacute;s conocimientos de UNIX existe una alternativa a RVM llamada  <a href="https://github.com/sstephenson/rbenv">rbenv</a> que es un poco m&aacute;s costosa de configurar pero sigue un enfoque m&aacute;s ligero a la hora de instalar m&uacute;ltiples versiones de Ruby.</p>

<p>Ya podemos ejecutar la orden <code>ruby</code> para estar seguros de que tenemos la versi&oacute;n correcta en el sistema instalada por defecto.</p>

``` terminal
$ ruby -v
ruby 1.9.3p0 (2011-10-30 revision 33570) [x86_64-darwin11.2.0]
```

<p>Tars lo cual podemos pasar a instalar Rails ejecutando</p>

``` terminal
$ gem install rails
```

<p>Con esta orden se instalar&aacute; la &uacute;ltima versi&oacute;n de Rails (3.1.3 a d&iacute;a de hoy), si queremos instalar una versi&oacute;n espec&iacute;fica de Rails podemos utilizar la opci&oacute;n <code>--version</code>.</p>

``` terminal
$ gem install rails --version 2.1
```

<p>Es muy importante instalar la misma versi&oacute;n de Rails que la del tutorial que estemos siguiendo.  Si, por ejemplo, tenemos un libro escrito para Rails 2.3 deber&iacute;amos instalar dicha versi&oacute;n.  Si no estamos seguros de qu&eacute; versi&oacute;n de Rails sigue nuestro tutorial, en la p&aacute;gina de  <a href="http://en.wikipedia.org/wiki/Ruby_on_Rails">Ruby on Rails en la wikipedia</a> existe una tabla que muestra las fechas de publicaci&oacute;n de las versiones principales de Rails, as&iacute; que si sabemos la fecha de publicaci&oacute;n de nuestro tutorial podremos deducir la versi&oacute;n de Rails para la que estaba escrito.  Podemos comprobar qu&eacute; versi&oacute;n de Rails hemos instalada lanzando la siguiente orden:</p>

``` terminal
$ rails -v
Rails 3.1.3
```

<p>Conviene saber, si tenemos que instalar varias vesiones de Rails, que algunas son incompatibles entre s&iacute;.  Para solventar este problema podemos utilizar  <a href="https://rvm.beginrescueend.com/gemsets/basics/">gemsets de RVM</a> e instalar versiones separadas de Ruby cada una con su propia instalaci&oacute;n de Rails.</p>

<h3>Tutoriales</h3>

<p>Tras la instalaci&oacute;n de Rails es hora de seguir alg&uacute;n tutorial, y un buen sitio para empezar son las  <a href="http://guides.rubyonrails.org/">Gu&iacute;as de Ruby On Rails</a> que tienen una secci&oacute;n <a href="http://guides.rubyonrails.org/getting_started.html">introductoria</a> donde veremos c&oacute;mo crear una sencilla aplicaci&oacute;n de blog con lo que nos haremos la idea de qu&eacute; necesitamos para crear una aplicaci&oacute;n peque&ntilde;a.  Es perfectamente comprensible que nos veamos abrumados a la hora de seguir un tutorial como este, pero debemos tener en cuenta que  no es necesario entender hasta el m&aacute;s m&iacute;nimo detalle al principio.  Es muy importante aqu&iacute; la perseverancia.</p>

<p><a href="http://railsforzombies.org/">Rails For Zombies</a> es otro tutorial que merece la pena seguir.  Se trata de una forma divertida e interactiva de ver todas las partes de que se compone una aplicaci&oacute;n Rails.   Tambi&eacute;n es interesante ver  <a href="http://ruby.railstutorial.org/">The Ruby on Rails Tutorial</a>, que cubre casi todos los aspectos relacionados con Rails y temas como Git y Heroku.  No es necesario acometer todo este material de golpe, pero merece la pena echarle al menos un vistazo.</p>

<h3>Divide y vencer&aacute;s</h3>

<p>Si despu&eacute;s de probar un par de tutoriales nos encontramos con que seguimos algo perdidos lo mejor es seguir un enfoque de &quot;divide y vencer&aacute;s&quot;: Rails utiliza muchas tecnolog&iacute;as y puede ser dif&iacute;cil aprenderlas todas a la vez.  En este caso tal vez sea mejor enfocar nuestros esfuerzos sobre cada tecnolog&iacute;a de forma aislada.  Las aplicaciones Rails utilizan Ruby, HTML, CSS y SASS, JavaScript y CoffeeScript, y SQL.  Si conocemos los fundamentos de todas estas tecnolog&iacute;as nos ser&aacute; mucho m&aacute;s f&aacute;cil aprender Rails.  Para muchos lo m&aacute;s dif&iacute;cil ser&aacute; el propio lenguaje Ruby.  Y si somos reci&eacute;n llegados al mundo de la programaci&oacute;n ser&aacute; bueno leer el libro <a href="http://pragprog.com/book/ltp2/learn-to-program">Learn to Program</a> de Chris Pine donde aprenderemos los fundamentos de Ruby as&iacute; como conceptos generales de programaci&oacute;n.</p>

<p>La web <a href="http://tryruby.org/levels/1/challenges/0">Try Ruby</a> es una forma entretenida e interactiva de aprender los fundamentos de Ruby, y no debemos olvidar que podemos ejecutar c&oacute;digo de Ruby interactivamente en el terminal ejecutando <code>irb</code>.  Dentro de una aplicaci&oacute;n Rails podemos ejecutar <code>rails console</code> para cargar el entorno de dicha aplicaci&oacute;n, siendo esta la mejor forma de experimentar con nuestras aplicaciones.</p>

<p>Disponemos de varios retos para afilar nuestros conocimientos de Rails.  Nuestro viejo amigo <a href="http://www.rubyquiz.com/">Ruby Quiz</a> tiene un amplio archivo de desaf&iacute;os para los que podremos escribir una soluci&oacute;n.  Tambi&eacute;n hay ejercicios en  <a href="http://ruby-challenge.rubylearning.org/">Ruby Learning Blog</a>, que incluye la lista en la p&aacute;gina principal.  Hay ejercicios m&aacute;s modernos (pero m&aacute;s dif&iacute;ciles) en  <a href="http://codebrawl.com/">Codebrawl</a>.  Por &uacute;ltimo, Ryan Bates ha creado el  <a href="https://github.com/ryanb/ruby-warrior">Ruby Warrior project</a> que nos resultar&aacute; de ayuda a la hora de aprender Ruby.</p>

<h3>Nuestra propia aplicaci&oacute;n</h3>

<p>Seguir diversos tutoriales y ejercicios est&aacute; muy bien pero no resulta tan inspirador ni gratificante como crear nuestra propia aplicaci&oacute;n Rails.  Si ya tenemos una idea para una aplicaci&oacute;n, &iquest;por d&oacute;nde deber&iacute;amos empezar?  Lo mejor es empezar por la interfaz de usuario, bocetando cada una de las p&aacute;ginas de nuestra aplicaci&oacute;n bien mediante l&aacute;piz y papel o bien mediante un programa como  <a href="http://www.balsamiq.com/">Balsamiq Mockups</a>.  Con esto nos ser&aacute; m&aacute;s f&aacute;cil dividir nuestra aplicaci&oacute;n en recursos.  Por ejemplo, por lo general un formulario servir&aacute; para crear o editar un recurso y otras p&aacute;ginas listar&aacute;n los recursos o bien mostrar&aacute;n un &uacute;nico recurso.  Con esto podremos crear un modelo y un controlador para cada uno de estos recursos, y ya estaremos en v&iacute;as de crear nuestra primera aplicaci&oacute;n Rails.</p>

<p>Seg&uacute;n vayamos construyendo nuestra aplicaci&oacute;n nos iremos encontrando con &aacute;reas que no est&aacute;n cubiertas por los tutoriales que hemos seguido.  Aqu&iacute; es donde entra en juego RailsCasts.  Se trata de una gran referencia a la hora de incorporar ciertas funcionalidades en nuestra aplicaci&oacute;n como por ejemplo autenticaci&oacute;n, administraci&oacute;n, etc.  Se incluye el c&oacute;digo fuente de la mayor&iacute;a de los episodios por lo que podremos descargar y probar el c&oacute;digo de cada episodio.  Los episodios m&aacute;s recientes incluyen versiones del proyecto &quot;antes&quot; y &quot;despu&eacute;s&quot; para que podamos ver los cambios.</p>

<p><a href="https://www.ruby-toolbox.com/">The Ruby Toolbox</a> es otro recurso al que acudir.  Proporciona un listado de gemas que sirven para acometer diferentes tareas en Ruby y Rails.  Tambi&eacute;n merece la pena seguir el resto de Rails Guides donde se cubren muchos temas y podremos mejorar nuestro conocimiento de todas las &aacute;reas que cubre Ruby on Rails.  Por &uacute;ltimo, conviene no olvidar  <a href="http://api.rubyonrails.org/">el sitio de la API de Ruby on Rails</a> a donde podremos acudir para encontrar toda la documentaci&oacute;n relevante a cualquier m&eacute;todo espec&iacute;fico de Rails.</p>

<h3>En busca de ayuda</h3>

<p>Es seguro que a lo largo del desarrollo de nuestra aplicaci&oacute;n nos encontraremos con problemas que no seremos capaces de resolver por nosotros mismos.  En estas situaciones conviene acudir a las comunidades de Ruby y Rails.  Un buen sitio por donde empezar es en la  <a href="https://groups.google.com/group/rubyonrails-talk">lista de correo Rails Talk</a>.  Se pueden realizar b&uacute;squedas en el archivo para ver si alguien se ha topado con el mismo problema y si no, lanzar nuestra pregunta.   <a href="http://stackoverflow.com/">StackOverflow</a> es otro buen lugar donde preguntar cuestiones relacionadas con la programaci&oacute;n, pero no debemos olvidarnos de etiquetar nuestras consultas con <a href="http://stackoverflow.com/questions/tagged/ruby-on-rails">ruby-on-rails</a>.</p>
