<p>Como desarrolladores Rails pasamos mucho tiempo en la l&iacute;nea de &oacute;rdenes, pero no siempre le sacamos el m&aacute;ximo provecho.  La <em>shell</em> por defecto en los sistemas UNIX es Bash, y una de las mejores cosas que se puede hacer es cambiarla por <a href="http://zsh.sourceforge.net/">Z Shell</a> (zsh).   Esto puede resultar un poco complicado pero existe un proyecto llamado  <a href="https://github.com/robbyrussell/oh-my-zsh">oh-my-zsh</a> que facilita la instalaci&oacute;n de zsh con una configuraci&oacute;n atractiva por defecto y alguas extensiones y temas.  Lo &uacute;nico que tenemos que hacer para cambiar es lanzar esta orden en el terminal:</p>

``` terminal
wget --no-check-certificate https://github.com/robbyrussell/oh-my-zsh/raw/master/tools/install.sh -O - | sh
```

<p>Si no tenemos <code>wget</code> instalado en nuestro equipo podemos instalar zsh con <code>curl</code> de la siguiente manera:</p>

``` terminal
curl -L https://github.com/robbyrussell/oh-my-zsh/raw/master/tools/install.sh | sh
```

<p>Esta l&iacute;nea clonar&aacute; el repositorio de oh-my-zsh y lo instalar&aacute;, aunque tendremos que introducir nuestra clave en el proceso.  Una vez que haya finalizado, podemos abrir una ventana nueva de terminal, que ahora ejecutar&aacute; zsh.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/907/original/E308I01.png" width="585" height="210" alt="Una nueva ventana de terminal con zsh."/>
</div>

<p>Lo primero que hay que destacar es que el <em>prompt</em> tiene un aspecto considerablemente diferente.  Podemos personalizarlo todav&iacute;a m&aacute;s utilizando temas, lo que veremos m&aacute;s adelante.  Aunque zsh tiene un aspecto distinto se comporta por lo general igual que Bash, as&iacute; que las &oacute;rdenes que usemos en Bash funcionar&aacute;n igual en zsh.</p>

<h3>Un repaso r&aacute;pido de la funcionalidad de zsh</h3>

<p>Una de las funcionalidades m&aacute;s interesantes de zsh es el autocompletado inteligente.  Si, por ejemplo, tecleamos <code>ls -</code> y luego pulsamos la tecla TAB, veremos una lista de las opciones que admite <code>ls</code>.  Podemos incluso usar las teclas de cursor para recorrer la lista y completar la orden.  Esta funcionalidad es especialmente interesante con &oacute;rdenes m&aacute;s complejas como <code>git commit</code>.</p>

```` terminal
➜  ~  git commit -
--all              -a  -- update all paths in the index file                  
--allow-empty          -- allow recording an empty commit                     
--amend                -- amend the tip of the current branch                 
--author               -- override the author name used in the commit         
--cleanup              -- specify how the commit message should be cleaned up 
--edit             -e  -- edit the commit message before committing           
--file             -F  -- read commit message from given file                 
--include          -i  -- update the given files and commit the whole index   
--interactive          -- interactively update paths in the index file        
--message          -m  -- use the given message as the commit message         
--no-verify        -n  -- do not look for suspicious lines the commit introduc
--only             -o  -- commit only the given files                         
--quiet            -q  -- suppress commit summary message                     
--reedit-message   -c  -- use existing commit object and edit log message     
--reuse-message    -C  -- use existing commit object with same log message    
--signoff          -s  -- add Signed-off-by line at the end of the commit mess
--untracked-files  -u  -- show files in untracked directories                 
--verbose          -v  -- show unified diff of all file changes
```

<p>Otra funcionalidad &uacute;til es la posibilidad de especificar opciones de comod&iacute;n m&aacute;s completas.  Si queremos un listado de todos los ficheros Ruby de un proyecto Rails, podemos utilizar el asterisco doble para buscar en directorios con varios niveles de anidamiento.</p>

``` terminal
➜  railscasts git:(master) ls **/*.rb
app/controllers/application_controller.rb
app/controllers/comments_controller.rb
app/controllers/episodes_controller.rb
app/controllers/feedback_messages_controller.rb
app/controllers/info_controller.rb
app/controllers/users_controller.rb
app/controllers/versions_controller.rb
app/helpers/application_helper.rb
app/helpers/comments_helper.rb
app/helpers/episodes_helper.rb
app/helpers/error_messages_helper.rb
app/helpers/feedback_messages_helper.rb

# rest of files omitted.
```

<p>Algunas de las funcionalidades que ofrece zsh son espec&iacute;ficas de OS X, por ejemplo en el t&iacute;tulo de la ventana se ofrece informaci&oacute;n sobre el usuario, m&aacute;quina y directorio actual.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/908/original/E308I02.png" width="585" height="210" alt="El título de la ventana muestra la información del usuario, la máquina y el directorio actual."/>
</div>

<p>Hay muchas otras funcionalidades &uacute;tiles, si se abre una nueva pesta&ntilde;a de terminal se abrir&aacute; en el mismo directorio que en la pesta&ntilde;a anterior. Tambi&eacute;n podemos empezar a escribir una orden y al pulsar la fecla hacia arriba se autocompletar&aacute; la orden bas&aacute;ndose en el historial de &oacute;rdenes anteriores.</p>

<h3>Configuraci&oacute;n de zsh</h3>

<p>Es posible configurar todas estas funcionalidades editando el fichero <code>.zshrc</code> de nuestro directorio personal que es el que se carga cuando se arranca una nueva sesi&oacute;n con zsh.</p>

``` ~/.zshrc
# Path to your oh-my-zsh configuration.
ZSH=$HOME/.oh-my-zsh

# Set name of the theme to load.
# Look in ~/.oh-my-zsh/themes/
# Optionally, if you set this to "random", it'll load a random theme each
# time that oh-my-zsh is loaded.
ZSH_THEME="robbyrussell"

# Set to this to use case-sensitive completion
# CASE_SENSITIVE="true"

# Comment this out to disable weekly auto-update checks
# DISABLE_AUTO_UPDATE="true"

# Uncomment following line if you want to disable colors in ls
# DISABLE_LS_COLORS="true"

# Uncomment following line if you want to disable autosetting terminal title.
# DISABLE_AUTO_TITLE="true"

# Uncomment following line if you want red dots to be displayed while waiting for completion
# COMPLETION_WAITING_DOTS="true"

# Which plugins would you like to load? (plugins can be found in ~/.oh-my-zsh/plugins/*)
# Example format: plugins=(rails git textmate ruby lighthouse)
plugins=(git)

source $ZSH/oh-my-zsh.sh

# Customize to your needs...
export PATH=/Users/eifion/.rvm/gems/ruby-1.9.2-p290/bin:/Users/eifion/.rvm/gems/ruby-1.9.2-p290@global/bin:/Users/eifion/.rvm/rubies/ruby-1.9.2-p290/bin:/Users/eifion/.rvm/bin:/Users/eifion/bin:/usr/local/bin:/usr/local/mysql/bin/:/usr/bin:/bin:/usr/sbin:/sbin:/usr/local/bin:/usr/X11/bin
```

<p>Este archivo primero establece la ruta de configuraci&oacute;n al directorio de oh-my-zsh y luego establece el tema, que es <code>robbyrussell</code>.  Debajo hay otras opciones que figuran comentadas por ejemplo si queremos desactivar los colores en los listados de directorio podemos descomentar la opci&oacute;n <code>DISABLE_LS_COLORS</code>.</p>

<p>M&aacute;s abajo hay una lista de los <em>plugins</em> activados.  Tan s&oacute;lo hemos habilitado la extensi&oacute;n para <code>git</code>, pero m&aacute;s adelante vamos a a&ntilde;adir m&aacute;s.  La l&iacute;nea siguiente  <code>source $ZSH/oh-my-zsh.sh</code> es la que carga  oh-my-zsh y por &uacute;ltimo aparece la l&iacute;nea que configura nuestra variable <code>PATH</code>, que por defecto es el mismo valor que ten&iacute;a cuando instalamos oh-my-zsh,  pero es mejor importarlo directamente de nuestro perfil de Bash, lo que podemos hacer eliminando la l&iacute;nea que empieza por <code>export PATH</code> de <code>.zshrc</code> y luego lanzando la orden.</p>

``` terminal	
➜  ~  cat ~/.bash_profile >> ~/.zshrc
```

<p>Por supuesto estos valores ser&aacute;n diferentes en cada m&aacute;quina, en la mayor&iacute;a de ocasiones deber&iacute;a ser posible copiarlos directamente pero algunas veces har&aacute; falta hacer alg&uacute;n que otro ajuste para que funcione.</p>

<h3>Temas</h3>

<p>A continuaci&oacute;n crearemos un nuevo tema para modificar el aspecto de la l&iacute;nea de &oacute;rdenes.  Los temas disponibles est&aacute;n en el directorio <code>~/.oh-my-zsh/themes</code> y la instalaci&oacute;n por defecto incluye muchos.  Para ver su aspecto hay un listado de los temas con capturas de pantalla en <a href="https://github.com/robbyrussell/oh-my-zsh/wiki/Themes">la p&aacute;gina de wiki de oh-my-zsh</a>.  Si queremos personalizar a&uacute;n m&aacute;s oh-my-zsh podemos crear nuestro propio tema creando un nuevo archivo <code>zsh-theme</code> en el directorio de temas, que es lo que haremos a continuaci&oacute;n.</p>


``` ~/oh-my-zsh/themes/eifion.zsh-theme
PROMPT='%3~$(git_prompt_info)%#'

ZSH_THEME_GIT_PROMPT_PREFIX="["
ZSH_THEME_GIT_PROMPT_SUFFIX="]"
```

<p>Nuestro tema es muy b&aacute;sico, lo &uacute;nico que hace es establecer el <em>prompt</em> y el sufijo para la parte que aparece cuando el directorio actual es parte de un repositorio Git.  Si queremos personalizar nuestro tema todav&iacute;a m&aacute;s podemos inspirarnos en el c&oacute;digo fuente de otros temas.  Tambien hay una <a href="http://www.acm.uiuc.edu/workshops/zsh/prompt/escapes.html">p&aacute;gina &uacute;til</a> con documentaci&oacute;n con los diversos caracteres que podemos pasar en la variable <code>PROMPT</code> y lo que hacen.  Para ver nuestro tema en acci&oacute;n tendremos que cambiar la opci&oacute;n <code>ZSH_THEME</code> del  fichero <code>.zshrc</code> para que coincida con el nombre de nuestro tema.</p>

``` ~/.zshrc
ZSH_THEME="eifion"
```

<h3>Extensiones</h3>

<p>Zsh se puede ampliar f&aacute;cilmente utilizando extensiones.  Al igual que con los temas por defecto oh-my-zsh incluye muchas extensiones, que se encuentran en el directorio <code>~/.oh-my-zsh/plugins</code>.  Antes de activar una extensi&oacute;n es buena idea mirar en su directorio para ver qu&eacute; es lo que hace.  Veremos la extensi&oacute;n para Bundler, que tiene un fichero <code>_bundler</code>.  Si una extensi&oacute;n dispone de un fichero que comienza con un gui&oacute;n bajo quiere decir que a&ntilde;ade funcionalidad de autocompletado a una orden.  La extensi&oacute;n hace tambi&eacute;n otras cosas, por ejemplo a&ntilde;ade varios alias de las &oacute;rdenes m&aacute;s frecuentes en Bundler y tambi&eacute;n hace que varias &oacute;rdenes relacionadas con Rails se lancen con <code>bundle exect</code> para no tener que teclearlo cada vez que queramos ejecutarlas.</p>

<p>Hay otras extensiones que pueden ser &uacute;tiles.  La extensi&oacute;n <code>brew</code> a&ntilde;ade autocompletado, al igual que la extensi&oacute;n <code>gem</code>.  Otras son menos &uacute;tiles, como las extensiones <code>rails3</code> y <code>ruby</code> que simplemente a&ntilde;aden algunos alias.  Para activar estas extensiones tenemos que incluirlas en la opci&oacute;n <code>plugins</code> del fichero <code>.zshrc</code> de la siguiente manera:</p>

``` ~/.zshrc
plugins=(git bundler brew gem)
```

<p>Tambi&eacute;n podemos crear nuestras propias extensiones.   Nosotros guardamos todos nuestros proyectos en el directorio <code>~/code</code> y resulta un poco molesto escribir <code>cd ~/code/&lt;project&gt;</code> cada vez que queremos cambiarnos al directorio de un proyecto.  Crearemos una nueva orden <code>c</code> que nos permitir&aacute; movernos f&aacute;cilmente al directorio de un proyecto.  Podemos crear nuestras propias extensiones en el  directorio <code>~/.oh-my-zsh/custom/plugins</code>.  Nos har&aacute; falta un directorio para la extensi&oacute;n y un fichero <code>.plugin.zsh</code>.</p>

``` ~/.oh-my-zsh/custom/plugins/eifion/eifion.plugin.zsh
c() { cd ~/code/$1;  }

_c() { _files -W ~/code -/; }
compdef _c c
```

<p>La primera l&iacute;nea define la orden <code>c</code> y simplemente establece el directorio actual al subdirectorio del<code>~/code</code> que se pase como argumento.  La segunda l&iacute;nea a&ntilde;ade autocompletado para la orden.  Para a&ntilde;adir autocompletado tenemos que crear otra orden con el mismo nombre pero precedido de un gui&oacute;n bajo.  Nuestra orden <code>_c</code> delega en el comportamiento de completado de <code>_files</code>, y por tanto generar&aacute; los nombres a partir de los ficheros que existan en el directorio <code>~/code</code> directory. La &uacute;ltima l&iacute;nea establece que <code>_c</code> deber&iacute;a usarse para autocompletar los argumentos de <code>c</code>.</p>

<p>Para nuestra extensi&oacute;n est&eacute; disponible tenemos que a&ntilde;adirla en la opci&oacute;n correspondiente en nuestro fichero <code>.zshrc</code>.</p>


``` ~/.zshrc
plugins=(git bundler brew gem eifion)
```

<p>Tendremos que abrir una nueva pesta&ntilde;a de terminal para que los cambios surtan efecto, tras lo cual podremos usar nuestra nueva orden.</p>


<p>Con esto concluimos este episodio sobre oh-my-zsh.  A los que usen mucho la <em>shell</em> les interesa cambiar la que viene incluida por defecto en el sistema por zsh</p>
