<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/858/original/E302I01.png" width="800" height="418" alt="La página de perfil de usuario."/>
</div>

<p>Arriba se muestra la p&aacute;gina del perfil de un usuario en una aplicaci&oacute;n Rails.  Existe un enlace  &ldquo;Edit Profile&rdquo; al final de la p&aacute;gina que nos lleva a otra p&aacute;gina donde podemos editar nuestros datos.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/859/original/E302I02.png" width="800" height="543" alt="La página de edición del perfil de un usuario."/>
</div>

<p>Queremos que los usuarios puedan editar sus datos directamente en la p&aacute;gina de su perfil haciendo clic en cualquiera de ellos en lugar de utilizar una p&aacute;gina espec&iacute;fica de edici&oacute;n.  Al hacer clic sobre &eacute;l, el campo deber&iacute;a pasar a ser editable y se guardar&iacute;an los cambios pulsando la tecla Intro.</p>

<h3>Best In Place</h3>

<p>Hay varios <em>plugins</em> de Rails que nos pueden ayudar a la hora de a&ntilde;adir esta edici&oacute;n en l&iacute;nea en nuestra aplicaci&oacute;n.  Hay publicada una lista muy completa de ellos en  <a href="https://www.ruby-toolbox.com/categories/rails_in_place_editing">The Ruby Toolbox</a>. El que vamos a usar esta vez se llama  <a href="https://github.com/bernat/best_in_place">Best In Place</a>, si bien merece la pena echar un vistazo a los otros.  Best In Place es una bifurcaci&oacute;n de otro proyecto llamado  <a href="https://github.com/janv/rest_in_place">Rest in Place</a>, pero lo que marca la diferencia entre estos dos es el <em>helper</em> <code>best_in_place</code> con el que se hace muy f&aacute;cil a&ntilde;adir campos de edici&oacute;n en l&iacute;nea en nuestras aplicaciones Rails.</p>

<p>Best In Place tiene una p&aacute;gina de <a href="https://github.com/janv/rest_in_place">demostraci&oacute;n</a> y si la probamos veremos que podemos editar cualquier campo haciendo clic en &eacute;l, momento en el que se cambia el texto est&aacute;tico por el elemento de formulario apropiado para el tipo de dato del formulario.  Al pulsar Intro o hacer clic fuera del campo los datos se enviar&aacute;n al servidor para que se actualice la base de datos.  Es posible validar los campos, por lo que si se introduce una direcci&oacute;n incorrecta (por ejemplo) aparecer&aacute; un mensaje de error y el valor volver&aacute; al que ten&iacute;a antes de la edici&oacute;n.  Tambi&eacute;n se soportan otros tipos de datos por lo que se puede mostrar un desplegable para editar una asociaci&oacute;n o una caja de selecci&oacute;n para los campos booleanos.  Veamos qu&eacute; tenemos que hacer para a&ntilde;adir esta funcionalidad a nuestra p&aacute;gina de perfil.</p>

<h3>C&oacute;mo a&ntilde;adir Best In Place a nuestra aplicaci&oacute;n</h3>

<p>Primero tenemos que a&ntilde;adir la gema de Best In Place al Gemfile de la aplicaci&oacute;n y luego ejecutar <code>bundle</code>.</p>



```/Gemfile
source 'http://rubygems.org'

gem 'rails', '3.1.3'

gem 'sqlite3'

# Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem 'sass-rails',   '~> 3.1.5'
  gem 'coffee-rails', '~> 3.1.1'
  gem 'uglifier', '>= 1.0.3'
end

gem 'jquery-rails'
gem 'best_in_place'
```

<p>La gema incluye dos ficheros de JavaScript que deberemos incluir en la aplicaci&oacute;n, <code>jquery.purr</code> (que es un <em>plugin</em> de jQuery) y <code>best_in_place</code>.  Dado que se trata de una aplicaci&oacute;n Rails 3.1 tenemos que a&ntilde;adir ambos ficheros al manifiesto.</p>

``` /app/assets/javascripts/application.js
//= require jquery
//= require jquery_ujs
//= require jquery.purr
//= require best_in_place
//= require_tree .
```

<p>Tenemos que definir los campos que ser&aacute;n editables, lo que haremos en el fichero CoffeeScript para el modelo <code>users</code>.  Tan s&oacute;lo tenemos que invocar a <code>best_in_place()</code> en aquellos elementos que queramos que se puedan modificar.  Se lo aplicaremos a los elementos que tengan la clase <code>best_in_place</code>.</p>


``` /app/assets/javascripts/users.js.coffee
jQuery ->
  $('.best_in_place').best_in_place()
```  

<p>Con esto ya podemos empezar a aplicar Rest In Place a nuestra p&aacute;gina de perfil de usuario.  Este es el aspecto que tiene ahora mismo la plantilla:</p>


``` /app/views/users/show.html.erb
<h1>User Profile</h1>

<p>
  <b>Name:</b>
  <%= @user.name %>
</p>
<p>
  <b>Email:</b>
  <%= @user.email %>
</p>
<p>
  <b>Gender:</b>
  <%= @user.gender %>
</p>
<p>
  <b>Public profile:</b>
  <%= @user.public_profile %>
</p>
<p>
  <%= @user.bio %>
</p>

<%= link_to 'Edit Profile', edit_user_path(@user) %>
```

<p>La plantilla sencillamente muestra el valor de cada campo.  A&ntilde;adiremos el m&eacute;todo <em>helper</em> de Best In Place a los campos <code>name</code> y <code>email</code>.  El m&eacute;todo recibir&aacute; dos argumentos, el objeto que estamos viendo y un s&iacute;mbolo para el campo que deseamos editar.</p>


```/app/views/users/show.html.erb
<p>
  <b>Name:</b>
  <%= best_in_place @user, :name %>
</p>
<p>
  <b>Email:</b>
  <%= best_in_place @user, :email %>
</p>
```

<p>Al cargar la p&aacute;gina del perfil del usaurio y hacer clic en <code>name</code> o <code>email</code>, veremos que el campo se hace editable.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/860/original/E302I03.png" width="800" height="429" alt="El campo de nombre ya es editable."/>
</div>

<h3>Persistencia de los cambios</h3>

<p>Al modificar un campo y luego hacer clic fuera de &eacute;l veremos que el campo vuelve a su valor anterior, lo que no es lo que queremos que ocurra.  Si recargamos la p&aacute;gina veremos que aparece un mensaje que dice que se ha actualizado el usuario y la p&aacute;gina muestra el valor modificado.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/861/original/E302I04.png" width="800" height="458" alt="La página se actualiza cuando la recargamos."/>
</div>

<p>Esto ocurre as&iacute; porque Best In Place env&iacute;a las actualizaciones mediante JSON al servidor, pero <code>UsersController</code> no est&aacute; preparado para responder a peticiones JSON adecuadamente.  El controlador utiliza las siete acciones REST habitual, que son las que espera Best In Place, por lo que cuando se cambia el valor en el campo se invoca la acci&oacute;n <code>update</code> con los par&aacute;metros correctos, pero &eacute;sta no responde a la petici&oacute;n como debiera.</p>

<p>Para corregir esto tenemos que a&ntilde;adir un bloque <code>respond_to</code> en <code>update</code> o (al ser una aplicaci&oacute;n Rails 3) utilizar <code>respond_with</code> que se encargar&aacute; de todo, siempre qu epongamos una llamada a <code>respond_to</code> al principio de nuestro controlador.  As&iacute; que lo a&ntilde;adiremos.</p>


```/app/controllers/users_controller.rb
class UsersController < ApplicationController
  respond_to :html, :json
 
  # Se omiten otras acciones
 
  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
    respond_with @user
  end

end
```

<p>Si tenemos que personalizar este comportamiento podemos utilizar un bloque <code>respond_to</code> en la acci&oacute;n <code>update</code>, y hay un ejemplo de c&oacute;mo hacer esto en el  <a href="https://github.com/bernat/best_in_place/blob/master/README.md">README</a> de Best In Place.</p> 

<p>Ahora que nuestro controlador responde en JSON, la funcionalidad de edici&oacute;n en l&iacute;nea funciona correctamente.  Los cambios que hagamos se guardar&aacute;n en la base de datos y la interfaz de usuario se actualizar&aacute; tal y como esper&aacute;bamos.</p>

<p>Aqu&iacute; tambi&eacute;n funcionan las validaciones.  Si introducimos una direcci&oacute;n de correo incorrecta aparecer&aacute; un mensaje de error, aunque el que se usa por defecto no resultar&aacute; especialmente visible.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/862/original/E302I05.png" width="800" height="475" alt="Los errores de validación por defecto no son muy vistosos."/>
</div>

<p>Lo podemos embellecer con un poco de CSS.</p>

``` /app/assets/stylesheets/users.css.scss
.purr {
  position: fixed;
  top: 30px;
  right: 100px;
  width: 250px;
  padding: 20px;
  background-color: #FCC;
  border: solid 2px #666;
  &:first-letter { text-transform: uppercase };
}
```

<p>Todos estos estilos se encuentra en la clase <code>purr</code> que es lo que utiliza Best In Place.  Si volvemos a cargar la p&aacute;gina e introducimos una direcci&oacute;n de correo incorrecta el mensaje tendr&aacute; un mejor aspecto.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/863/original/E302I06.png" width="800" height="475" alt="Tras añadir un poco de CSS los mensajes de error tienen mejor aspecto."/>
</div> 

<h3>Gesti&oacute;n de otros tipos de datos</h3>

<p>Por ahora s&oacute;lo hemos hecho editables los campos <code>name</code> y <code>email</code>.  Veamos a continuaci&oacute;n los otros atributos de la p&aacute;gina del usuario.  El campo <code>bio</code> contiene un fragmento m&aacute;s largo de texto, pero por defecto Best In Place s&oacute;lo mostrar&aacute; una caja con una &uacute;nica l&iacute;nea.  Podemos cambiar este comportamiento a&ntilde;adiendo el atributo <code>type</code>.</p>

``` /app/views/users/show.html.erb
<%= best_in_place @user, :bio, type: :textarea %>
```

<p>El campo <code>public_profile</code> es un campo booleano por lo que deber&iacute;amos usar el tipo <code>checkbox</code> y pasar los valores queramos mostrar en la opci&oacute;n <code>:collection</code>.</p>

``` /app/views/users/show.html.erb
<%= best_in_place @user, :public_profile, type: :checkbox, collection: %w[No Yes] %>
```  

<p>Al hacer clic el valor de este campo cambiar&aacute; entre las dos opciones.  La opci&oacute;n de g&eacute;nero podr&iacute;amos tratarla igual, pero en este caso hemos utilizado <code>:select</code> en lugar de <code>:checkbox</code> y hemos pasado una lista de opciones.</p>

``` /app/views/users/show.html.erb
  <%= best_in_place @user, :gender, type: :select, :collection [["Male", "Male"], ["Female", "Female"], ["", "Unspecified"]] %>
```  

<p>Al hacerlo as&iacute;, aparecer&aacute; un men&uacute; desplegable al hacer clic en el g&eacute;nero.</p>


<p>Con esto cerramos este episodio.  Ya tenemos una opci&oacute;n de edici&oacute;n en l&iacute;nea para todos los campos de nuestra p&aacute;gina de perfil de usuario.  Habr&aacute; veces en las que queramos hacer algo un poco m&aacute;s complicado, por ejemplo mostrar opciones de una asociaci&oacute;n, o quiz&aacute; formatear un campo de precio donde el valor mostrado puede ser distinto del que se muestra al editar.   Esto resulta un poco complejo por desgracia en la versi&oacute;n actual de Best In Place.  En estas situaciones es mejor volver al formulario tradicional de edici&oacute;n o implementar nuestra propia soluci&oacute;n.</p>

