<p>&#x5728;&#x7B2C;240&#x96C6; [ <a href="http://railscasts.com/episodes/240-search-sort-paginate-with-ajax">&#x89C2;&#x770B;</a> &#xFF0C; <a href="http://asciicasts.com/episodes/240-search-sort-paginate-with-ajax">&#x9605;&#x8BFB;</a> ]&#x6211;&#x4EEC;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;AJAX&#x6765;&#x6DFB;&#x52A0;&#x6392;&#x5E8F;&#xFF0C;&#x5206;&#x9875;&#x548C;&#x641C;&#x7D22;&#x5230;&#x4EA7;&#x54C1;&#x8868;&#x3002;&#x8FD9;&#x6837;&#x4F7F;&#x7528;AJAX&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x6216;&#x7B5B;&#x9009;&#x8868;&#x683C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BE5;&#x7F51;&#x9875;&#x7684;&#x7F51;&#x5740;&#x4E0D;&#x53D8;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x8FD4;&#x56DE;&#x6309;&#x94AE;&#x64A4;&#x9500;&#x6211;&#x4EEC;&#x5BF9;&#x8868;&#x683C;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x80FD;&#x628A;&#x6392;&#x5E8F;&#x6216;&#x7B5B;&#x9009;&#x540E;&#x7684;&#x9875;&#x9762;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x56DE;&#x6765;&#x540E;&#x5F97;&#x5230;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x3002;</p> <div class="imageWrapper"> <img src="/system/photos/536/original/E246I01.png" width="800" height="374" alt="&#x202A;&#x53EF;&#x4EE5;&#x6392;&#x5E8F;&#x548C;&#x641C;&#x7D22;&#x7684;&#x4EA7;&#x54C1;&#x8868;&#x3002;&#x202C;"/> </div> <p>&#x8FD9;&#x662F;&#x628A;AJAX&#x529F;&#x80FD;&#x6DFB;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x7AD9;&#x70B9;&#x65F6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x8FD9;&#x5C06;&#x4F1A;&#x5F88;&#x6709;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x8FD9;&#x96C6;&#x4E2D;&#x544A;&#x8BC9;&#x4F60;&#x600E;&#x4E48;&#x505A;&#x3002;</p> <h3>&#x4ECB;&#x7ECD;history.pushState&#x65B9;&#x6CD5;</h3> <p>&#x6211;&#x4EEC;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x5728;&#x7B2C;175 [ <a href="http://railscasts.com/episodes/175-ajax-history-and-bookmarks">&#x89C2;&#x770B;</a> &#xFF0C; <a href="http://asciicasts.com/episodes/175-ajax-history-and-bookmarks">&#x9605;&#x8BFB;</a> ]&#x96C6;&#x4E2D;&#x6D89;&#x53CA;&#x8FC7;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x5728;&#x90A3;&#x4E00;&#x96C6;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x6539;&#x53D8;URL&#x5728;&#x4E00;&#x4E2A;&#x542F;&#x7528;AJAX&#x7684;&#x7F51;&#x7AD9;&#x52A0;&#x5165;&#x4E66;&#x7B7E;&#x548C;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;&#x90A3;&#x96C6;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5206;&#x9875;&#x540E;&#x5C31;&#x5728;URL&#x540E;&#x52A0;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x951A;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x7B2C;3&#x9875;&#xFF0C;&#x7F51;&#x5740;&#x662F;<code>http://localhost:3000/#page=3</code> &#x3002;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4E66;&#x7B7E;&#x9875;&#xFF0C;&#x4F7F;&#x540E;&#x9000;&#x6309;&#x94AE;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6548;&#x679C;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5F88;&#x5FEB;&#x5C31;&#x53D8;&#x5F97;&#x66F4;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x590D;&#x6742;&#xFF0C;&#x6BD4;&#x5982;&#x50CF;&#x73B0;&#x5728;&#x9700;&#x8981;&#x5728;&#x6392;&#x5E8F;&#x548C;&#x641C;&#x7D22;&#x7684;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x5206;&#x9875;&#x3002;</p> <p>&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x4E5F;&#x88AB;&#x5E94;&#x7528;&#x5728;GitHub&#x7684;&#x6587;&#x4EF6;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x70B9;&#x51FB;&#x4E86;&#x4E00;&#x4E2A;GitHub&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x5C31;&#x901A;&#x8FC7;AJAX&#x5237;&#x65B0;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x951A;&#x70B9;&#x6574;&#x4E2A;URL&#x4E5F;&#x88AB;JavaScript&#x66F4;&#x65B0;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5237;&#x65B0;&#x9875;&#x9762;&#x6216;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8BE5;&#x9875;&#x9762;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x540E;&#x9000;&#x6309;&#x94AE;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x90A3;&#x6837;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;</p> <p><a href="https://github.com/blog/760-the-tree-slider">GitHub&#x5728;&#x535A;&#x5BA2;&#x4E0A;&#x8BB2;&#x8FC7;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;</a>&#xFF0C;&#x8FD9;&#x4E2A;blog&#x540E;&#x5F88;&#x503C;&#x5F97;&#x4E00;&#x8BFB;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x8981;&#x770B;&#x5230;&#x5B83;&#x5DE5;&#x4F5C;&#x4F60;&#x9700;&#x8981;&#x6700;&#x65B0;&#x7248;&#x7684;Safari&#xFF0C;Chrome&#x6216;Firefox&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7EDD;&#x5BF9;&#x503C;&#x5F97;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x3002;&#x662F;<code>history</code>&#x5BF9;&#x8C61;&#x7684;<code>pushState</code>&#x548C;<code>replaceState</code>&#x65B9;&#x6CD5;&#x548C;<code>popstate</code>&#x4E8B;&#x4EF6;&#x8BA9;&#x8FD9;&#x4E2A;&rdquo;&#x795E;&#x5947;&rdquo;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x5728;GitHub&#x7684;&#x535A;&#x5BA2;&#x4E0A;&#x6709;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x4ECE;&#x90A3;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x7EC6;&#x8282;&#x7684;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x6F14;&#x793A;&#x3002;</p> <p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x628A;&#x6574;&#x4E2A;&#x529F;&#x80FD;&#x52A0;&#x5230;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x7684;&#x8D2D;&#x7269;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x591A;&#x4E48;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x80FD;&#x5728;&#x6211;&#x4EEC;&#x6392;&#x5E8F;&#xFF0C;&#x641C;&#x7D22;&#x548C;&#x5206;&#x9875;&#x4EA7;&#x54C1;&#x8868;&#x7684;&#x65F6;&#x5019;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x5230;&#x539F;&#x6765;&#x7684;&#x5E94;&#x7528;&#x7684;JavaScript&#x7A0B;&#x5E8F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
$(&#39;#products th a, #products .pagination a&#39;).live(&#39;click&#39;,
  function () {
    $.getScript(this.href);
    return false;
  }
);

$(&#39;#products_search input&#39;).keyup(function () {
  $.get($(&#39;#products_search&#39;).attr(&#39;action&#39;), $(&#39;#products_search&#39;).serialize(), null, &#39;script&#39;);
  return false;
});
})
</pre> <p>&#x5982;&#x679C;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x5305;&#x542B;&#x4F60;&#x89C9;&#x5F97;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x503C;&#x5F97;&#x53BB;240&#x96C6;&#x67E5;&#x770B;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;jQuery&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x7528;<code>pushState</code>&#x548C;<code>replaceState</code>&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x4E5F;&#x53EF;&#x4EE5;&#x548C;Prototype&#x4F7F;&#x7528;&#x3002;</p> <p>&#x4EE3;&#x7801;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x6392;&#x5E8F;&#x548C;&#x5206;&#x9875;&#x7684;AJAX&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8C03;&#x7528;<code>history.pushState</code>&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4E00;&#x4E2A;&#x5206;&#x9875;&#x6216;&#x6392;&#x5E8F;&#x7684;&#x94FE;&#x63A5;&#x88AB;&#x70B9;&#x51FB;&#x540E;&#xFF0C;URL&#x5C31;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x91CC;&#x4E86;&#x3002;</p> <p>&#x6709;&#x4E00;&#x4E9B;<a href="https://developer.mozilla.org/en/DOM/Manipulating_the_browser_history#Adding_and_modifying_history_entries">&#x6709;&#x7528;&#x7684;&#x5173;&#x4E8E;<code>pushState</code></a>&#x6587;&#x6863;&#x5728;Mozilla&#x7684;&#x5F00;&#x53D1;&#x8005;&#x7F51;&#x4E0A;&#xFF0C;&#x8868;&#x660E;&#x5B83;&#x6709;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x72B6;&#x6001;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x4ED6;&#x4F1A;&#x5F53;popState&#x4E8B;&#x4EF6;&#x88AB;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#x8FD4;&#x56DE;&#x56DE;&#x6765;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x6807;&#x9898;&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;URL&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;<code>pushState</code>&#x7684;&#x8C03;&#x7528;&#x4E86;&#x3002;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(&#39;#products th a, #products .pagination a&#39;).live(&#39;click&#39;, 
function () {
  $.getScript(this.href);
  history.pushState(null, &quot;&quot;, this.href);
  return false;
});
</pre> <p>&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x4F20;&#x9012;<code>null</code>&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6807;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x5BF9;&#x4E8E;URL&#x6211;&#x4EEC;&#x4F20;&#x9012;&#x4E86;&#x5F53;&#x524D;&#x70B9;&#x51FB;&#x7684;&#x94FE;&#x63A5;<code>this.href</code>&#x3002;</p> <p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;AJAX&#x6392;&#x5E8F;&#x6216;&#x5206;&#x9875;&#x94FE;&#x63A5;&#x7684;&#x540E;&#xFF0C;&#x90A3;&#x4E2A;&#x8868;&#x683C;&#x4F1A;&#x5728;&#x6CA1;&#x6709;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x6BCF;&#x6B21;&#x6211;&#x4EEC;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x524D;&#x5728;&#x5730;&#x5740;&#x680F;&#x4E0A;&#x7684;URL&#x4F1A;&#x53D8;&#x6210;&#x6211;&#x4EEC;&#x4F20;&#x5165;<code>pushState</code>&#x65B9;&#x6CD5;&#x7684;URL&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x4E2A;URL&#x4F1A;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;</p> <div class="imageWrapper"> <img src="/system/photos/537/original/E246I02.png" width="801" height="474" alt="&#x5F53;&#x6211;&#x4EEC;&#x4FEE;&#x6539;&#x6392;&#x5E8F;&#x5217;&#xFF0C;URL&#x5C31;&#x4F1A;&#x6539;&#x53D8;&#x3002;"/> </div> <p>&#x6240;&#x4EE5;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x6392;&#x5E8F;&#x548C;&#x5206;&#x9875;&#x540E;&#x7684;&#x8868;&#x683C;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x56DE;&#x6765;&#xFF0C;&#x6216;&#x91CD;&#x65B0;&#x8F7D;&#x5165;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5373;&#x4F7F;&#x9875;&#x9762;&#x88AB;&#x901A;&#x8FC7;AJAX&#x52A8;&#x6001;&#x66F4;&#x65B0;&#xFF0C;&#x5206;&#x9875;&#x548C;&#x6392;&#x5E8F;&#x662F;&#x53EF;&#x4EE5;&#x56DE;&#x590D;&#x7684;&#x3002;&#x4F46;&#x662F;&#x540E;&#x9000;&#x6309;&#x94AE;&#x8FD8;&#x4E0D;&#x4F1A;&#x50CF;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x90A3;&#x6837;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x76D1;&#x542C;<code>popstate</code>&#x4E8B;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;<code>popstate</code>&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x540E;&#x89E6;&#x53D1;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
// Other functions omitted.
$(window).bind(&quot;popstate&quot;, function () {
  $.getScript(location.href);
});
})
</pre> <p>&#x5728;<code>popstate</code>&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x65F6;&#xFF0C;URL&#x5DF2;&#x7ECF;&#x6539;&#x56DE;&#x4EE5;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>$.getScript</code>&#x65B9;&#x6CD5;&#x5E76;&#x4F20;&#x5165;URL&#x6765;&#x66F4;&#x65B0;&#x4EA7;&#x54C1;&#x8868;&#x683C;&#x3002;</p> <p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5237;&#x65B0;&#x9875;&#x9762;&#x5E76;&#x5206;&#x9875;&#x548C;&#x6392;&#x5E8F;&#x51E0;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x56DE;&#x9000;&#x6309;&#x94AE;&#x5DF2;&#x7ECF;&#x5DE5;&#x505A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x4E2D;&#x5BFC;&#x822A;&#x56DE;&#x6765;&#x3002;</p> <h3>&#x641C;&#x7D22;</h3> <p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8981;&#x770B;&#x4E00;&#x4E0B;&#x641C;&#x7D22;&#x529F;&#x80FD;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x5BF9;&#x4EA7;&#x54C1;&#x641C;&#x7D22;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8FC7;&#x6EE4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;URL&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x6211;&#x4EEC;&#x641C;&#x7D22;&#x540E;&#x628A;&#x5F53;&#x524D;&#x9875;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#x6216;&#x5237;&#x65B0;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5931;&#x53BB;&#x4E86;&#x8FD9;&#x4E2A;&#x641C;&#x7D22;&#x9875;&#x9762;&#x3002;</p> <div class="imageWrapper"> <img src="/system/photos/538/original/E246I03.png" width="801" height="474" alt="&#x202A;&#x5F53;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#x641C;&#x7D22;&#x5C31;&#x4E22;&#x5931;&#x4E86;&#x3002;&#x202C;"/> </div> <p>&#x7528;AJAX&#x641C;&#x7D22;&#x7684;JavaScript&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
// Other functions omitted.
$(&#39;#products_search input&#39;).keyup(function () {
  $.get($(&#39;#products_search&#39;).attr(&#39;action&#39;), $(&#39;#products_search&#39;).serialize(), null, &#39;script&#39;);
  return false;
});
})
</pre> <p>&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x8FD9;&#x91CC;&#x7528;&#x548C;&#x6211;&#x4EEC;&#x66F4;&#x6539;&#x6392;&#x5E8F;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x540C;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;<code>pushState</code>&#x3002;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
// Other functions omitted.
$(&#39;#products_search input&#39;).keyup(function () {
  var action = $(&#39;#products_search&#39;).attr(&#39;action&#39;);
  var formData = $(&#39;#products_search&#39;).serialize();
  $.get(action, formData, null, &#39;script&#39;);
  history.pushState(null, &quot;&quot;, action + &quot;?&quot; + formData);    return false;
}); 
})
</pre> <p><code>pushState</code>&#x8BB0;&#x5F55;&#x7684;URL&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x5F62;&#x5F0F;&#x641C;&#x7D22;&#x8868;&#x5355;&#x7684;<code>action</code>&#x548C;&#x5E8F;&#x5217;&#x5316;&#x540E;&#x8868;&#x5355;&#x6570;&#x636E;&#x7528;&#x95EE;&#x53F7;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7F51;&#x5740;&#x3002;</p> <p>&#x202A;&#x5F53;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x770B;&#x5230;&#x6BCF;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x641C;&#x7D22;&#x6846;&#x91CC;&#x952E;&#x5165;&#x65F6;URL&#x90FD;&#x4F1A;&#x6539;&#x53D8;&#x3002;&#x202C;&#x202A;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x6309;&#x8FD4;&#x56DE;&#x952E;&#xFF0C;&#x53D1;&#x73B0;&#x5386;&#x53F2;&#x9875;&#x9762;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x641C;&#x7D22;&#x6846;&#x91CC;&#x6BCF;&#x6B21;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x6BCD;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x4E0D;&#x4E0D;&#x7406;&#x60F3;&#x7684;&#x3002;&#x202C;&#x202A;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x662F;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x952E;&#x88AB;&#x6309;&#x4E0B;&#x7684;&#x65F6;&#x5019;&#x8C03;&#x7528;&#x7684;<code>pushState</code>&#x3002;&#x202C;&#x202A;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;<code>pushState</code>&#x4E3A;<code>replaceState</code> &#x3002;&#x202C;&#x202A;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x66FF;&#x6362;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x65B9;&#x6CD5;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x5047;&#x5982;&#x53E6;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x3002;&#x202C;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
// Other functions omitted.
$(&#39;#products_search input&#39;).keyup(function () {
  var action = $(&#39;#products_search&#39;).attr(&#39;action&#39;);
  var formData = $(&#39;#products_search&#39;).serialize();
  $.get(action, formData, null, &#39;script&#39;);
  history.replaceState(null, &quot;&quot;, action + &quot;?&quot; + formData);    return false;
}); 
}&#xFF09;</pre> <p>&#x202A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7A97;&#x53E3;&#x505A;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;URL&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x6539;&#x53D8;&#x4E0D;&#x4F1A;&#x6DFB;&#x52A0;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x53BB;&#x3002;&#x202C;
</p> <div class="imageWrapper"> <img src="/system/photos/539/original/E246I04.png" width="801" height="474" alt="&#x202A;&#x641C;&#x7D22;&#x8BCD;&#x73B0;&#x5728;&#x88AB;&#x6DFB;&#x52A0;&#x5230;URL&#x3002;&#x202C;"/> </div> <p>&#x202A;&#x8FD9;&#x662F;&#x529F;&#x80FD;&#x4E0D;&#x50CF;&#x6211;&#x4EEC;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x7406;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;<code>pushState</code>&#xFF0C;&#x968F;&#x540E;&#x8C03;&#x7528;<code>replaceState</code>&#xFF0C;&#x4EE5;&#x4FBF;&#x641C;&#x7D22;&#x9879;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;&#x202C;&#x202A;&#x8FD9;&#x4E2A;&#x8D85;&#x51FA;&#x4E86;&#x4E00;&#x70B9;&#x8FD9;&#x4E00;&#x96C6;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x4F1A;&#x5728;&#x8FD9;&#x91CC;&#x6D89;&#x53CA;&#x3002;&#x202C;</p> <h3>&#x202A;&#x7ED9;&#x6BCF;&#x4E2A;&#x72B6;&#x6001;&#x6DFB;&#x52A0;&#x6807;&#x9898;&#x202C;</h3> <p>&#x202A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6392;&#x5E8F;&#x4EA7;&#x54C1;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x5E76;&#x6309;&#x4F4F;&#x540E;&#x9000;&#x6309;&#x94AE;&#x53BB;&#x67E5;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x663E;&#x793A;&#x6BCF;&#x4E00;&#x6B21;&#x66F4;&#x6539;&#x7684;URL&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x6211;&#x4EEC;&#x8981;&#x4F1A;&#x9000;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5F88;&#x96BE;&#x9009;&#x62E9;&#x4E86;&#x3002;&#x202C;&#x202A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6807;&#x9898;&#x800C;&#x4E0D;&#x662F;URL&#x663E;&#x793A;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x5C31;&#x4F1A;&#x8BA9;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7684;&#x529F;&#x80FD;&#x66F4;&#x6709;&#x7528;&#x3002;&#x202C;&#x202A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x6BCF;&#x6B21;&#x8C03;&#x7528;<code>pushState</code>&#x7684;&#x65F6;&#x5019;&#x628A;&#x7F51;&#x9875;&#x7684;&#x6807;&#x9898;&#x8BBE;&#x7F6E;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x202C;</p> <p>&#x202A;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x6709;&#x7528;&#x7F51;&#x9875;&#x7684;&#x6807;&#x9898;&#xFF1F;&#x202C;&#x202A;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x505A;&#x7684;&#x662F;&#x8BBE;&#x7F6E;&#x9875;&#x9762;&#x6807;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5728;pushState&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x3002;&#x202C;&#x202A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5F53;&#x4E00;&#x4E2A;AJAX&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x540E;&#x53D1;&#x56DE;&#x66F4;&#x65B0;&#x7528;&#x7684;<code>index.js.erb</code>&#x6587;&#x4EF6;&#x8BBE;&#x7F6E;&#x8BBE;&#x7F6E;&#x6807;&#x9898;&#x3002;&#x202C;</p> <p class="codeFilePath">/app/views/products/index.js.erb
</p> <pre class="javascript">$(&#39;#products&#39;).html(&#39;&lt;%= escape_javascript(render(&quot;products&quot;)) %&gt;&#39;);
document.title = &quot;&lt;%= escape_javascript(&quot;#{params[:search].to_s.titleize} Products by #{(params[:sort] || &#39;name&#39;).titleize} - Page #{(params[:page] || 1)}&quot;) %&gt;&quot;
</pre> <p>&#x202A;&#x6211;&#x4EEC;&#x5C06;&#x8BBE;&#x7F6E;&#x5305;&#x542B;&#x641C;&#x7D22;&#x548C;&#x6392;&#x5E8F;&#x6761;&#x4EF6;&#x4E3A;&#x5F53;&#x524D;&#x9875;&#x9762;&#x7684;&#x6807;&#x9898;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5F97;&#x89C1;&#x4E86;&#x3002;&#x202C;&#x202A;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;<code>pushState</code>&#x548C;<code>replaceState</code>&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x66F4;&#x65B0;&#x9875;&#x9762;&#x7684;&#x6807;&#x9898;&#x3002;&#x202C;</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">$(function () {
$(&#39;#products th a, #products .pagination a&#39;).live(&#39;click&#39;, function () {
  $.getScript(this.href);
  history.pushState(null, document.title, this.href);
  return false;
});

$(&#39;#products_search input&#39;).keyup(function () {
  var action = $(&#39;#products_search&#39;).attr(&#39;action&#39;);
  var formData = $(&#39;#products_search&#39;).serialize();
  $.get(action, formData, null, &#39;script&#39;);
  history.replaceState(null, document.title, action + &quot;?&quot; + formData);    return false;
});

$(window).bind(&quot;popstate&quot;, function () {
  $.getScript(location.href);
});
})
</pre> <p>&#x202A;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x641C;&#x7D22;&#x6216;&#x6392;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x7F51;&#x9875;&#x7684;&#x6807;&#x9898;&#x90FD;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x6807;&#x9898;&#x7684;&#x5217;&#x8868;&#x800C;&#x4E0D;&#x662F;URL&#x3002;&#x202C;
</p> <div class="imageWrapper"> <img src="/system/photos/540/original/E246I05.png" width="801" height="476" alt="&#x202A;&#x6BCF;&#x4E00;&#x9875;&#x7684;&#x6807;&#x9898;&#x73B0;&#x5728;&#x663E;&#x793A;&#x5728;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;&#x202C;"/> </div> <h3>&#x202A;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5904;&#x7406;&#x202C;
</h3> <p>&#x202A;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x5DE5;&#x4F5C;&#x7684;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5047;&#x8BBE;<code>history.pushState</code>&#x65B9;&#x6CD5;&#x5728;&#x7528;&#x6237;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x662F;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x597D;&#x50CF;&#x53EA;&#x6709;&#x6700;&#x65B0;&#x7248;&#x7684;Safari&#xFF0C;Firefox&#x548C;Chrome&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x3002;&#x202C;&#x202A;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x68C0;&#x67E5;&#x8BE5;&#x6D4F;&#x89C8;&#x5668;&#x662F;&#x5426;&#x652F;&#x6301;pushState&#xFF0C;&#x7136;&#x540E;&#x4FEE;&#x6539;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x202C;</p> <p>&#x202A;&#x6211;&#x4EEC;&#x4F1A;&#x505A;&#x7684;&#x662F;&#x68C0;&#x67E5;&#x662F;&#x5224;&#x65AD;<code>history</code>&#x5BF9;&#x8C61;&#x548C;0}history.pushState&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x5B58;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5173;&#x95ED;&#x6240;&#x6709;AJAX&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x94FE;&#x63A5;&#x800C;&#x4E0D;&#x662F;AJAX&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4F18;&#x96C5;&#x7684;&#x964D;&#x7EA7;&#x3002;&#x202C;
</p> <p class="codeFilePath">/public/javascripts/application.js</p> <pre class="javascript">if (history &amp;&amp; history.pushState) {
$(function () {
  $(&#39;#products th a, #products .pagination a&#39;).live(&#39;click&#39;, function () {
    $.getScript(this.href);
    history.pushState(null, document.title, this.href);
    return false;
  });

  $(&#39;#products_search input&#39;).keyup(function () {
    var action = $(&#39;#products_search&#39;).attr(&#39;action&#39;);
    var formData = $(&#39;#products_search&#39;).serialize();
    $.get(action, formData, null, &#39;script&#39;);
    history.replaceState(null, document.title, action + &quot;?&quot; + formData);      
    return false;
  });

  $(window).bind(&quot;popstate&quot;, function () {
    $.getScript(location.href);
  });
})
}
</pre> <p>&#x202A;&#x8FD9;&#x5C31;&#x662F;&#x8FD9;&#x96C6;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#x3002;&#x202C;&#x202A;&#x5B83;&#x6CA1;&#x6709;&#x4F7F;&#x7528;Rails&#x7684;&#x7279;&#x5B9A;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x53BB;&#x5904;&#x7406;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;AJAX&#x3002;&#x202C;&#x202A;&#x5982;&#x679C;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x50CF;&#x5BF9;&#x5F85;&#x4F20;&#x7EDF;&#x7684;HTML&#x94FE;&#x63A5;&#x4E00;&#x6837;&#x5BF9;&#x5F85;AJAX&#x94FE;&#x63A5;&#x3002;&#x202C;</p>