<p>Con <a href="http://datatables.net/">DataTables</a> podemos transformar f&aacute;cilmente una tabla HTML en un listado con paginaci&oacute;n, ordenaci&oacute;n y b&uacute;squeda mediante JavaScript.  En este episodio veremos c&oacute;mo configurar DataTables para que capture datos de una aplicaci&oacute;n Rails.  Partiremos de la p&aacute;gina que se muestra a continuaci&oacute;n muestra un listado de productos, sobre la que a&ntilde;adiremos DataTables.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1115/original/E340I01.png" width="800" height="500" alt="La tabla de productos."/>
</div>

<h3>C&oacute;mo incorporar DataTables en nuestra aplicaci&oacute;n</h3>

<p>Podr&iacute;amos descargar el <a href="http://datatables.net/">c&oacute;digo fuente</a>  y utilizarlo en nuestra aplicaci&oacute;n Rails pero es dif&iacute;cil de integrar con el conducto de est&aacute;ticos porque el c&oacute;digo incluye referencias a im&aacute;genes con rutas relativas que tendr&iacute;amos que corregir.  Pero por suerte para nosotros existe una gema llamada <a href="https://github.com/rweng/jquery-datatables-rails"><code>jquery-datatables-rails</code></a> que ya ha resuelto todo esto.  La a&ntilde;adiremos al grupo <code>assets</code> de nuestro <code>Gemfile</code>.  Como el autor actualiza frecuentemente la gema y queremos usar la &uacute;ltima versi&oacute;n, simplemente utilizaremos la opci&oacute;n <code>github</code> y pasaremos el nombre del repositorio.</p>

``` /Gemfile
group :assets do
  gem 'sass-rails',   '~> 3.2.3'
  gem 'coffee-rails', '~> 3.2.1'

  # See https://github.com/sstephenson/execjs#readme for more supported runtimes
  # gem 'therubyracer', :platform => :ruby

  gem 'uglifier', '>= 1.0.3'
  gem 'jquery-datatables-rails', github: 'rweng/jquery-datatables-rails'
end
```

<p>La opci&oacute;n <code>github</code> es nueva en Bundler 1.1.  Si no disponemos de esta versi&oacute;n tendremos que pasar la ruta completa de git.  Como siempre que a&ntilde;adimos una gema tendremos que ejecutar <code>bundle</code> para instalarla, tras lo que podremos integrar DataTables con el conducto de est&aacute;ticos.  Primero tenemos que ir al fichero <code>application.js</code> e insertar una llamada a <code>dataTables/jquery.dataTables</code> en el manifiesto.</p>

``` /app/assets/javascripts/application.js
//= require jquery
//= require jquery_ujs
//= require dataTables/jquery.dataTables
//= require_tree .
```

<p>Tambi&eacute;n tenemos que incluir ciertas hojas de estilo, por lo que modificaremos tambi&eacute;n el fichero <code>
 application.css</code>.</p>

``` /app/assets/stylesheets/application.css
/*
 * This is a manifest file that'll automatically include all the stylesheets available in this directory
 * and any sub-directories. You're free to add application-wide styles to this file and they'll appear at
 * the top of the compiled file, but it's generally better to create a new file per style scope.
 *= require_self
 *= require dataTables/jquery.dataTables
 *= require_tree . 
*/
```

<h3>C&oacute;mo a&ntilde;adir DataTables a una tabla ya existente</h3>

<p>Ahora que hemos instalado DataTables en nuestra aplicaci&oacute;n podemos usarlo para mejorar nuestra tabla con productos.  A continuaci&oacute;n vemos el c&oacute;digo de la vista de dicha tabla y puede comprobarse que es bastante sencilo; lo &uacute;nico que tenemos es un bucle que recorre todos los productos y los muestran en una tabla.</p>


``` /app/views/products/index.html.erb
<h1>Products</h1>

<table>
  <tr>
    <th>Product Name</th>
    <th>Category</th>
    <th>Release Date</th>
    <th>Price</th>
  </tr>
<% @products.each do |product| %>
  <tr>
    <td><%= link_to(product.name, product) %></td>
    <td><%= product.category %></td>
    <td><%= product.released_on.strftime("%B %e, %Y") %></td>
    <td><%= number_to_currency(product.price) %></td>
  </tr>
<% end %>
</table>
```

<p>Para preparar esta tabla y que funcione con DataTables tenemos que poner la primera fila dentro de un elemento <code>thead</code> y el cuerpo de la tabla en un elemento <code>tbody</code>.  Tambi&eacute;n tenemos que poder referenciar la tabla desde JavaScript por lo que le daremos un <code>id</code>.</p>

``` /app/views/products/index.html.erb
<h1>Products</h1>

<table id="products">
  <thead>
    <tr>
      <th>Product Name</th>
      <th>Category</th>
      <th>Release Date</th>
      <th>Price</th>
  </tr>
</thead>
<tbody>
  <% @products.each do |product| %>
    <tr>
      <td><%= link_to(product.name, product) %></td>
      <td><%= product.category %></td>
      <td><%= product.released_on.strftime("%B %e, %Y") %></td>
      <td><%= number_to_currency(product.price) %></td>
    </tr>
  <% end %>
  <tbody>
</table>
```

<p>Ya podemos dotar a esta tabla de la funcionalidad de DataTables con una pizca de CoffeeScript.  Lo haremos en el fichero <code>products.js</code>.  Lo &uacute;nico que tenemos que tener en cuenta es que el DOM debe haber finalizado su carga cuando invocamos a <code>dataTable</code> sobre el objeto tabla.</p>

``` /app/assets/javascripts/products.js
jQuery ->
	$('#products').dataTable()
```	

<p>Si ahora recargamos la p&aacute;gina veremos que la tabla tiene un aspecto muy diferente.  Ahora tenemos paginaci&oacute;n, ordenaci&oacute;n y b&uacute;squedas.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1116/original/E340I02.png" width="800" height="531" alt="Hemos convertido la tabla en una DataTable."/>
</div>

<h3>Personalizaci&oacute;n de la vista</h3>


<p>DataTables admite muchas opciones de configuraci&oacute;n con las que podemos modificar su aparencia y comportamiento.  Por ejemplo, se puede cambiar la paginaci&oacute;n con  <code>sPaginationType</code>.  Si asignamos su valor a <code>full_numbers</code> veremos un enlace a cada p&aacute;gina.   El <a href="http://datatables.net/usage/options">manual</a> del sitio web de DataTables tiene una lista completa de todas las opciones de personalizaci&oacute;n.</p>


``` /app/assets/javascripts/products.js.coffee
jQuery ->
	$('#products').dataTable
	  sPaginationType: "full_numbers"
```	  
	 
<p>Podremos ver el nuevo estilo de paginaci&oacute;n tras recargar la p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1117/original/E340I03.png" width="800" height="531" alt="En la paginación aparecen enlaces a cada página."/>
</div>

<h3>Uso de estilos para mejorar el aspecto</h3>

<p>El aspecto de la tabla no es perfecto, pero puede cambiarse.  La p&aacute;gina de DataTables muestra una tabla de ejemplo que tiene un aspecto m&aacute;s bonito que por supuesto podemos usar en nuestra tabla.  La tabla de ejemplo utiliza jQuery UI, que viene incluido en la gema <code>jquery-rails</code> que ya tenemos en el <code>Gemfile</code>.  Sin embargo los estilos de CSS que necesitamos para la tabla no vienen incuidos, pero hay otra gema <code>jquery-ui-rails</code> que s&iacute; que los trae.  Tan s&oacute;lo tendremos que incluirla en el <code>Gemfile</code> y ejecutar <code>bundle</code> de nuevo.</p>

``` /Gemfile
group :assets do
  gem 'sass-rails',   '~> 3.2.3'
  gem 'coffee-rails', '~> 3.2.1'

  # See https://github.com/sstephenson/execjs#readme for more supported runtimes
  # gem 'therubyracer', :platform => :ruby

  gem 'uglifier', '>= 1.0.3'
  gem 'jquery-datatables-rails', github: 'rweng/jquery-datatables-rails'
  gem 'jquery-ui-rails'
end
```

<p>Tenemos que a&ntilde;adir los fichero <code>jquery.ui.core</code> y <code>jquery.ui.theme</code> en los ficheros CSS de nuestra aplicaci&oacute;n, con lo que tendremos disponible el tema <em>Smoothness</em>.  Tambi&eacute;n tenemos que cambiar el fichero de CSS de DataTables por uno que haya sido dise&ntilde;ado para jQuery UI.  Resulta que viene uno en el directorio <code>src</code> llamado <code>demo_table_jui</code>, por lo que tendremos que cambiar la hoja de estilos de <code>jQuery.dataTables</code> por este otro.</p>

``` /app/assets/stylesheets/application.css
/*
 * This is a manifest file that'll automatically include all the stylesheets available in this directory
 * and any sub-directories. You're free to add application-wide styles to this file and they'll appear at
 * the top of the compiled file, but it's generally better to create a new file per style scope.
 *= require_self
 *= require jquery.ui.core
 *= require jquery.ui.theme
 *= require dataTables/src/demo_table_jui
 *= require_tree . 
*/
```

<p>Ahora tenemos que pasar la opci&oacute;n <code>bJQueryUI</code> al invocar a <code>dataTable</code>.</p>

``` /app/assets/javascripts/products.js.coffee
jQuery ->
	$('#products').dataTable
	  sPaginationType: "full_numbers"
	  bJQueryUI: true
```	  

<p>Por &uacute;ltimo a la tabla le tenemos que dar la clase <code>display</code>.</p>

``` /app/views/products/index.html.erb
<table id="products" class="display">
```

<p>Veremos que al recargar la p&aacute;gina la tabla tiene un aspecto mucho mejor.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1118/original/E340I04.png" width="800" height="549" alt="La tabla tiene un aspecto mucho mejor."/>
</div>

<h3>Actualizaci&oacute;n de los datos de la tabla desde el servidor</h3>

<p>La tabla dispone de paginaci&oacute;n, ordenaci&oacute;n y b&uacute;squedas, pero estas ocurren en el cliente.  Nuestra p&aacute;gina HTML muestra todos los productos que hay en la base de datos y DataTables escoge cu&aacute;les tiene que mostrar bas&aacute;ndose en la p&aacute;gina, ordenaci&oacute;n y t&eacute;rmino de b&uacute;squeda.  Esto funciona bien con grupos de registros peque&ntilde;os, digamos hasta 200, pero si tenemos miles de registros evidentemente no los queremos enviar todos para generar la tabla en HTML en el cliente.  En estos casos es mejor enviar s&oacute;lo los registros necesarios al cliente y que DataTable se comunique con el servidor cuando se modifican la p&aacute;gina, el t&eacute;rmino de b&uacute;squeda o la ordenaci&oacute;n.  La pag&iacute;na de <a href="http://datatables.net/usage/server-side">procesamiento en el lado del servidor</a> de la documentaci&oacute;n de DataTables nos indica los par&aacute;metros que se env&iacute;an al servidor y qu&eacute; podemos esperar en la respuesta en forma de JSON.  Tenemos que configurar nuestra aplicaci&oacute;n Rails para poder trabajar de esta forma paginando en el servidor, as&iacute; que a&ntilde;adiremos la gema <code>will_paginate</code> a nuestro <code>Gemfile</code> y ejecutaremos <code>bundle</code> de nuevo para instalarlo.</p>


``` /Gemfile
gem 'will_paginate'
```

<p>Ya no tenemos que mostrar todos los productos de nuestra plantilla porque ahora se recuperan del servidor.  As&iacute; que tendremos que definir la URL de la que se puedan ir recogiendo los productos, y la pondremos como atributo de datos en la etiqueta <code>table</code>.  Usaremos el <em>helper</em> de ruta <code>products_url</code> indicando que hay que utilizar el formato JSON.</p>

``` /app/views/products/index.html.erb
<h1>Products</h1>

<table id="products" class="display" data-source="<%= products_url(format: "json") %>">
  <thead>
    <tr>
      <th>Product Name</th>
      <th>Category</th>
      <th>Release Date</th>
      <th>Price</th>
    </tr>
  </thead>
  <tbody>
  <tbody>
</table>
```

<p>En nuestro fichero Coffeescript tendremos que a&ntilde;adir varias opciones en la llamada a <code>dataTable</code> para decirle que tiene que obtener los datos desde el servidor.</p>

``` /app/assets/javascripts/products.js.coffee
jQuery ->
	$('#products').dataTable
	  sPaginationType: "full_numbers"
	  bJQueryUI: true
	  bProcessing: true
	  bServerSide: true
	  sAjaxSource: $('#products').data('source')
```	  

<p>La opci&oacute;n <code>bServerSide</code> indica que hay que recuperar los datos del servidor, y la opci&oacute;n <code>bProcessing</code> muestra un mensaje temporalmente mientras se obtienen los datos del servidor. Por &uacute;ltimo <code>sAjaxSource</code> define la URL de la que se recuperar&aacute;n los datos,  y nosotros hemos hecho que sea la misma que el valor del atributo <code>data-source</code> de la tabla.  DataTable atacar&aacute; la acci&oacute;n <code>index</code> de <code>ProductsController</code>, en espera de una respuesta JSON.  Utilizaremos el bloque <code>respond_to</code> para enviarla.  La parte dif&iacute;cil consiste en responder con el JSON adecuado.  Una opci&oacute;n ser&iacute;a utilizar JBuilder o RABL, pero estas soluciones se pueden complicar r&aacute;pidamente porque hay mucha l&oacute;gica de por medio para generar la respuesta correcta.</p>

<p>No debemos temer crear nuestras propias clases si la estructura MVC de Rails nos limita y vemos que no encaja con lo que queremos hacer sobre todo si como resultado el c&oacute;digo queda m&aacute;s limpio.  Crearemos una clase <code>ProductsDatatable</code> para generar el JSON y haremos que reciba un contexto de la vista para que tenga acceso a los m&eacute;todos <em>helper</em>, con lo que lo hemos convertido en una especie de mini-presentador para servir  respuestas en JSON.  Crearemos la clase en un nuevo directorio llamado <code>datatables</code> debajo del directorio de la aplicaci&oacute;n.  Hay demasiado c&oacute;digo en la clase como para mostrarlo aqu&iacute;, pero el resultado final se puede ver en <a href="https://github.com/ryanb/railscasts-episodes/blob/master/episode-340/store-after/app/datatables/products_datatable.rb">Github</a>. D&eacute;mosle un repaso r&aacute;pido para ver lo m&aacute;s destacado.</p>


<p>El <code>initializer</code> recibe un contexto de vista y se lo asigna a una variable de instancia, delegando sobre &eacute;sta algunos m&eacute;todos <em>helper</em> que nos interesar&aacute; invocar m&aacute;s adelante.</p>

``` /app/datatables/products_datatable.rb
delegate :params, :h, :link_to, :number_to_currency, to: :@view

def initialize(view)
  @view = view
end
```
<p>El m&eacute;todo <code>as_json</code> es activado por la llamada a <code>render_json</code> del controlador, y devuelve todos los datos que espera DataTables, incluyendo las filas relevantes de la base de datos.  Estos datos vienen de un m&eacute;todo llamado <code>data</code> que itera sobre los productos y devuelve un <em>array</em> bidimensional que contiene la informaci&oacute;n de cada celda de la tabla.</p>


``` /app/datatables/products_datatable.rb
def as_json(options = {})
  {
    sEcho: params[:sEcho].to_i,
    iTotalRecords: Product.count,
    iTotalDisplayRecords: products.total_entries,
    aaData: data
  }
end

private
def data
  products.map do |product|
    [
      link_to(product.name, product),
      h(product.category),
      h(product.released_on.strftime("%B %e, %Y")),
      number_to_currency(product.price)
    ]
  end
end
```

<p>Los productos se recuperan con el m&eacute;todo <code>fetch_products</code>, que recupera la p&aacute;gina de datos correcta en el orden adecuado y filtrando por el t&eacute;rmino de b&uacute;squeda (si est&aacute; presente)  La consuelta en s&iacute; misma es sencilla pero podr&iacute;amos enriquecerla utilizando un motor de b&uacute;squeda de texto completo como Sphinx o Solr.</p>

``` /app/datatables/products_datatable.rb
def fetch_products
  products = Product.order("#{sort_column} #{sort_direction}")
  products = products.page(page).per_page(per_page)
  if params[:sSearch].present?
    products = products.where("name like :search or category like :search", search: "%#{params[:sSearch]}%")
  end
  products
end
```

<p>El resto de la clase se compone de m&eacute;todos que ayudan con la paginaci&oacute;n y ordenaci&oacute;n.  Ahora que tenemos esta clase podemos emplearla en nuestra acci&oacute;n del controlador.</p>

``` /app/controllers/products_controller.rb
def index
  respond_to do |format|
    format.html
    format.json { render json: ProductsDatatable.new(view_context) }
  end
end
```

<p>Tras recargar la p&aacute;gina (probablemente tengamos que reiniciar primero el servidor) veremos que todo funciona igual que antes.  Seguimos teniendo la misma funcionalidad de paginaci&oacute;n, ordenaci&oacute;n y b&uacute;squedas pero los datos ahora los env&iacute;a la aplicaci&oacute;n Rails.</p>

<p>Con esto finaliza nuestro episodio dedicado a DataTables, que requiere cierto esfuerzo para configurarlo en el lado del servidor pero el resultado final merece la pena.  Aquellos que est&eacute;n interesados en una soluci&oacute;n alternativa escrita desde cero pueden consultar el <a href="http://railscasts.com/episodes/240-search-sort-paginate-with-ajax">episodio 240</a>.</p>
