<p>Supongamos que un cliente nos pide que construyamos un sitio web para una tienda de pianos.  La p&aacute;gina se llamar&aacute; Piano Plus y tendr&aacute; informaci&oacute;n acerca de la tienda, as&iacute; como una p&aacute;gina donde los usuarios puedan ver las existencias de pianos y otra que muestre la ubicaci&oacute;n f&iacute;sica de la tienda.  No hay mucha interacci&oacute;n de usuario en el sitio, pero a los due&ntilde;os de la tienda les gustar&iacute;a poder editar el contenido de cada p&aacute;gina.  Se trata de un caso perfecto de uso de un sistema de gesti&oacute;n de contenidos (CMS), por lo que en este episodio vamos a construir el sitio usando  <a href="http://refinerycms.com/">Refinery CMS</a>, que es un excelente CMS  basado en <em>engines</em> de Rails, lo que hace que sea muy modular.  Gracias a la forma en la que est&aacute; escrito Refinery es muy f&aacute;cil crear una nueva aplicaci&oacute;n Rails o a&ntilde;adirlo sobre una que ya exista.</p>

<h3>Instalaci&oacute;n de Refinery</h3>

<p>Refinery depende de <a href="http://www.imagemagick.org/script/index.php">ImageMagick</a> por lo que tendremos que instalarlo antes.  En OS X la forma m&aacute;s sencilla de instalarlo es mediante Homebrew, gracias al cual s&oacute;lo tendremos que lanzar la siguiente orden:</p>


``` terminal
$ brew install imagemagick
```

<p>Ya podemos instalar la gema Refinery.</p>


``` terminal
$ gem install refinerycms
```

<p>La gema tiene varias dependencias que tardar&aacute;n un poco en instalarse.  Tras hacerlo podemos crear una nueva aplicaci&oacute;n Refinery lanzando la orden <code>refinerycms</code> y pasando el nombre de la aplicaci&oacute;n.</p>


``` terminal
$ refinerycms piano_plus
```

<p>Esto generar&aacute; una aplicaci&oacute;n Rails completa, le a&ntilde;adir&aacute; Refinery, y ejecutar&aacute; las migraciones necesarias.  Al acabar tendremos instrucciones con lo que tenemos que hacer a continuaci&oacute;n, que es cambiarnos al directorio de la aplicaci&oacute;n y arrancar el servidor.</p>


``` terminal
$ cd piano_plus/
$ rails s
```

<h3>En marcha con Refinery</h3>

<p>Ya podemos cargar nuestra aplicaci&oacute;n con el navegador.  La primera vez que lo hagamos iremos a un formulario de registro porque todav&iacute;a no existen usuarios dados de alta.  Con este formulario crearemos un usuario llamado <code>admin</code>.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1063/original/E332I01.png" width="800" height="569" alt="La primera vez que lo usamos tenemos que registrar un nuevo usuario en Refinery."/>
</div>

<p>Tras el registro iremos al cuadro de mandos de Refinery, que nos muestra la &uacute;ltima actividad y tiene enlaces que permiten hacer diferentes tareas.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1064/original/E332I02.png" width="1015" height="569" alt="Después de registrarnos veremos el cuadro de mandos de Refinery."/>
</div>

<p>Hay otras pesta&ntilde;as en la parte superior, que nos llevan a p&aacute;ginas donde podremos gestionar otras partes de nuestro CMS como por ejemplo los usuarios y las p&aacute;ginas p&uacute;blicas.  Estas pesta&ntilde;as pueden reordenarse si queremos.  Veamos en primer lugar la pesta&ntilde;a de p&aacute;ginas porque es en la que estaremos la mayor parte del tiempo trabajando.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1065/original/E332I03.png" width="1015" height="397" alt="Con las pestaña de páginas podemos añadir, eliminar y edtar páginas."/>
</div>

<p>Por defecto Refinery crear&aacute; varias p&aacute;ginas para nosotros: una portada, una p&aacute;gina &quot;Acerca de&quot; y otra que se mostrar&aacute; cuando aparezca un error 404.  Podemos editar la p&aacute;gina haciendo clic en el icono de edici&oacute;n, esto nos lleva a un formulario donde podemos editar el contenido de la p&aacute;gina.  Refinery proporciona un editor de texto enriquecido con el que podemos modificar el texto de cada secci&oacute;n.  Tambi&eacute;n existe una secci&oacute;n avanzada en el fondo de la p&aacute;gina que nos permite cambiar varios aspectos de la p&aacute;gina que estamos editando.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1066/original/E332I04.png" width="1015" height="579" alt="Refinery viene con un editor de texto enriquecido que permite añadir contenido a una página."/>
</div>

<p>Ech&eacute;mosle un vistazo a la parte p&uacute;blica de nuestra web, lo que podemos hacer haciendo clic en el bot&oacute;n naranja de la esquina superior izquierda.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1067/original/E332I05.png" width="1015" height="432" alt="Por defecto las páginas vienen sin estilos."/>
</div>

<p>Podemos ver el contenido de la p&aacute;gina pero vemos que viene sin estilos.  Esto es bueno porque nos otorga control completo sobre el aspecto de la p&aacute;gina que ve el visitante.</p>

<h3>Modificando la configuraci&oacute;n y hojas de estilo</h3>

<p>A continuaci&oacute;n vamos a a&ntilde;adir CSS a nuestra aplicaci&oacute;n y vamos a modificar algunos valores de configuraci&oacute;n, como por el ejemplo el nombre de la compa&ntilde;&iacute;a.  La estructura de una instalaci&oacute;n de Refinery deber&iacute;a resultarnos familiar porque es, en esencia, una aplicaci&oacute;n Rails con ciertos extras.  Si examinamos el fichero de rutas veremos que monta el <em>engine</em> de Refinery en la ruta ra&iacute;z.</p>


``` /config/routes.rb
# This line mounts Refinery's routes at the root of your application.
  # This means, any requests to the root URL of your application will go to Refinery::PagesController#home.
  # If you would like to change where this extension is mounted, simply change the :at option to something different.
  #
  # We ask that you don't use the :as option here, as Refinery relies on it being the default of "refinery"
  mount Refinery::Core::Engine, :at => '/'
```  
  
<p>Para configurar Refinery tenemos que buscar en el directorio <code>/config/initializers/refinery</code> donde se encuentran varios ficheros en los que podemos modificar algunos valores de configuraci&oacute;n.  Cada opci&oacute;n se encuentra profusamente documentada en los comentarios, por lo que merece la pena leerlos con detalle para tener una idea de qu&eacute; es lo que podemos configurar.  Queremos cambiar el nombre del sitio web, y esta opci&oacute;n de configuraci&oacute;n est&aacute; definida en el fichero <code>core.rb</code>, as&iacute; que tendremos que descomentar la opci&oacute;n y cambiarla.</p>


``` /app/initializers/refinery/core.rb
# Site name
config.site_name = "Piano Plus"
```

<p>Como este valor de configuraci&oacute;n se encuentra un <code>initializer</code> tendremos que reiniciar el servidor para que surta efecto.  Tras hacerlo podremos recargar la p&aacute;gina para ver c&oacute;mo ha cambiado el nombre en la cabecera y el pi&eacute; de la p&aacute;gina.</p>

<p>Lo siguiente que haremos ser&aacute; a&ntilde;adir estilos a la p&aacute;gina.  Se encuentra estructurada con un encabezado que contiene una imagen, una secci&oacute;n <code>page</code> que contiene el cuerpo de texto de la p&aacute;gina y una secci&oacute;n <code>side_body</code> que contiene la barra lateral.  Nuestra aplicaci&oacute;n tiene un fichero llamado <code>application.css</code> en el directorio <code> /app/assets/stylesheets</code> que se comporta de la misma manera que lo har&iacute;a en una aplicaci&oacute;n Rails normal.  Crearemos un fichero llamado <code>layout.css.scss</code> y pondremos en &eacute;l nuestros estilos.  Al recargar la p&aacute;gina veremos que tiene mucho mejor aspecto.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1068/original/E332I07.png" width="1015" height="432" alt="Tras añadir estilos CSS la página tiene mejor aspecto"/>
</div>

<p>Lo siguiente ser&aacute; editar la portada del sitio.  A&ntilde;adiremos un encabezado con un elemento <code>h2</code> y otro p&aacute;rrafo con un par de piezas cortas de texto, que luego se convertir&aacute;n en enlaces a otras p&aacute;ginas interiores que de momento no existen a&uacute;n.  Utilizaremos el estilo del men&uacute; para configurar el tama&ntilde;o de tipograf&iacute;a de este p&aacute;rrafo.  Tambi&eacute;n queremos que aparezca una imagen en la p&aacute;gina.  Esta imagen se encuentra en nuestro ordenador y con Refinery podremos subirla y reescalarla.  Escogeremos el tama&ntilde;o <code>medium</code> de reescalado y flotaremos la imagen a la izquierda y la pondremos en la parte superior de la p&aacute;gina arrastr&aacute;ndola.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1069/original/E332I08.png" width="1015" height="717" alt="Cómo añadir una imagen a la página."/>
</div>

<p>Si en alg&uacute;n momento queremos comprobar el c&oacute;digo HTML que se est&aacute; generando podemos hacer clic en el bot&oacute;n HTML y ver el c&oacute;digo fuente en bruto.  Tambi&eacute;n podemos editarlo aqu&iacute;, por si el editori visual no genera exactamente el c&oacute;digo que deseamos.  Como en esta p&aacute;gina no queremos que aparezca nada en la barra lateral simplemente iremos a la secci&oacute;n <code>Side Body</code> y eliminaremos el texto que aparece all&iacute;.  Tras hacerlo simplemente guardaremos la p&aacute;gina y veremos c&oacute;mo queda en nuestro sitio.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1070/original/E332I09.png" width="1015" height="515" alt="La portada aparece con su imagen y tiene mucho mejor aspecto."/>
</div>

<p>La p&aacute;gina ya empieza a tener mejor aspecto, si bien hemos tenido que hacer algunos ajustes en la CSS.  Ya est&aacute; casi completa, y tan s&oacute;lo nos queda por a&ntilde;adir una secci&oacute;n con un r&oacute;tulo rojo en la parte superior pero antes de hacerlo vamos a crear la p&aacute;gina con la ubicaci&oacute;n f&iacute;sica de la tienda.  Esto tambi&eacute;n lo haremos en la interfaz de administraci&oacute;n de la tienda.  Primero borraremos la p&aacute;gina &ldquo;About&rdquo; porque no la vamos a tener que utilizar, y crearemos una que se llame &ldquo;Store Location&rdquo;. En esta p&aacute;gina queremos mostrar un mapa, por lo que usaremos la vista en HTML del editor e introduciremos el siguiente fragmento que visualizar&aacute; un mapa de Google en la p&aacute;gina.</p> 

``` html
<h2>Store Location</h2>
<iframe width="425" height="350" frameborder="0" scrolling="no" marginheight="0" marginwidth="0" src="http://maps.google.com/maps?f=q&amp;source=s_q&amp;hl=en&amp;geocode=&amp;q=109+West+57th+Street,+New+York,+NY&amp;aq=&amp;sll=40.760254,-73.97747&amp;sspn=0.009962,0.013025&amp;gl=us&amo;ie=UTF8;&amp;hq=&amp;hnear=109+W+57th+St,+New+York,+10019&amp;t=m;&amp;spm=0011376,0.018238&amp;z=15;&amp;iwloc=A;&amp;output=embed"></iframe>
```
<p>A&ntilde;adamos tambi&eacute;n algo de texto a la barra lateral de la pagina antes de guardarla.  Queremos que en nuestra p&aacute;gina principal aparezca un enlace a esta p&aacute;gina, por lo que iremos a la p&aacute;gina de la portada y en su editor escogeremos el texto &ldquo;Store Location&rdquo; haremos clic en el bot&oacute;n &ldquo;Add Link&rdquo; y a&ntilde;adiremos el enlace a nuestra nueva p&aacute;gina.  Ya tenemos dicha p&aacute;gina enlazada desde la portada.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1071/original/E332I10.png" width="1015" height="670" alt="La página de localización que incluye el mapa embebido."/>
</div>

<h3>Secciones personalizadas</h3>

<p>A continuaci&oacute;n vamos a a&ntilde;adir un r&oacute;tulo rojo en la parte superior de la portada, en el que pondremos algo de texto y una imagen.  Queremos que est&eacute; en una secci&oacute;n separada, pero de momento s&oacute;lo tenemos las dos secciones &ldquo;Body&rdquo; y &ldquo;Side Body&rdquo;.  Podr&iacute;amos a&ntilde;adir este r&oacute;tulo a la barra lateral pero no es donde realmente tiene que ir, por lo que vamos a a&ntilde;adir una nueva secci&oacute;n.  Refinery tiene una opci&oacute;n de configuraci&oacute;n que determina si se pueden a&ntilde;adir nuevas secciones o no, y su valor por defecto es <code>false</code> por lo que tendremos que cambiarlo.</p>

``` /app/initializers/refinery/pages.rb
# Configure whether to allow adding new page parts
# config.new_page_parts = true
```

<p>Tendremos que reiniciar otra vez el servidor porque hemos cambiado un inicializador.  Tras hacerlo podremos visitar la p&aacute;gina de edici&oacute;n de la portada (o cualquier otra) y veremos nuevos botones que nos servir&aacute;n para a&ntilde;adir o eliminar secciones, as&iacute; que los usaremos para eliminar la secci&oacute;n de barra lateral porque no la vamos a necesitar en esta p&aacute;gina y a&ntilde;adiremos una nueva secci&oacute;n a la que llamaremos &ldquo;Banner&rdquo;.  Tambi&eacute;n tendremos que utilizar el bot&oacute;n para reordenar para asegurarnos de que la secci&oacute;n  &ldquo;Banner&rdquo; aparece despu&eacute;s de la secci&oacute;n &ldquo;Body&rdquo; . Si estamos usando una versi&oacute;n de Refinery anterior a la 2.0.2 puede ser que veamos un error al hacerlo, en cuyo caso tendremos que a&ntilde;adir manualmente una nueva p&aacute;gina desde la consola:</p>

``` console
>> Refinery::Page.find(1).parts.create! "Banner"
```

<p>La p&aacute;gina ya tiene una secci&oacute;n llamada &ldquo;Banner&rdquo; en la que ya podemos a&ntilde;adir el contenido deseado tras lo que guardaremos la p&aacute;gina..</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1072/original/E332I11.png" width="1015" height="558" alt="Añadiendo contenido a nuestra sección del rótulo."/>
</div>

<p>Ya hemos a&ntilde;adido los estilos para esta secci&oacute;n por lo que cuando cambiemos a la portada veremos que ya aparece el r&oacute;tulo con los estilos correctos.  Para ver la p&aacute;gina sin ver la barra de administraci&oacute;n de Refinery tendremos que cerrar la sesi&oacute;n.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1073/original/E332I12.png" width="1015" height="648" alt="La página ya aparece con el rótulo que queremos."/>
</div>

<p>Podemos darnos un paseo por el sitio igual que har&iacute;an nuestros visitantes.  Para volver a refinery tan s&oacute;lo tenemos que a&ntilde;adir <code>/refinery</code> a la  URL e iremos a la p&aacute;gina de inicio de sesi&oacute;n.</p>

<p>Todav&iacute;a nos queda por a&ntilde;adir al sitio una nueva secci&oacute;n: la p&aacute;gina con la lista de pianos, que no veremos en este episodio.  Si bien podr&iacute;amos hacer una p&aacute;gina est&aacute;tica que mostrase todos los pianos del cat&aacute;logo, ser&iacute;a mejor almacenar esta informaci&oacute;n en la base de datos por lo que tendremos que extender Refinery creando nuestro propio <em>engine</em>.  Lo veremos en el pr&oacute;ximo episodio de pago de la semana que viene.</p>
