<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x433;&#x435;&#x43E;&#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x432; Rails &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438;, &#x442;&#x43E; <a href="http://rubygeocoder.com/">Geocoder &#x433;&#x435;&#x43C;</a> &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x443;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x434;&#x430;&#x447;&#x443; &#x432; &#x440;&#x430;&#x437;&#x44B;. &#x41E;&#x43D; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43C;&#x435;&#x441;&#x442; &#x432; &#x43A;&#x43E;&#x43E;&#x440;&#x434;&#x438;&#x43D;&#x430;&#x442;&#x44B; &#x438; &#x43D;&#x430;&#x43E;&#x431;&#x43E;&#x440;&#x43E;&#x442;, &#x438; &#x434;&#x430;&#x436;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; IP &#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x43F;&#x43E;&#x447;&#x442;&#x43E;&#x432;&#x44B;&#x439;. &#x41E;&#x43D; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x43F;&#x43E;&#x431;&#x43B;&#x438;&#x437;&#x43E;&#x441;&#x442;&#x438; &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x440;&#x430;&#x441;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; &#x438; &#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x438; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x435;&#x449;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x445; &#x444;&#x438;&#x447;.</p>

<p>&#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x435; &#x43C;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; Siteseer, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x434;&#x430;&#x441;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43E; &#x442;&#x443;&#x440;&#x438;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x43C;&#x435;&#x441;&#x442;&#x430;&#x445;. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43C; <code>Location</code> &#x441;&#x43A;&#x430;&#x444;&#x43E;&#x43B;&#x434; &#x441; &#x43F;&#x43E;&#x43B;&#x44F;&#x43C;&#x438; &#x43F;&#x43E;&#x434; &#x430;&#x434;&#x440;&#x435;&#x441;, &#x448;&#x438;&#x440;&#x43E;&#x442;&#x443; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x443;.</p>

<pre class="terminal">$ rails g nifty:scaffold location address:string latitude:float longitude:float</pre>
  
<p>&#x41F;&#x43E;&#x43B;&#x44F; <code>latitude</code>(&#x448;&#x438;&#x440;&#x43E;&#x442;&#x430;) &#x438; <code>longitude</code>(&#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x430;) &#x432;&#x430;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; Geocoder &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x445; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43E;&#x440;&#x434;&#x438;&#x43D;&#x430;&#x442; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x445;&#x43E;&#x442;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x44B;. &#x41E;&#x431;&#x430; &#x43F;&#x43E;&#x43B;&#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x431;&#x44B;&#x442;&#x44C; <code>floats</code> &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43E;&#x440;&#x434;&#x438;&#x43D;&#x430;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x441; &#x43F;&#x43B;&#x430;&#x432;&#x430;&#x44E;&#x449;&#x435;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x43E;&#x439;. &#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438; &#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x43C; &#x43D;&#x43E;&#x432;&#x443;&#x44E; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x443; &#x434;&#x43B;&#x44F; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;.</p>

<pre class="terminal">$ rake db:migrate</pre>

<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E;, &#x43D;&#x430; &#x440;&#x443;&#x43A;&#x430;&#x445; &#x438;&#x43C;&#x435;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44B;&#x439; &#x441;&#x43A;&#x430;&#x444;&#x43E;&#x43B;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x448;&#x438;&#x440;&#x43E;&#x442;&#x443; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x443; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432;&#x431;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x440;&#x443;&#x447;&#x43A;&#x430;&#x43C;&#x438;. &#x427;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x430;&#x440;&#x443; &#x43C;&#x438;&#x43D;&#x443;&#x442; &#x43C;&#x44B; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x43D;&#x430;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442; &#x437;&#x430;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; Geocoder&#x27;&#x43E;&#x43C;.</p>

<div class="imageWrapper">
  <img src="/system/photos/698/original/E273I01.png" width="813" height="438" alt="The scaffold-generated new location page."/>
</div>
 
<h3>&#x423;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x430; &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; Geocoder</h3>

<p>&#x423;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x430; Geocoder &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E;. &#x421;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43C;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x43D;&#x430; &#x433;&#x435;&#x43C; &#x432; <code>Gemfile</code>, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; <code>bundle</code> &#x434;&#x43B;&#x44F; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x433;&#x435;&#x43C;&#x430;.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">source &#x27;http://rubygems.org&#x27;

gem &#x27;rails&#x27;, &#x27;3.0.9&#x27;
gem &#x27;sqlite3&#x27;
gem &#x27;nifty-generators&#x27;

gem &#x27;geocoder&#x27;</pre>

<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C;, &#x432;&#x43D;&#x435;&#x441;&#x435;&#x43C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; <code>Location</code> &#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>geocoded_by</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x430;&#x442;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;, &#x43F;&#x43E; &#x447;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x43C; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E;&#x431;&#x44B; Geocoder &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;, &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; - &#x43F;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x443; (<code>address</code>).</p>

<p class="codeFilePath">/app/models/location.rb</p>
<pre class="ruby">class Location &lt; ActiveRecord::Base
  attr_accessible :address, :latitude, :longitude
  geocoded_by :address
end</pre>

<p>&#x415;&#x441;&#x43B;&#x438; &#x43D;&#x430;&#x448; &#x430;&#x434;&#x440;&#x435;&#x441; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x43A;&#x443;&#x441;&#x43A;&#x430;&#x43C;&#x438; &#x432; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x43B;&#x44F;&#x445;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441;.</p>

<p>&#x41D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>geocode</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x433;&#x435;&#x43E;&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43B;&#x438; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x446;&#x435;&#x43B;&#x435;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43B;&#x431;&#x44D;&#x43A; <code>after_validation</code>.</p>

<p class="codeFilePath">/app/models/location.rb</p>
<pre class="ruby">class Location &lt; ActiveRecord::Base
  attr_accessible :address, :latitude, :longitude
  geocoded_by :address
  after_validation :geocode
end</pre>

<p>&#x413;&#x435;&#x43E;&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x438;&#x439; API (&#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x44D;&#x442;&#x43E; <a href="http://code.google.com/apis/maps/index.html">Google Maps API</a>), &#x430; &#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;, &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x442;&#x443;&#x434;&#x430; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x44B;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443;, &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x435;&#x449;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x442; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x432; &#x444;&#x43E;&#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;. &#x42D;&#x442;&#x43E;&#x433;&#x43E; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43C;&#x44B; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C;, &#x43D;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x44D;&#x442;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x435; Resque [<a href="http://railscasts.com/episodes/271-resque">&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C;</a>, <a href="http://asciicasts.com/episodes/271-resque">&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C;</a>].</p>

<p>&#x41D;&#x443; &#x447;&#x442;&#x43E; &#x436;&#x435;, &#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x435;&#x43C; Geocoder. &#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &#x43D;&#x430;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;. &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x432;&#x432;&#x43E;&#x434;&#x438;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x441;&#x43A;&#x430;&#x436;&#x435;&#x43C; &ldquo;St Pancras Station, London&rdquo;, &#x431;&#x435;&#x437; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x448;&#x438;&#x440;&#x43E;&#x442;&#x44B; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x44B;, Geocoder &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442; &#x44D;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x438;&#x439; API &#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x432; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;.</p>

<div class="imageWrapper">
  <img src="/system/photos/699/original/E273I02.png" width="800" height="372" alt="The new location showing the data from Geocoder."/>
</div>

<p>&#x41E;&#x431;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43A; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x435;&#x43C;&#x443; API &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x438; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x44D;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438; &#x441;&#x43C;&#x435;&#x43D;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x43E;&#x43B;&#x435; <code>address</code> &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;. &#x421;&#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x43A;&#x43E;&#x43B;&#x431;&#x44D;&#x43A;&#x435; <code>after_validation</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x434;&#x43E;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x43D;&#x438;&#x435;.</p>

<p class="codeFilePath">/app/models/location.rb</p>
<pre class="ruby">class Location &lt; ActiveRecord::Base
  attr_accessible :address, :latitude, :longitude
  geocoded_by :address
  after_validation :geocode, :if =&gt; :address_changed?
end</pre>

<p>&#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43C;&#x44B; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x434;&#x438;&#x43C; &#x438; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x43C; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x430;&#x434;&#x440;&#x435;&#x441; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x441;&#x44F; &#x438; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43A; API.</p>

<p>&#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; <code>reverse_geocoded_by</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442; &#x448;&#x438;&#x440;&#x43E;&#x442;&#x443; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x443; &#x432; &#x430;&#x434;&#x440;&#x435;&#x441;. &#x420;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43E;&#x43D; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>geocoded_by</code>, &#x43D;&#x43E; &#x43C;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x432; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438;.</p>

<h3>&#x41C;&#x435;&#x441;&#x442;&#x430; &#x43F;&#x43E;&#x431;&#x43B;&#x438;&#x437;&#x43E;&#x441;&#x442;&#x438;</h3>

<p>&#x411;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x437;&#x434;&#x43E;&#x440;&#x43E;&#x432;&#x43E;, &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x430; &#x43A;&#x430;&#x43A;&#x43E;&#x433;&#x43E;-&#x442;&#x43E; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x435;&#x449;&#x435; &#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x435;&#x441;&#x442; &#x43F;&#x43E;&#x431;&#x43B;&#x438;&#x437;&#x43E;&#x441;&#x442;&#x438;. &#x412; &#x43D;&#x430;&#x448;&#x435;&#x439; &#x431;&#x430;&#x437;&#x435; &#x443;&#x436;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x441;&#x442;, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x44D;&#x442;&#x443; &#x444;&#x438;&#x447;&#x443; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;.</p>

<p>&#x41C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438;&#x442;&#x44C; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x432;&#x441;&#x435;&#x445; &#x43C;&#x435;&#x441;&#x442; &#x43D;&#x430; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438;, &#x438; &#x44D;&#x442;&#x43E; &#x43B;&#x435;&#x433;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>nearbys</code> &#x433;&#x435;&#x43C;&#x430; Geocoder. &#x41F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;, &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x442;&#x44F;&#x442;&#x441;&#x44F; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x432; &#x440;&#x430;&#x434;&#x438;&#x443;&#x441;&#x435; 20 &#x43C;&#x438;&#x43B;&#x44C; (~32,2&#x43A;&#x43C;), &#x43D;&#x43E; &#x43C;&#x44B; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x43C;&#x441;&#x44F; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x44C;&#x44E; (~16,1&#x43A;&#x43C;). &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x44B;&#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A;, &#x43C;&#x44B; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x441;&#x44F; &#x43F;&#x43E; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;&#x443; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44E; &#x438;&#x437; <code>@location.nearbys</code> &#x438; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x43C; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443; &#x43D;&#x430; &#x43D;&#x435;&#x433;&#x43E; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x440;&#x430;&#x441;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x432; &#x43C;&#x438;&#x43B;&#x44F;&#x445;.</p>

<p class="codeFilePath">/app/views/locations/show.html.erb</p>
<pre class="ruby">&lt;ul&gt;
&lt;% for location in @location.nearbys(10) %&gt;
  &lt;li&gt;&lt;%= link_to location.address, location %&gt; &crarr;
    (&lt;%= location.distance.round(2) %&gt; miles)&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;&lt;% title &quot;Location&quot; %&gt;

&lt;p&gt;
  &lt;strong&gt;Address:&lt;/strong&gt;
  &lt;%= @location.address %&gt;
&lt;/p&gt;
&lt;p&gt;
  &lt;strong&gt;Latitude:&lt;/strong&gt;
  &lt;%= @location.latitude %&gt;
&lt;/p&gt;
&lt;p&gt;
  &lt;strong&gt;Longitude:&lt;/strong&gt;
  &lt;%= @location.longitude %&gt;
&lt;/p&gt;

&lt;h3&gt;Nearby Locations&lt;/h3&gt;
&lt;ul&gt;
&lt;% for location in @location.nearbys(10) %&gt;
  &lt;li&gt;&lt;%= link_to location.address, location %&gt; &crarr;
    (&lt;%= location.distance.round(2) %&gt; miles)&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;

&lt;p&gt;
  &lt;%= link_to &quot;Edit&quot;, edit_location_path(@location) %&gt; |
  &lt;%= link_to &quot;Destroy&quot;, @location, :confirm =&gt; &crarr;
    &#x27;Are you sure?&#x27;, :method =&gt; :delete %&gt; |
  &lt;%= link_to &quot;View All&quot;, locations_path %&gt;
&lt;/p&gt;</pre>

<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x43C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C; &#x435;&#x449;&#x435; &#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x435;&#x441;&#x442; &#x43F;&#x43E;&#x431;&#x43B;&#x438;&#x437;&#x43E;&#x441;&#x442;&#x438;, &#x43D;&#x43E; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x41B;&#x438;&#x432;&#x435;&#x440;&#x43F;&#x443;&#x43B;&#x435;, &#x437;&#x430; 200 &#x43C;&#x438;&#x43B;&#x44C; &#x43E;&#x442; &#x413;&#x440;&#x438;&#x43D;&#x432;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x43E;&#x431;&#x441;&#x435;&#x440;&#x432;&#x430;&#x442;&#x43E;&#x440;&#x438;&#x438;, &#x432; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x435; &#x43D;&#x435; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438;&#x442;&#x441;&#x44F;.</p>

<div class="imageWrapper">
  <img src="/system/photos/700/original/E273I03.png" width="800" height="438" alt="The location page showing nearby locations."/>
</div>

<p>&#x421;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x448;&#x430;&#x433;&#x43E;&#x43C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x432; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x433;&#x43E;&#x440;&#x43E;&#x434;&#x435;. &#x421;&#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x43D;&#x43E;&#x432;&#x443;&#x44E; &#x444;&#x43E;&#x440;&#x43C;&#x443; &#x43D;&#x430;&#x432;&#x435;&#x440;&#x445;&#x443; &#x432;&#x438;&#x434;&#x430; index.</p>

<p class="codeFilePath">/app/views/locations/index.html.erb</p>
<pre class="ruby">&lt;% title &quot;Locations&quot; %&gt;

&lt;%= form_tag locations_path, :method =&gt; :get do %&gt;
  &lt;p&gt;
    &lt;%= text_field_tag :search, params[:search] %&gt;
    &lt;%= submit_tag &quot;Search Near&quot;, :name =&gt; nil %&gt;
&lt;% end %&gt;
&lt;!-- rest of page --&gt;</pre>

<p>&#x424;&#x43E;&#x440;&#x43C;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; GET &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; <code>index</code> &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; <code>search</code>. &#x412; <code>LocationsController</code> <code>index</code> &#x44D;&#x43A;&#x448;&#x435;&#x43D;&#x435; &#x43C;&#x44B; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x438; &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D; &#x437;&#x430;&#x434;&#x430;&#x43D;, &#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x43F;&#x43E;&#x438;&#x441;&#x43A; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x438;&#x445; &#x43C;&#x435;&#x441;&#x442;&#x435;&#x447;&#x435;&#x43A;.</p>

<p class="codeFilePath">/app/controllers/locations_controller.rb</p>
<pre class="ruby">def index
  if params[:search].present?
    @locations = Location.near(params[:search], 50, &crarr;
      :order =&gt; :distance)
  else
    @locations = Location.all
  end
end</pre>

<p>&#x415;&#x441;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x438; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;&#x442;&#x44C; &ldquo;Manchester&rdquo;, &#x442;&#x43E; &#x43C;&#x44B; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x432; &#x41B;&#x438;&#x432;&#x435;&#x440;&#x43F;&#x443;&#x43B;&#x435; &#x430;&#x436; &#x437;&#x430; 30 &#x43C;&#x438;&#x43B;&#x44C; &#x43E;&#x442;&#x442;&#x443;&#x434;&#x430;.</p>

<div class="imageWrapper">
  <img src="/system/photos/701/original/E273I04.png" width="800" height="341" alt="The results of a city search."/>
</div>

<p>&#x42D;&#x442;&#x43E; &#x432;&#x441;&#x451;, &#x447;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x43F;&#x43E;&#x431;&#x43B;&#x438;&#x437;&#x43E;&#x441;&#x442;&#x438; &#x441; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x433;&#x43E;&#x440;&#x43E;&#x434;&#x43E;&#x43C;.</p>

<h3>&#x414;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44F; &#x43A;&#x430;&#x440;&#x442;&#x44B;</h3>

<p>&#x422;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x43C; &#x441; &#x433;&#x435;&#x43E;&#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x43E; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445;, &#x442;&#x43E; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E; &#x435;&#x449;&#x435; &#x438; &#x43A;&#x430;&#x440;&#x442;&#x443; &#x434;&#x43B;&#x44F; &#x438;&#x445; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;. &#x41C;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x43E;&#x434;&#x43D;&#x443; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;, &#x433;&#x434;&#x435; &#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x44D;&#x442;&#x43E; &#x43C;&#x435;&#x441;&#x442;&#x43E;. Google Maps API &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x432;, &#x43A;&#x430;&#x43A; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43A;&#x430;&#x440;&#x442;&#x443; &#x43D;&#x430; &#x441;&#x430;&#x439;&#x442;, &#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x442;&#x44B; &#x43C;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <a href="http://code.google.com/apis/maps/documentation/staticmaps/">Static Maps API</a>. &#x41A;&#x430;&#x440;&#x442;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x443; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432; url &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; &#x448;&#x438;&#x440;&#x43E;&#x442;&#x443; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x443;, &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;, &#x43F;&#x440;&#x438;&#x431;&#x43B;&#x438;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x438; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x435;&#x435;. &#x414;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x43A;&#x430;&#x440;&#x442;&#x443; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43D;&#x430;&#x434; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x438;&#x445; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x432;.</p>

<p class="codeFilePath">/app/views/locations/show.html.erb</p>
<pre class="ruby">&lt;%= image_tag &quot;http://maps.google.com/maps/api/staticmap?size=450x300&amp;sensor=false&amp;zoom=16&amp;markers=#{@location.latitude}%2C#{@location.longitude}&quot; %&gt;</pre>

<p>&#x41A;&#x430;&#x43A; &#x43C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;, &#x437;&#x430; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x448;&#x438;&#x440;&#x43E;&#x442;&#x44B; &#x438; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x43C; &#x438;&#x437; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x430; <code>@location</code>. &#x415;&#x441;&#x43B;&#x438; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x435;&#x43C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x442;&#x43E; &#x443;&#x432;&#x438;&#x434;&#x438;&#x43C; &#x435;&#x433;&#x43E; &#x438; &#x43D;&#x430; &#x43A;&#x430;&#x440;&#x442;&#x435;.</p>

<div class="imageWrapper">
  <img src="/system/photos/702/original/E273I05.png" width="828" height="753" alt="The location showing the map."/>
</div>

<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F; &#x447;&#x435;&#x433;&#x43E;-&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;&#x433;&#x43E;, &#x447;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x430;&#x44F; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x430;, &#x442;&#x43E; &#x440;&#x430;&#x437;&#x431;&#x435;&#x440;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x441; <a href="https://github.com/apneadiving/Google-Maps-for-Rails">Google Maps For Rails &#x433;&#x435;&#x43C;&#x43E;&#x43C;</a>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x443;&#x43F;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x441; &#x434;&#x436;&#x430;&#x432;&#x430;&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x432;&#x44B;&#x43C; JavaScript API. &#x42D;&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x443;&#x44E; &#x43A;&#x430;&#x440;&#x442;&#x443; &#x432; &#x432;&#x430;&#x448;&#x435; rails &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;.</p>
