<p><a href="http://www.cukes.info/">Cucumber</a> &#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5BF9;Ruby On Rails&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x884C;&#x4E3A;&#x9A71;&#x52A8;&#x5F00;&#x53D1;(BDD)&#x7684;&#x9AD8;&#x7EA7;&#x6D4B;&#x8BD5;&#x6846;&#x67B6;&#x3002;Cucumber&#x7684;&#x72EC;&#x6709;&#x7279;&#x70B9;&#x662F;&#x4ED6;&#x4F7F;&#x7528;&#x82F1;&#x8BED;(&#x6216;&#x8005;&#x5176;&#x4ED6;&#x652F;&#x6301;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5305;&#x62EC;&#x6C49;&#x8BED;)&#x6765;&#x5B9A;&#x4E49;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;,&#x5728;&#x8FD9;&#x4E00;&#x96C6;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x521B;&#x5EFA;Rails &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;Cucumber&#x6765;&#x5B9A;&#x4E49;&#x5176;&#x884C;&#x4E3A;&#x3002;</p>

<h3>&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h3>

<p>&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x6700;&#x7ECF;&#x5178;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6700;&#x901A;&#x5E38;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;Rails&#x9879;&#x76EE;&#x3002;</p>
``` terminal
rails blog
```
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7528;&#x5230;&#x7684;&#x8FD9;&#x4E9B;gems&#x6765;&#x521B;&#x5EFA;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x3002; &#x5728; <code>/config/environments/test.rb</code> &#x7684;&#x5E95;&#x90E8;&#x52A0;&#x5165;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;:</p>

``` ruby
config.gem "rspec", :lib => false, :version => ">=1.2.2"  
config.gem "rspec-rails", :lib => false, :version => ">=1.2.2"  
config.gem "webrat", :lib => false, :version => ">=0.4.3"  
config.gem "cucumber", :lib => false, :version => ">=0.2.2"
```
<p>&#x9664;&#x4E86;Cucumber&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981; <a href="http://rspec.info/">Rspec</a> &#x548C; <a href="http://github.com/brynary/webrat/tree/master">Webrat</a>.&#x4ED6;&#x4EEC;&#x90FD;&#x4E0D;&#x662F;&#x8FD0;&#x884C;Cucumber&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x5F53;&#x4F60;&#x719F;&#x6089;&#x4F7F;&#x7528;Cucumber&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6765;&#x4EE3;&#x66FF;Rspec&#x6216;&#x7528;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6D4B;&#x8BD5;&#x6846;&#x67B6;&#x6765;&#x4EE3;&#x66FF;Webrat.</p>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5DF2;&#x7ECF;&#x6307;&#x5B9A;&#x4E86;&#x9700;&#x8981;&#x7684;gems &#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD0;&#x884C;rake&#x547D;&#x4EE4;&#x6765;&#x5B89;&#x88C5;&#x4ED6;&#x4EEC;</p>

``` terminal
sudo rake gems:install RAILS_ENV=test
```
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x6CA1;&#x5B89;&#x88C5;&#x8FC7;&#x8FD9;&#x4E9B;gems&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x5B89;&#x88C5;&#x3002;&#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5EFA;&#x7ACB;Cucumber&#x4E86;&#x3002;</p>
``` terminal
script/generate cucumber
```
<p>&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;features&#x6587;&#x4EF6;&#x5939;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x7684;&#x5730;&#x65B9;&#x3002;</p>

<h3>&#x521B;&#x5EFA;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#x7247; (&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x50CF;&#x5BFC;&#x6F14;&#x5427;&#xFF01;):</h3>

<p>&#x8BD1;&#x6CE8;&#xFF1A;&#x5173;&#x4E8E;feature&#x7A76;&#x7ADF;&#x5E94;&#x8BE5;&#x7FFB;&#x8BD1;&#x6210;&quot;&#x529F;&#x80FD;&quot;&#x8FD8;&#x662F;&quot;&#x6545;&#x4E8B;&#x7247;&quot;&#x6216;&#x8005;&#x522B;&#x7684;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7FFB;&#x8BD1;&#x6210;&#x6545;&#x4E8B;&#x7247;&#x66F4;&#x5408;&#x9002;&#x3002;&#x56E0;&#x4E3A;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x573A;&#x666F;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x5BFC;&#x6F14;&#xFF0C;&#x6F14;&#x5458;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x544A;&#x8BC9;&#x6F14;&#x5458;&#x8981;&#x5E72;&#x4EC0;&#x4E48;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#x4ECE;&#x8FD9;&#x70B9;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;cucumber&#x786E;&#x5B9E;&#x591F;&#x9177;&#x3002;</p>

<p>&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x7684;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7BA1;&#x7406;&#x6587;&#x7AE0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;features&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB; <code>manage_atricles.feature</code> &#x7684;&#x6587;&#x4EF6;&#x3002;(&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;TextMate&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x4E0B;&#x8F7D;cucumber&#x7684;tm bundle&#xFF0C;&#x5730;&#x5740; <a href="http://github.com/bmabey/cucumber-tmbundle">http://github.com/bmabey/cucumber-tmbundle</a>)</p>

<p>Cucumber&#x7684;&#x5B9A;&#x4E49;&#x7531;&#x4E24;&#x4E2A;&#x90E8;&#x4EFD;&#x7EC4;&#x6210;&#x3002;&#x7B2C;&#x4E00;&#x9879;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x6545;&#x4E8B;&#x7247;&#x60C5;&#x8282;&#x672C;&#x8EAB;&#xFF0C;&#x4ED6;&#x4EEC;&#x7531;3&#x4E2A;&#x90E8;&#x4EFD;&#x7EC4;&#x6210;&#xFF1A;&ldquo;In order&rdquo;, &ldquo;As a&rdquo; &#x548C; &ldquo;I Want&rdquo;. &#x6211;&#x4EEC;&#x50CF;&#x8FD9;&#x6837;&#x6765;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x7684;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;:</p>

``` cucumber_definition
Feature: Manage Articles
  In order to make a blog
  As an author
  I want to create and manage articles
```

<p>&quot;In order&quot;&#x884C;&#x5B9A;&#x4E49;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x603B;&#x4F53;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x3002;&quot;As a&quot;&#x884C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6545;&#x4E8B;&#x7247;&#x4E2D;&#x7684;&#x6F14;&#x5458;&#x3002;&#x6700;&#x540E;&#x4E00;&#x884C;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x5177;&#x4F53;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x7247;&#x7684;&#x4E3B;&#x8981;&#x60C5;&#x8282;&#x3002;</p>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x7247;&#x79CD;&#x7684;&#x4E00;&#x4E9B;&#x884C;&#x4E3A;(&#x60C5;&#x8282;),&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x573A;&#x666F;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x573A;&#x666F;&#x901A;&#x5E38;&#x6309;&#x7167;&#x4E00;&#x79CD;&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BBE;&#x8BA1;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;&quot;Given&quot;&#xFF0C;&quot;When&quot; &#x548C; &quot;Then&quot;&#x4E09;&#x4E2A;&#x90E8;&#x4EFD;&#x6765;&#x7EC4;&#x6210;&#x573A;&#x666F;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x5217;&#x51FA;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x7684;&#x573A;&#x666F;&#x3002;</p>

``` cucumber_definition
Scenario: Articles List
    Given I have articles titled Pizza, Breadsticks
    When I go to the list of articles
    Then I should see "Pizza"
    And I should see "Breadsticks"
```

<p>&#x5B8C;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8FD0;&#x884C;Cucumber&#xFF0C;&#x770B;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x6211;&#x4EEC;&#x7528; <code>-n</code> &#x9009;&#x9879;&#x6765;&#x8BA9;Cucumber&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x4ECB;&#x7684;&#x8F93;&#x51FA;:</p>

``` terminal cucumber
$ cucumber features -n
Feature: Manage Articles
	In order to make a blog
	As an author
	I want to create and manage articles

  Scenario: Articles List
    Given I have articles titled Pizza, Breadsticks
    When I go to the list of articles
    Then I should see "Pizza"
    And I should see "Breadsticks"

1 scenario
3 skipped steps
1 undefined step

You can implement step definitions for missing steps with these snippets:

Given /^I have articles titled Pizza, Breadsticks$/ do
  pending
end
```
 
<p>Cucumber&#x663E;&#x793A;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x5267;&#x672C;&#x7EB2;&#x8981;&#x548C;&#x573A;&#x666F;&#x6F14;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5176;&#x4E2D;3&#x4E2A;&#x6B65;&#x9AA4;&#x88AB;&#x8DF3;&#x8FC7;&#xFF0C;1&#x4E2A;&#x6B65;&#x9AA4;&#x672A;&#x5B9A;&#x4E49;&#x3002;Cucumber&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8FD0;&#x884C;&#x6CA1;&#x5B9A;&#x4E49;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x5199;Ruby&#x4EE3;&#x7801;&#x6765;&#x6267;&#x884C;&#x3002;Cucumber&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x6BB5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7C98;&#x8D34;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x677F;&#x3002;</p>

<h3>&#x5B9A;&#x4E49;&quot;Given&quot;&#x6B65;&#x9AA4;</h3>
<p>&#x573A;&#x666F;&#x6B65;&#x9AA4;&#x88AB;&#x5B9A;&#x4E49;&#x5728; <code>features</code> &#x6587;&#x4EF6;&#x4E2D;&#x7684;step_definitions&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB;<code>article_steps.rb</code>&#x7684;&#x6587;&#x4EF6;&#x6765;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x7684;&#x573A;&#x666F;&#x3002;</p>

``` cucumber_definition
Given /^I have articles titled Pizza, Breadsticks$/ do
  pending
end
```

<p>&#x6211;&#x4EEC;&#x7684;&#x6B65;&#x9AA4;&#x88AB;&#x5B9A;&#x4E49;&#x6210;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x5B83;&#x4F1A;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x79CD;&#x7684;&#x6587;&#x672C;&#x8BED;&#x8A00;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x6210;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5230;Ruby&#x4EE3;&#x7801;&#x91CC;&#x53BB;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x8BA9;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x5177;&#x6709;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x4EFB;&#x4F55; &#x4F20;&#x5165;&#x7684;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x4E3B;&#x610F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&quot;Pizza,Breadsticks&quot;&#x66FF;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x5339;&#x914D;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x8FD4;&#x56DE;&#x7684;&#x6BCF;&#x4E2A;&#x6807; &#x9898;&#x3002;</p>

``` cucumber_definition
Given /^I have articles titled (.+)$/ do |titles|
  titles.split(', ').each do |title|
    Article.create!(:title => title)
  end
end
```

<p>&#x6211;&#x4EEC;&#x5C06;&#x4F20;&#x5165;&#x4E00;&#x4E9B;&#x7531;&#x9017;&#x53F7;&#x548C;&#x7A7A;&#x683C;&#x5206;&#x9694;&#x7684;&#x53EF;&#x4EE5;&#x88AB;(.+)&#x90E8;&#x4EFD;&#x5339;&#x914D;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x4F20;&#x9012;&#x7ED9;titles&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&quot;,&quot;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x5206;&#x9694;&#x6210;&#x5355;&#x72EC;&#x7684;title&#x3002;&#x6BCF;&#x4E2A;&#x80FD;&#x5339;&#x914D;&#x4E0A;&#x7684;&#x6807;&#x9898;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x7BC7;&#x65B0;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x8FD9;&#x5C31;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;Given&#x7684;&#x6761;&#x4EF6;&#x4E86;&#x3002;</p>

<h3>&#x5176;&#x4ED6;&#x7684;&#x6B65;&#x9AA4;&#x5462;&#xFF1F;</h3>
<p>&#x5F53;&#x6211;&#x4EEC;&#x8FD0;&#x884C;Cucumber&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x6CA1;&#x6709;&#x88AB;&#x5B9A;&#x4E49;&#xFF0C;&#x5176;&#x4ED6;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#x88AB;&#x8DF3;&#x8FC7;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x867D;&#x7136;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x5B58;&#x5728; &#x7684;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x8BE5;&#x5728;&#x54EA;&#x91CC;&#x5B9A;&#x4E49;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;Webrat&#x5728;&#x548C;article&#x6B65;&#x9AA4;&#x76F8;&#x540C;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x53EB;<code>webrat_steps.rb</code>&#x7684;&#x6587;&#x4EF6;&#x91CC;&#x5B9A;&#x4E49; &#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x8FDB;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x3002;</p>

``` cucumber_definition
When /^I go to (.+)$/ do |page_name|
  visit path_to(page_name)
end
```

<p>&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x5B9A;&#x4E49;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7B2C;&#x4E8C;&#x6B65;&#xFF08;&#x5F53;&#x6211;&#x67E5;&#x770B;&#x6587;&#x7AE0;&#x5217;&#x8868;&#xFF09;&#x5E76;&#x4E14;&#x8FD8;&#x6709;&#x7B26;&#x5408;&#x5176;&#x4ED6;&#x88AB;&#x8DF3;&#x8FC7;&#x7684;&#x6B65;&#x9AA4;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>

<h3>&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x628A;&#x4ED6;&#x53D8;&#x7EFF;</h3>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x6B65;&#x9AA4;&#x90FD;&#x5B9A;&#x4E49;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x8FD0;&#x884C;Cucumber&#xFF0C;&#x5E76;&#x4E14;&#x67E5;&#x770B;Cucumber&#x7684;&#x8F93;&#x51FA;&#x6765;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x3002;</p>

``` terminal cucumber
$ cucumber features -n
Feature: Manage Articles
	In order to make a blog
	As an author
	I want to create and manage articles

  Scenario: Articles List
    Given I have articles titled Pizza, Breadsticks
      uninitialized constant Article (NameError)
      ./features/step_definitions/article_steps.rb:3:in `__instance_exec0'
      ./features/step_definitions/article_steps.rb:2:in `each'
      ./features/step_definitions/article_steps.rb:2:in `/^I have articles titled (.+)$/'
      features/manage_articles.feature:7:in `Given I have articles titled Pizza, Breadsticks'
    When I go to the list of articles
    Then I should see "Pizza"
    And I should see "Breadsticks"

1 scenario
1 failed step
3 skipped steps
```

<p>&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x770B;&#x4E0D;&#x90A3;&#x4E2A;&#x672A;&#x5B9A;&#x4E49;&#x6B65;&#x9AA4;&#x4E86;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x4E4B;&#x6240;&#x4EE5;&#x5931;&#x8D25;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x521B;&#x5EFA;Article&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x8FC7;RSpec&#x751F;&#x6210;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x5B83;&#x3002;</p>
``` terminal
script/generate rspec_model Article title:string content:text
```
<p>&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;windows&#x7528;&#x6237;&#x8BF7;&#x7528; <code>ruby script/generate xxxxxx</code></p>

<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x5F00;&#x53D1;&#x6570;&#x636E;&#x5E93;&#x7ED3;&#x6784;&#x590D;&#x5236;&#x5230;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
``` terminal
rake db:migrate
rake db:test:clone
```
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8FD0;&#x884C;Cucumber&#x3002;</p>
``` terminal cucumber
$ cucumber features -n
Feature: Manage Articles
  In order to make a blog
  As an author
  I want to create and manage articles

  Scenario: Articles List
    Given I have articles titled Pizza, Breadsticks
    When I go to the list of articles
      Can't find mapping from "the list of articles" to a path.
      Now, go and add a mapping in features/support/paths.rb (RuntimeError)
      /Users/eifion/rails/apps_for_asciicasts/blog/features/support/paths.rb:12:in `path_to'
      ./features/step_definitions/webrat_steps.rb:11:in `/^I go to (.+)$/'
      features/manage_articles.feature:8:in `When I go to the list of articles'
    Then I should see "Pizza"
    And I should see "Breadsticks"

1 scenario
1 failed step
2 skipped steps
1 passed step
```
<p>&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x901A;&#x8FC7;&#x4E86;&#x6D4B;&#x8BD5;&#xFF01;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x6B65;&#x73B0;&#x5728;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Cucumber&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x628A; <code>&quot;the list of articles&quot;</code> &#x5BF9;&#x5E94;&#x5230;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8DEF;&#x5F84;&#x3002;</p>

<p>Cucumber&#x5B89;&#x88C5;&#x7684;&#x65F6;&#x5019;&#x5728;/features/support&#x6587;&#x4EF6;&#x5939;&#x91CC;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x53EB;paths.rb&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49; Cucumber&#x6587;&#x4EF6;&#x91CC;&#x7684;&#x82F1;&#x8BED;&#x5B9A;&#x4E49;&#x548C;&#x6211;&#x4EEC;&#x7684;Rails&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8DEF;&#x5F84;&#x4E4B;&#x95F4;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;&#x8981;&#x589E;&#x52A0;&#x4E00;&#x6761;&#x6620;&#x5C04;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5728;path_to &#x65B9;&#x6CD5;&#x91CC;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;when&#x6761;&#x4EF6;&#x5230;case&#x8BED;&#x53E5;&#x3002;(&#x6587;&#x4EF6;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#x6765;&#x544A;&#x8BC9;&#x4F60;&#x6DFB;&#x52A0;&#x5230;&#x54EA;&#x91CC;)</p>

``` cucumber_definition
# Add more page name => path mappings here
when /the list of articles/
  articles_path
```

<p>&#x518D;&#x6B21;&#x8FD0;&#x884C;Cucumber&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x663E;&#x793A;&#x4E0B;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x4FEE;&#x590D;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x6B21;&#x4ED6;&#x627E;&#x4E0D;&#x5230;&#x7B26;&#x5408;articles_path&#x7684;&#x8DEF;&#x7531;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x6620;&#x5C04;&#x52A0;&#x5165;&#x5230;<code>routes.rb</code></p>

``` ruby
map.resources :articles
```  

<p>&#x5B8C;&#x6210;&#x4EE5;&#x540E;&#xFF0C;Cucumber&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x627E;&#x4E0D;&#x5230;<code>ArticlesController</code>&#x3002;&#x548C;&#x6A21;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;RSpec&#x751F;&#x6210;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x63A7;&#x5236;&#x5668;&#x3002;</p>
``` terminal
script/generate rspec_controller articles index
```
<p>Cucumber&#x4ECD;&#x7136;&#x4E0D;&#x6EE1;&#x610F;&#x3002;&#x4ED6;&#x60F3;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x56FE;&#x91CC;&#x770B;&#x5230;&quot;Pizza&quot;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x5728;index&#x89C6;&#x56FE;&#x5199;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x6240;&#x4EE5;Cucumber&#x627E;&#x4E0D;&#x5230;&#x4ED6;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x4FEE;&#x6539;Articles&#x63A7;&#x5236;&#x5668;&#x7684;index action &#x548C; &#x89C6;&#x56FE; &#x4EE3;&#x7801;&#x6765;&#x663E;&#x793A;&#x6587;&#x7AE0;&#x5217;&#x8868;&#x3002;</p>
``` /app/controllers/articles_controller.rb
def index  
  @articles = Article.all  
end
```

``` /app/views/articles/index.html.erb
<h1>Articles</h1>  
<% @articles.each do |article| %>  
  <h2><%= h(article.title) %></h2>  
  <p><%= h(article.content) %></p>  
<% end %>
```
<p>&#x8FD9;&#x56DE;Cucumber&#x9AD8;&#x5174;&#x5566;&#xFF01;&#x5F53;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x4ED6;&#x7684;&#x65F6;&#x5019;&#x4ED6;&#x663E;&#x793A;4&#x4E2A;&#x6B65;&#x9AA4;&#x5168;&#x90E8;&#x901A;&#x8FC7;&#x3002;</p>

<p>&#x770B;&#x8D77;&#x6765;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;Cucumber&#x573A;&#x666F;&#x7684;&#x901A;&#x8FC7;&#x4ED8;&#x51FA;&#x5927;&#x91CF;&#x52AA;&#x529B;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x6545;&#x610F;&#x5F88;&#x5C0F;&#x7684;&#x6B65;&#x9AA4;&#x6765;&#x5C55;&#x793A;Cucumber&#x901A;&#x5E38;&#x90FD;&#x544A;&#x8BC9;&#x4F60;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#x5F53;&#x4F60;&#x719F;&#x7EC3;&#x4F7F;&#x7528;cucumber&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x66F4;&#x5927;&#x4E9B;&#x7684;&#x6B65;&#x9AA4;&#x5B8C;&#x6210;&#x540E;&#x8FD0;&#x884C;cucumber&#x3002;</p>


<h3>&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x573A;&#x666F;</h3>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5C55;&#x793A;&#x4E86;cucumber&#x5927;&#x6982;&#x662F;&#x600E;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>



``` cucumber_definition
Scenario: Create Valid Article
  Given I have no articles
  And I am on the list of articles
  When I follow "New Article"
  And I fill in "Title" with "Spuds"
  And I fill in "Content" with "Delicious potato wedges!"
  And I press "Create"
  Then I should see "New article created."
  And I should see "Spuds"
  And I should see "Delicious potato wedges!"
  And I should have 1 article
```

<p>&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x5B9A;&#x4E49;&#x4E86;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x7AE0;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x4E0D;&#x540C;&#xFF0C;&#x4ED6;&#x5305;&#x542B;&#x4E86;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5F88;&#x591A;&#x4E2A;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x521A;&#x5F00;&#x59CB;&#x6CA1;&#x6709;&#x6587;&#x7AE0;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&quot;New Article&quot;&#x8FD9;&#x4E2A;&#x6587;&#x5B57;&#x94FE;&#x63A5;&#xFF0C;&#x63D0;&#x586B;&#x5199;&#x8868;&#x5355;&#x7136;&#x540E;&#x63D0;&#x9AD8;&#xFF0C;&#x7136;&#x540E;&#x7136;&#x540E;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x65B0;&#x6587;&#x7AE0;&#x3002;&#x5E76;&#x4E14;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>

<p>&#x548C;&#x5E73;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x662F;&#x8FD0;&#x884C;Cucumber. &#x8FD0;&#x884C;&#x540E;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x4E2A;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x7684;&#x6B65;&#x9AA4;&#x548C;6&#x4E2A;&#x8DF3;&#x8FC7;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x4E24;&#x4E2A;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x6B65;&#x9AA4;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;(&quot;Given I have no articles&quot;)&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;(&quot;And I should have 1 article&quot;)&#x3002; &#x5176;&#x4ED6;6&#x4E2A;&#x88AB;&#x5305;&#x542B;&#x5728;Webrat&#x6B65;&#x9AA4;&#x4E2D;&#x3002;</p>

<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x521B;&#x5EFA;&#x90A3;&#x4E24;&#x4E2A;&#x6CA1;&#x5B9A;&#x4E49;&#x7684;&#x6B65;&#x9AA4;.</p>

``` cucumber_definition
Given /^I have no articles$/ do
  Article.delete_all
end

Then /^I should have ([0-9]+) article$/ do |count|
  Article.count.should == count.to_i
end
```
<p>&#x7B2C;&#x4E00;&#x6B65;&#x76F4;&#x622A;&#x4E86;&#x5F53;&#x5199;&#x51FA;&#x6765;&#x3002;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x90A3;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5220;&#x9664;&#x6240;&#x6709;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x7B2C;&#x4E8C;&#x6B65;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6570;&#x5B57;1&#x6539;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5339;&#x914D;&#x6B63;&#x6570;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x90A3;&#x4E2A;&#x6570;&#x5B57; &#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4F20;&#x7ED9;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x7136;&#x540E;&#x4EE3;&#x7801;&#x5757;&#x68C0;&#x67E5;&#x6587;&#x7AE0;&#x7684;&#x6570;&#x91CF;&#x662F;&#x5426;&#x7B49;&#x4E8E;&#x90A3;&#x4E2A;&#x4F20;&#x8FDB;&#x6765;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x6CE8;&#x610F;Cucumber&#x4F1A;&#x628A;&#x63A5;&#x6536;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5F53;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC; &#x9700;&#x8981;&#x663E;&#x5F0F;&#x7684;&#x628A;count&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x8F6C;&#x6362;&#x6210;integer&#x7C7B;&#x578B;&#x3002;</p>


<p>&#x518D;&#x6B21;&#x8FD0;&#x884C;Cucumber,&#x663E;&#x793A;&#x524D;&#x9762;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x73B0;&#x5728;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E09;&#x6B65;&#x5931;&#x8D25;&#x3002;</p>

``` terminal cucumber
Given I have no articles
And I am on the list of articles
When I follow "New Article"
  Could not find link with text or title or id "New Article" (Webrat::NotFoundError)
  (eval):2:in `click_link'
  ./features/step_definitions/webrat_steps.rb:19:in `/^I follow "([^\"]*)"$/'
  features/manage_articles.feature:15:in `When I follow "New Article"'
```

<p>&#x8FD9;&#x6B65;&#x5931;&#x8D25;&#x662F;&#x56E0;&#x4E3A;cucumber&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x53EB;&quot;New Article&quot;&#x7684;&#x6587;&#x5B57;&#x94FE;&#x63A5;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;index&#x9875;&#x548C;&#x65B0;&#x6587;&#x7AE0;&#x9875;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5E76;&#x4E14;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x5728;index&#x9875;&#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x65B0;&#x6587;&#x7AE0;&#x9875;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>
``` ruby
<p><%= link_to "New Article", new_article_path %></p>
```
<p>&#x7136;&#x540E;&#x5728;/views/articles/&#x4E0B;&#x9762;&#x7684;new.html.erb&#x4E2D;&#x4E3A;&#x65B0;&#x6587;&#x7AE0;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#x3002;</p>

``` /app/views/articles/index.html.erb
<p><%= link_to "New Article", new_article_path %></p>
```

<p>&#x7136;&#x540E;&#x5728;/views/articles/&#x4E0B;&#x9762;&#x7684;new.html.erb&#x4E2D;&#x4E3A;&#x65B0;&#x6587;&#x7AE0;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#x3002;</p>

``` ruby
<% form_for @article do |f| %>
  <ol class="formList">
    <li>
      <%= f.label :title %>
      <%= f.text_field :title %>
    </li>
    <li>
      <%= f.label :content %>
      <%= f.text_field :content %>
    </li>
    <li>
      <%= f.submit "Create" %>
    </li>
  </ol>
<% end %>
```

<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x63A7;&#x5236;&#x5668;</p>

``` /app/controllers/articles_controller.rb
def new
  @article = Article.new
end
  
def create
  @article = Article.create!(params[:article])
  flash[:notice] = "New article created."
  redirect_to articles_path
end
```  

<p>&#x6211;&#x4EEC;&#x5728;&#x4E3A;&#x63A7;&#x5236;&#x5668;&#x7F16;&#x5199;new&#x548C;create action&#x7684;&#x65F6;&#x5019;&#x8FC8;&#x4E86;&#x4E00;&#x5927;&#x6B65;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x518D;&#x6B21;&#x7528;cucumber&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x8FD8;&#x6709;&#x5565;&#x8981;&#x505A;&#x7684;&#x3002;&#x8FD9;&#x56DE;&#x524D;&#x9762;6&#x4E2A;&#x6B65;&#x9AA4;&#x90FD;&#x901A;&#x8FC7;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>

``` terminal cucumber
Then I should see "New article created."
  expected the following element's content to include "New article created.":
  ArticlesSpudsDelicious potato wedges!New Article (Spec::Expectations::ExpectationNotMetError)
  ./features/step_definitions/webrat_steps.rb:94:in `/^I should see "([^\"]*)"$/'
  features/manage_articles.feature:19:in `Then I should see "New article created."'
```
<p>Although we&rsquo;ve created the flash message in the <code>create</code> action we&rsquo;re not displaying it on the index page. Adding it in should make this step pass. It should go in a layout file, but we&rsquo;ll just add it to the top of the index page to make the step pass.</p>
``` ruby
<%= flash[:notice] %>
``` 

<p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5728;create action&#x79CD;&#x521B;&#x5EFA;&#x4E86;flash message,&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x5728;index&#x9875;&#x9762;&#x91CC;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;&#x52A0;&#x4E0A;&#x5B83;&#x5E94;&#x8BE5;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x8FD9;&#x6B65;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002;&#x5B83;&#x5E94;&#x5F53;&#x653E;&#x5728;&#x6A21;&#x677F;&#x6587;&#x4EF6;&#x91CC;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x53EA;&#x662F;&#x8BA9;&#x8FD9;&#x6B65;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x653E;&#x5728;index&#x9875;&#x9762;&#x91CC;&#x3002;</p>

``` ruby
<%= flash[:notice] %>
```

<h3>&#x5168;&#x90E8;&#x53D8;&#x7EFF;&#x5566;</h3>

<p>&#x6211;&#x4EEC;&#x52A0;&#x4E0A;flash message&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x8FD0;&#x884C;cucumber&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6B65;&#x9AA4;&#x90FD;&#x7EFF;&#x4E86;&#x3002;</p>
``` terminal cucumber
$ cucumber features -n
Feature: Manage Articles
	In order to make a blog
	As an author
	I want to create and manage articles

  Scenario: Articles List
    Given I have articles titled Pizza, Breadsticks
    When I go to the list of articles
    Then I should see "Pizza"
    And I should see "Breadsticks"

  Scenario: Create Valid Article
    Given I have no articles
    And I am on the list of articles
    When I follow "New Article"
    And I fill in "Title" with "Spuds"
    And I fill in "Content" with "Delicious potato wedges!"
    And I press "Create"
    Then I should see "New article created."
    And I should see "Spuds"
    And I should see "Delicious potato wedges!"
    And I should have 1 article

2 scenarios
14 passed steps
```
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x6837;&#x4E86;&#x3002;&#x968F;&#x7740;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x6B65;&#x9AA4;&#x7684;&#x901A;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x89C9;&#x4E00;&#x7BC7;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x7684;&#x6587;&#x7AE0;&#x3002;</p>

<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x4E86;cucumber&#x7684;&#x57FA;&#x7840;&#x90E8;&#x4EFD;&#x3002;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x7528;&#x82F1;&#x8BED;&#x5B9A;&#x4E49;&#x6D4B;&#x8BD5;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x6B21;&#x4E00;&#x6B21;&#x7684;&#x5B8C;&#x6210;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x4F46;&#x662F;cucumber&#x6D4B;&#x8BD5;&#x6709;&#x5F88;&#x591A;&#x6709;&#x70B9;&#x3002;&#x4F60;&#x7528;&#x5B83;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x771F;&#x4E2A;&#x5806;&#x6808;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5199;&#x7684;&#x6D4B;&#x8BD5;&#x5305;&#x62EC;&#x4E86;&#x4ECE;&#x7528;&#x6237;&#x754C;&#x9762;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x5207;&#x3002;&#x4ED6;&#x4E0D;&#x662F;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x66FF;&#x4EE3;&#x7269;&#xFF0C;&#x4ED6;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5199;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6574;&#x4F53; &#x884C;&#x4E3A;&#x597D;&#x65B9;&#x6CD5;&#x3002;</p>