<style type="text/css">.asciicast .imageWrapper { width: 900px; overflow: auto; text-align: center; }</style>

<p>Si estamos cansados de escribir prefijos espec&iacute;ficos de cada vendedor en las propiedades de CSS deber&iacute;amos echarle un vistazo a la librer&iacute;a  <a href="http://thoughtbot.com/bourbon/">Bourbon</a> que incluye varios <em>mixins</em> y funciones de SASS que hace m&aacute;s c&oacute;modo el trabajo con CSS.  En este episodio veremos c&oacute;mo se puede usar en una aplicaci&oacute;n Rails.</p>

<h3>C&oacute;mo a&ntilde;adir Bourbon a una aplicaci&oacute;n Rails</h3>

<p>La aplicaci&oacute;n con la que vamos a trabajar es la que se muestra a continuaci&oacute;n.  El dise&ntilde;o necesita todav&iacute;a algo de trabajo, as&iacute; que vamos a a&ntilde;adir Bourbon y usaremos su funcionalidad para mejorar el aspecto.</p>


<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1045/original/E330I01.png" width="800" height="420" alt="Nuestra página de proyectos."/>
</div>

<p>La instalaci&oacute;n de Bourbon es muy sencilla.  Tan s&oacute;lo tenemos que a&ntilde;adirlo al <code>Gemfile</code> y lanzar la orden <code>bundle</code></p>
	
``` /Gemfile
source 'https://rubygems.org'

gem 'rails', '3.2.2'

# Bundle edge Rails instead:
# gem 'rails', :git => 'git://github.com/rails/rails.git'

gem 'sqlite3'


# Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem 'sass-rails',   '~> 3.2.3'
  gem 'coffee-rails', '~> 3.2.1'

  # See https://github.com/sstephenson/execjs#readme for more supported runtimes
  # gem 'therubyracer'

  gem 'uglifier', '>= 1.0.3'
end

gem 'jquery-rails'
gem 'bourbon'
```

<p>Para usar Bourbon con el conducto de est&aacute;ticos de Rails tenemos que cambiar el funcionamiento por defecto de <code>application.css</code>.  Por defecto este fichero incorpora un manifiesto de Sprockets para cargar el resto de hojas de estilo.  El problema con este enfoque es que Sprockets compila cada fichero SASS en CSS, lo que complica compartir los <em>mixins</em> de Bourbon entre todos los ficheros SASS.  Para solucionar esto podemos hacer que sea SASS en lugar de Sprockets quien cargue todos los ficheros <code>scss</code>.</p>
	
<p>Renombraremos el fichero <code>application.css</code> a <code>application.css.scss</code>, tras lo que podemos eliminar el manifiesto de Sprockets y usar la directiva <code>@import</code> de SASS para incorporar los ficheros que deseamos incluir.  Por ahora incluiremos simplemente el fichero <code>bourbon</code> que suministra la gema.</p>

``` /app/assets/stylesheets/application.css.scss
@import "bourbon";
```

<p>Tras reiniciar el servidor Rails veremos que al recargar la p&aacute;gina han desaparecido los estilos.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1046/original/E330I02.png" width="800" height="420" alt="La página se muestra sin información de estilos."/>
</div>

<p>Si abrimos con el navegador el fichero  <code>/assets/application.css</code> veremos que aparece en blanco.  Bourbon no a&ntilde;ade CSS directamente a la aplicaci&oacute;n, simplemente hace que sea m&aacute;s sencillo para nosotros hacerlo mediante SASS.  Tenemos que ser nosotros los que escribamos el CSS de nuestra aplicaci&oacute;n por lo que volveremos a poner los ficheros <code>layout</code> y <code>project</code> en <code>application.css.scss</code>.  Ya ten&iacute;amos estos ficheros antes, pero ahora ya podremos usar Bourbon sobre ellos.</p>

``` /app/assets/stylesheets/application.css.scss
@import "bourbon";
@import "layout";
@import "projects";
```

<p>Si ahora recargamos la p&aacute;gina veremos el dise&ntilde;o que ten&iacute;amos anteriormente.</p>

<h3>Modificaci&oacute;n del encabezado</h3>

<p>La primera mejora que le vamos a hacer a nuestro dise&ntilde;o es cambiar la tipograf&iacute;a.  La p&aacute;gina utiliza la tipograf&iacute;a por defecto del navegador, que por lo general es Times New Roman.  Bourbon incluye una extensi&oacute;n llamada <a href="http://thoughtbot.com/bourbon/#font-family"><code>font-family</code></a> que proporciona diferentes variables para determinar los atributos de una fuente, incluyendo valores de respaldo por si la tipograf&iacute;a no se encuentra disponible. Vamos a utilizarlas para configurar la fuente del cuerpo de texto:</p>

``` /app/assets/stylesheets/layout.css.scss
body {
  margin: 0;
  padding: 0;
  background-color: #FFF;
  font-size: 14px;
  font-family: $verdana;
}
```

<p>A continuaci&oacute;n le vamos a a&ntilde;adir un degradado al encabezamiento.  Bourbon trae un m&oacute;dulo llamado <a href="http://thoughtbot.com/bourbon/#linear-gradient"><code>linear-gradient</code></a> que podemos usar para a&ntilde;adir degradados y configurar sus colores.  A&ntilde;adiremos uno que empieza en gris claro y termina m&aacute;s oscuro.  N&oacute;tese que no hemos establecido el sentido del degradado, lo que quiere decir que se usar&aacute; el valor por defecto (<code>top</code>).</p>

``` /app/assets/stylesheets/layout.css.scss
#header {
  color: #FFF;
  padding: 15px 100px;
  font-size: 30px;
  font-weight: bold;
  @include linear-gradient(#777, #444);
}
```

<p>Como ya se incluye un valor por defecto de fondo en <code>linear-gradient</code> hemos elminado la propiedad <code>background-color</code> de la cabecera.  Tambi&eacute;n queremos a&ntilde;adir un sombreado, y Bourbon viene con un <a href="http://thoughtbot.com/bourbon/#box-shadow">mixin</a> para a&ntilde;adirlo.  Podemos utilizarlo de una manera similar a la propiedad <code>box-shadow</code> de CSS3 pero el <em>mixin</em> generar&aacute; todos los prefijos espec&iacute;ficos de cada navegador para nostros.  A&ntilde;adiremos una sombra negra sin desplazamiento y con un sombreado de 6 pixeles con dispersion de 3.</p>

``` /app/assets/stylesheets/layout.css.scss
#header {
  background-color: #555;
  color: #FFF;
  padding: 15px 100px;
  font-size: 30px;
  font-weight: bold;
  @include linear-gradient(#777, #444);
  @include box-shadow(0 0 6px 3px #000);
}
```

<p>Si recargamos la p&aacute;gina veremos estos mismos cambios.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1047/original/E330I03.png" width="800" height="420" alt="La cabecera tiene un degradado y su sombra."/>
</div>

<h3>Mejora del resto de los elementos</h3>

<p>A continuaci&oacute;n vamos a cambiar el listado de elemento.  Lo primero que haremos ser&aacute; a&ntilde;adir bordes redondeados a la caja que rodea cada proyecto.  No hace falta decir que Bourbon incorpora un m&oacute;dulo llamado  <a href="http://thoughtbot.com/bourbon/#border-radius"><code>border-radius</code></a> que sirve exactamente para esto.  Este estilo espec&iacute;fico de proyectos se encuentra en el fihero <code>projects.css.scss</code> por lo que haremos el cambio ah&iacute;, para a&ntilde;adir un radio de seis p&iacute;xeles.</p>

``` /app/assets/stylesheets/projects.css.scss
.project {
  border: solid 1px #AAA;
  margin: 20px 0;
  padding: 7px 12px;
  @include border-radius(6px);
  
  &:hover { background-color: #F8FCCF; }
  
  h2 {
    margin: 0;
    a { text-decoration: none; }
  }
}
```

<p>A continuaci&oacute;n vamos a cambiar la manera en que cambia el color de fondo de cada elemento cuando pasamos con el rat&oacute;n sobre &eacute;l.  En lugar de cambiar inmediatamente queremos que haga una transici&oacute;n de color.  Podemos utilizar <a href="http://thoughtbot.com/bourbon/#transitions">transitions</a> para esto, pas&aacute;ndole el atributo que queremos modificar, el tiempo que deber&iacute;a llevar la transici&oacute;n, y el efecto de transici&oacute;n que queramos.</p>

``` /app/assets/stylesheets/projects.css.scss
.project {
  border: solid 1px #AAA;
  margin: 20px 0;
  padding: 7px 12px;
  @include border-radius(6px);
  @include transition(all, 500ms, ease-in-out);
  
  &:hover { background-color: #F8FCCF; }
  
  h2 {
    margin: 0;
    a { text-decoration: none; }
  }
}
```

<p>Ahora el color de fondo aparecer&aacute; en medio segundo cuando pasamos el rat&oacute;n sobre el proyecto y tardar&aacute; el mismo tiempo en desaparecer cuando el cursor deje de estar encima.</p>

<p>Lo &uacute;ltimo que vamos a hacer en esta p&aacute;gina es mejorar el enlace de &ldquo;New Project&rdquo;.   Nos gustar&iacute;a que pareciese un bot&oacute;n y para esto Bourbon incluye una extensi&oacute;n  <a href="http://thoughtbot.com/bourbon/#buttons">buttons</a>  que sirve para definir los estilos de un bot&oacute;n.  Nuestro enlace viene con la clase <code>new_project</code> por lo que podemos usar este estilo para convertir los enlaces en un bot&oacute;n verde muy sencillo..</p>

``` /app/assets/stylesheets/projects.css.scss
.new_project {
  @include button(simple, #3FB344); 
}
```

<p>Al recargar la p&aacute;gina ya veremos los bordes redondeados y el enlace con los estilos en forma de bot&oacute;n (el lector tendr&aacute; que hacer un acto de f&eacute; para creer que las transiciones de color de fondo funcionan).</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1048/original/E330I04.png" width="800" height="420" alt="El resto de la página tiene los estilos deseados."/>
</div>

<p>El bot&oacute;n ha heredado ciertos atributos a partir de la etiqueta de anclado, como por ejemplo el texto subrayado y queremos que sea un poco mayor.  As&iacute; que tenemos que a&ntilde;adir un poco de CSS:</p>

``` /app/assets/stylesheets/projects.css.scss
.new_project {
  @include button(simple, #3FB344); 
  text-decoration: none;
  font-size: 16px;
}
```

<p>Ya tenemos un bonito bot&oacute;n para a&ntilde;adir un nuevo proyecto.</p>

<div class="imageWrapper">
  <img src="http://asciicasts.com/system/photos/1049/original/E330I05.png" width="800" height="420" alt="El botón con los estilos pertinentes"/>
</div>

<h3>Ejemplo de CSS generado por Bourbon</h3>

<p>Ahora que el aspecto de la p&aacute;gina es mejor, veamos la CSS generada por Bourbon.  No podremos ver todo porque es bastante extensa, pero s&iacute; que podemos ver como ejemplo la CSS generada para la cabecera, as&iacute; como el c&oacute;digo generado para el degradado.</p>

``` css
#header {
  background-color: #555;
  color: #FFF;
  padding: 15px 100px;
  font-size: 30px;
  font-weight: bold;
  background-color: #777777;
  background-image: -webkit-gradient(linear, left top, left bottom, color-stop(0%, #777777), color-stop(100%, #444444));
  background-image: -webkit-linear-gradient(top, #777777, #444444);
  background-image: -moz-linear-gradient(top, #777777, #444444);
  background-image: -ms-linear-gradient(top, #777777, #444444);
  background-image: -o-linear-gradient(top, #777777, #444444);
  background-image: linear-gradient(top, #777777, #444444);
  -webkit-box-shadow: 0 0 6px 3px black;
  -moz-box-shadow: 0 0 6px 3px black;
  box-shadow: 0 0 6px 3px black;
}
```

<p>Puede verse que hay mucho c&oacute;digo que no hemos tenido que escribir manualmente gracias a Bourbon.</p>

<p>SASS incluye otras funciones que pueden ayudar para generar CSS cuando tenemos que tratar con cambios de color y otros ajustes.  Hay m&aacute;s informaci&oacute;n en  <a href="http://railscasts.com/episodes/268-sass-basics">el episodio 268</a> sobre qu&eacute; podemos hacer s&oacute;lo utilizando SASS.</p>