<p><a href="http://pry.github.com/">Pry</a> est une alternative &agrave; IRB et, comme IRB, il fournit une invite de commande permettant d&#x27;ex&eacute;cuter du code Ruby. Ce qui fait la diff&eacute;rence, c&#x27;est un nombre important de fonctionnalit&eacute;s en plus. Dans cet &eacute;pisode, nous allons vous montrer comment Pry fonctionne et comment l&#x27;int&eacute;grer dans vos applications Rails.</p>

<p>Pry est fournit sous forme de gem et est facile &agrave; installer. Nous allons &eacute;galement installer la gem <code>pry-doc</code>, nous reviendrons dessus plus loin.</p>

<pre class="terminal">$ gem install pry pry-doc</pre>

<p>Comme nous utilisons les gemsets RVM, nous allons installer Pry de mani&egrave;re &agrave; ce qu&#x27;il soit accessible globalement, peu importe le gemset utilis&eacute;. Nous pouvons le faire gr&acirc;ce aux deux commandes suivantes.</p>

<pre class="terminal">$ rvm gemset use global
$ gem install pry pry-doc</pre>

<p>Une fois Pry install&eacute;, nous pouvons lancer la commande <code>pry</code> et ex&eacute;cuter du code Ruby comme nous le ferions avec irb.</p>

<pre class="terminal">$ pry
pry(main)&gt; 1 + 2
=&gt; 3</pre>

<p>Pry est bien plus qu&#x27;un simple calculateur mais, avant d&#x27;aller plus loin, nous allons voir comment le faire fonctionner avec une application Rails. Nous allons utiliser l&#x27;application de blog qui nous a d&eacute;j&agrave; servi dans de pr&eacute;c&eacute;dents &eacute;pisodes.</p>

<div class="imageWrapper">
  <img src="/system/photos/727/original/E280I01.png" width="815" height="452" alt="Notre application de blog."/>
</div>

<p>Si nous lan&ccedil;ons <code>rails c</code> depuis le dossier de l&#x27;application, IRB va d&eacute;marrer. Pour utiliser Pry &agrave; la place, nous devons juste appeler la commande <code>pry</code> et lui passer le fichier d&#x27;environnement Rails. Cela fait, nous pouvons acc&eacute;der aux mod&egrave;les de notre application, comme dans la console Rails classique.</p>

<pre class="terminal">$ pry -r ./config/environment
pry(main)&gt; Article.count
=&gt; 3</pre>

<p>Maintenant que Pry est en place, nous pouvons voir certaines de ses fonctionnalit&eacute;s de plus pr&egrave;s. Si nous tapons <code>help</code>, nous allons obtenir la liste de toutes les commandes &agrave; notre disposition. Les deux que nous allons utiliser le plus souvent sont <code>cd</code> et <code>ls</code>, jetons-y un &oelig;il. La commande <code>cd</code> change le scope courant. Si nous tapons <code>cd Article</code>, nous allons nous placer dans la classe <code>Article</code>. Nous pouvons connaitre le scope courant &agrave; tout moment en appelant <code>self</code>.</p>

<pre class="terminal">pry(main)&gt; cd Article
pry(#&lt;Class:0x1022f60e0&gt;):1&gt; self
=&gt; Article(id: integer, name: string, content: text, created_at: datetime, updated_at: datetime, published_at: datetime)</pre>

<p>Maintenant que nous somme dans la classe Article, nous pouvons appeler n&#x27;importe laquelle de ses m&eacute;thodes, <code>first</code> par exemple, pour retourner le premier article, comme si nous appelions <code>Article.first</code>.</p>

<pre class="terminal">pry(#&lt;Class:0x1022f60e0&gt;):1&gt; first
=&gt; #&lt;Article id: 1, name: &quot;What is Music&quot;, content: &quot;Music is an art form in which the medium is sound o...&quot;, created_at: &quot;2011-08-24 20:35:29&quot;, updated_at: &quot;2011-08-24 20:37:22&quot;, published_at: &quot;2011-05-13 23:00:00&quot;&gt;</pre>

<p>Nous pouvons &eacute;galement faire <code>cd</code> sur un objet. Si nous appelons <code>cd first</code> en &eacute;tant dans le scope <code>Article</code>, nous allons changer de scope pour &ecirc;tre dans celui du premier article. Nous pouvons d&egrave;s lors appeler n&#x27;importe quelle m&eacute;thode ou propri&eacute;t&eacute; dessus, <code>name</code> par exemple.</p>

<pre class="terminal">pry(#&lt;Class:0x1022f60e0&gt;):1&gt; cd first
pry(#&lt;Article:0x102300c98&gt;):2&gt; name
=&gt; &quot;What is Music&quot;</pre>

<p>Nous pouvons m&ecirc;me faire <code>cd</code> dans le <code>name</code> de l&#x27;article et appeler des m&eacute;thodes sur cette chaine de caract&egrave;res.</p>

<pre class="terminal">pry(#&lt;Article:0x102300c98&gt;):2&gt; cd name
pry(&quot;What is Music&quot;):3&gt; upcase
=&gt; &quot;WHAT IS MUSIC&quot;</pre>

<p>Pry conserve une trace de nos d&eacute;placements que nous pouvons voir en appelant <code>nesting</code>.</p>

<pre class="terminal">pry(&quot;What is Music&quot;):3&gt; nesting
Nesting status:
--
0. main (Pry top level)
1. #&lt;Class:0x1022f60e0&gt;
2. #&lt;Article:0x102300c98&gt;
3. &quot;What is Music&quot;</pre>

<p>Cette commande retourne une liste des objets que nous avons travers&eacute;. Si nous tapons <code>exit</code>, nous allons remonter dans l&#x27;objet pr&eacute;c&eacute;dant, dans notre cas, le premier article. Si nous remontons de nouveau, nous serons de retour dans la classe <code>Article</code>.</p>

<p>L&#x27;autre commande fr&eacute;quemment utilis&eacute;e est <code>ls</code>. Cette commande liste les variables et m&eacute;thodes. Par d&eacute;faut, elle va lister celles du scope courant. Si, par exemple, nous sommes dans la classe <code>Article</code>, nous verrons ses m&eacute;thodes lorsque nous appellerons <code>ls</code>.</p>

<pre class="terminal">pry(#&lt;Class:0x1022f60e0&gt;):1&gt; ls
[:_, :_pry_, :inp, :out, :@_create_callbacks, :@_defined_class_methods, :@_save_callbacks, :@_update_callbacks, :@_validate_callbacks, :@arel_engine, :@arel_table, :@attribute_methods_generated, :@cached_attributes, :@column_names, :@columns, :@columns_hash, :@finder_needs_type_condition, :@generated_attribute_methods, :@inheritable_attributes, :@inheritance_column, :@parent_name, :@quoted_primary_key, :@quoted_table_name, :@relation]</pre>

<p>Certaines commandes Pry supportent des options et nous pouvons obtenir une liste des options d&#x27;une commande en la lan&ccedil;ant avec l&#x27;option <code>-h</code>. Si nous lan&ccedil;ons <code>ls -h</code>, nous verrons la liste des options qu&#x27;elle supporte, y compris <code>-m</code> qui permet de lister les m&eacute;thodes de classe et <code>-M</code> qui liste les m&eacute;thodes d&#x27;instance. Nous pouvons &eacute;galement passer en param&egrave;tre un objet ou une classe pour obtenir une liste des m&eacute;thodes de celui-ci plut&ocirc;t que pour le scope courant.</p>

<p>Une autre commande Pry utile est <code>show-doc</code>. Disons que nous voulons savoir comment fonctionne la m&eacute;thode <code>in_groups_of</code> de la classe <code>Array</code>. Nous pouvons le savoir en lan&ccedil;ant <code>show-doc Array#in_groups_of</code>.</p>

<pre class="terminal">pry(#&lt;Class:0x1022f60e0&gt;):1&gt; show-doc Array#in_groups_of

From: /Users/eifion/.rvm/gems/ruby-1.9.2-p290/gems/activesupport-3.0.10/lib/active_support/core_ext/array/grouping.rb @ line 19:
Number of lines: 15

signature: in_groups_of(number, fill_with=?)

Splits or iterates over the array in groups of size number,
padding any remaining slots with fill_with unless it is false.

  %w(1 2 3 4 5 6 7).in_groups_of(3) {|group| p group}
  [&quot;1&quot;, &quot;2&quot;, &quot;3&quot;]
  [&quot;4&quot;, &quot;5&quot;, &quot;6&quot;]
  [&quot;7&quot;, nil, nil]

  %w(1 2 3).in_groups_of(2, &#x27;&amp;nbsp;&#x27;) {|group| p group}
  [&quot;1&quot;, &quot;2&quot;]
  [&quot;3&quot;, &quot;&amp;nbsp;&quot;]

  %w(1 2 3).in_groups_of(2, false) {|group| p group}
  [&quot;1&quot;, &quot;2&quot;]
  [&quot;3&quot;]</pre>

<p>Nous pouvons &eacute;galement appeler <code>show-doc</code> directement sur un objet. Notre scope courant est celui de la classe <code>Article</code>, nous pouvons donc appeler <code>all</code> pour obtenir un tableau des articles. Nous pouvons ensuite lancer <code>show-doc all.in_groups_of</code> pour voir la m&ecirc;me documentation que ci-dessus.</p>

<p>Autre commande utile, <code>show-method</code>. Cette derni&egrave;re nous montre le code source d&#x27;une m&eacute;thode. Nous pouvons l&#x27;utiliser pour voir la source de <code>in_groups_of</code> (notons que Pry offre l&#x27;auto-compl&eacute;tion des commandes gr&acirc;ce &agrave; la touche TAB). </p>

<pre class="terminal">pry(#&lt;Class:0x104e63de0&gt;):1&gt; show-method all.in_groups_of

From: /Users/eifion/.rvm/gems/ruby-1.9.2-p290/gems/activesupport-3.0.10/lib/active_support/core_ext/array/grouping.rb @ line 19:
Number of lines: 19

def in_groups_of(number, fill_with = nil)
  if fill_with == false
    collection = self
  else
    # size % number gives how many extra we have;
    # subtracting from number gives how many to add;
    # modulo number ensures we don&#x27;t add group of just fill.
    padding = (number - size % number) % number
    collection = dup.concat([fill_with] * padding)
  end

  if block_given?
    collection.each_slice(number) { |slice| yield(slice) }
  else
    groups = []
    collection.each_slice(number) { |group| groups &lt;&lt; group }
    groups
  end
end</pre>

<p>Conjointement, nous trouvons la commande <code>edit-method</code>. Lorsque nous la lan&ccedil;ons en lui passant une m&eacute;thode en param&egrave;tre, elle va ouvrir le fichier ad&eacute;quat dans un &eacute;diteur de texte et nous placer sur la ligne appropri&eacute;e.</p>

<p>Nous pouvons &eacute;galement lancer une commande shell en la pr&eacute;fixant d&#x27;un point. Si nous lan&ccedil;ons <code>.ls</code> dans Pry, la commande shell <code>ls</code> va &ecirc;tre appel&eacute;e et va lister les fichiers du dossier courant.</p>

<p>Pry est &eacute;galement tr&egrave;s utile pour le debug. Dans notre mod&egrave;le <code>Article</code>, nous avons une m&eacute;thode <code>word_count</code> qui devrait retourner le nombre de mots dans le contenu d&#x27;un article. Il y a un bug dans cette m&eacute;thode car elle retourne toujours <code>0</code>, quelque soit le contenu de l&#x27;article. Nous pouvons voir la m&eacute;thode en faisant <code>cd</code> dans le premier <code>Article</code> et en lan&ccedil;ant <code>edit-method word_count</code>. Cette m&eacute;thode ressemble &agrave; ceci&nbsp;:</p>

<pre class="codeFilePath">/app/models/article.rb</pre>
<pre class="ruby">class Article &lt; ActiveRecord::Base
  attr_accessible :name, :content, :published_at
  has_many :comments

  def word_count
    words = content.scan(/\\w+/)
    words.size
  end
end</pre>

<p>Nous pouvons ajouter un breakpoint &agrave; n&#x27;importe quel endroit du code en appelant <code>binding.pry</code>. Si nous le faisons juste avant la ligne <code>words.size</code> et sauvons le fichier, lorsque nous appelons la m&eacute;thode <code>word_count</code> de nouveau, l&#x27;ex&eacute;cution va s&#x27;arr&ecirc;ter sur <code>binding.pry</code> et nous redonner la main sur Pry.</p>

<pre class="terminal">&gt; word_count

From: /Users/eifion/blog/app/models/article.rb @ line 7 in Article#word_count:

     2:   attr_accessible :name, :content, :published_at
     3:   has_many :comments
     4: 
     5:   def word_count
     6:     words = content.scan(/\\w+/)
 =&gt;  7:     binding.pry
     8:     words.size
     9:   end
    10: end</pre>

<p>Nous avons acc&egrave;s &agrave; toutes les variables locales &agrave; la m&eacute;thode. Nous pouvons donc appeler <code>words</code> pour voir le contenu du tableau <code>words</code>.</p>

<pre class="terminal">pry(#&lt;Article:0x1008c3f38&gt;):3&gt; words
=&gt; []</pre>

<p>Le tableau est vide, il semble donc qu&#x27;il y ait un probl&egrave;me avec l&#x27;expression r&eacute;guli&egrave;re qui scanne le contenu. Si nous y jetons un &oelig;il, nous voyons qu&#x27;il y a deux backslashes l&agrave; o&ugrave; il ne devrait y en avoir qu&#x27;un seul. Pour corriger cela, nous pouvons de nouveau faire appel &agrave; <code>edit-method word_count</code>, corriger l&#x27;expression, retirer <code>binding.pry</code> et sauver le fichier.</p>

<p class="codeFilePath">/app/models/article.rb</p>
<pre class="ruby">class Article &lt; ActiveRecord::Base
  attr_accessible :name, :content, :published_at
  has_many :comments

  def word_count
    words = content.scan(/\w+/)
    words.size
  end
end</pre>

<p>Nous pouvons tester notre correctif en appelant une nouvelle fois <code>word_count</code>. Cette fois, elle fonctionne comme d&eacute;sir&eacute;.</p>

<pre class="terminal">pry(#&lt;Article:0x1008c3f38&gt;):3&gt; word_count
=&gt; 55</pre>

<p>Nous avons parfois besoin de debugger un contr&ocirc;leur ou une vue de notre application et la console Rails n&#x27;est pas toujours le plus simple pour cela. Pry nous aide &eacute;galement &agrave; le faire. Tout d&#x27;abord, nous devons ajouter Pry &agrave; notre Gemfile.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">source &#x27;http://rubygems.org&#x27;

gem &#x27;rails&#x27;, &#x27;3.0.10&#x27;
gem &#x27;sqlite3&#x27;
gem &#x27;nifty-generators&#x27;
gem &#x27;pry&#x27;, :group =&gt; :development</pre>

<p>Nous appelons ensuite <code>bundle</code> pour installer la gem puis nous lan&ccedil;ons <code>rails s</code> pour d&eacute;marrer le serveur. Nous pouvons maintenant ajouter un appel &agrave; <code>binding.pry</code> n&#x27;importe o&ugrave; dans nos contr&ocirc;leurs pour ajouter un breakpoint.</p>

<p class="codeFilePath">/app/controllers/articles_controller.rb</p>
<pre class="ruby">def index
  @articles = Article.all
  binding.pry
end</pre>

<p>Si nous visitons cette page dans le navigateur, elle va bloquer sur le chargement. Dans le terminal, on peut voir une invite de commande Pry et nous sommes dans le contexte du breakpoint. Comme nous le faisions dans les mod&egrave;les, nous pouvons inspecter les valeurs de toutes les variables locales. Une fois notre travail termin&eacute;, nous pouvons taper <code>exit-all</code> pour permettre &agrave; la requ&ecirc;te de se terminer.</p>

<pre class="terminal">From: /Users/eifion/blog/app/controllers/articles_controller.rb @ line 4 in ArticlesController#index:

     1: class ArticlesController &lt; ApplicationController
     2:   def index
     3:     @articles = Article.all
 =&gt;  4:     binding.pry
     5:   end
     6: 
     7:   def show
     8:     @article = Article.find(params[:id])
     9:   end</pre>
     
<p>C&#x27;est tout pour cet &eacute;pisode sur Pry. C&#x27;est une gem tr&egrave;s utile et elle fournit bien plus de fonctionnalit&eacute;s que ce que nous venons de vous montrer. Le <a href="https://github.com/pry/pry/wiki">wiki</a> couvre beaucoup plus et contient un lien vers un tr&egrave;s bon <a href="http://vimeo.com/26391171">screencast</a> r&eacute;alis&eacute; par Joshua Cheek.</p>
