<p>Alguns epis&oacute;dios atr&aacute;s <a href="http://asciicasts.com/episodes/188-declarative-authorization">n&oacute;s falamos sobre o Declarive Authorization</a>. Embora ele seja um excelente plugin de autoriza&ccedil;&atilde;o para o Rails, ele pode ser um pouco pesado para sites mais simples. Depois de escrever o <a href="http://railscasts.com/episodes/188-declarative-authorization"> Railscast sobre Declarative Authorization</a>, Ryan Bates buscou uma solu&ccedil;&atilde;o alternativa e, n&atilde;o conseguindo encontrar uma que se adaptasse &agrave;s suas necessidades, decidiu escrever a sua solu&ccedil;&atilde;o, <a href="http://github.com/ryanb/cancan">CanCan</a>. CanCan &eacute; um plugin de autoriza&ccedil;&atilde;o simples e Ryan tentou manter tudo o mais simples poss&iacute;vel enquanto estava desenvolvendo. Vamos dar uma olhada.</p>

<p>Nesse epis&oacute;dio, vamos trabalhar com a mesma aplica&ccedil;&atilde;o de um blog b&aacute;sico que usamos no epis&oacute;dio do Declarative Authorization. A aplica&ccedil;&atilde;o tem uma s&eacute;rie de artigos, cada qual pertence a um usu&aacute;rio e pode ter muitos coment&aacute;rios associados.</p>

<div class="imageWrapper">
  <img src="/system/photos/264/original/E192I01.png" width="815" height="606" alt="The article page in our application."/>
</div>

<p>Repare na imagem acima que, embora n&atilde;o haja usu&aacute;rio logado, os links para editar e destruir artigos e coment&aacute;rios s&atilde;o vis&iacute;veis. Queremos utilizar as autoriza&ccedil;&otilde;es para restringir o acesso ao que cada usu&aacute;rio pode fazer. J&aacute; temos a autentica&ccedil;&atilde;o no aplicativo para que os usu&aacute;rios possam se inscrever e efetuar o login. Usamos Authlogic para fazer isso, mas qualquer solu&ccedil;&atilde;o de autentica&ccedil;&atilde;o funciona.</p>

<p>Na p&aacute;gina de login, temos uma s&eacute;rie de caixas de sele&ccedil;&atilde;o para permitir que o usu&aacute;rio selecione os pap&eacute;is que ele quer ter. Um administrador ter&aacute; permiss&atilde;o para fazer tudo, um moderador pode editar coment&aacute;rios de qualquer pessoa e um autor pode criar artigos e atualizar os artigos que escreveu. Os usu&aacute;rios que n&atilde;o pertencem a nenhum papel podem comentar e atualizar os seus coment&aacute;rios.</p>

<div class="imageWrapper">
  <img src="/system/photos/265/original/E192I02.png" width="800" height="510" alt="The signup page showing the roles checkboxes."/>
</div>

<h3>Instalando o CanCan</h3>

<p>CanCan is fornecido como uma gem. Para adicion&aacute;-lo a sua aplica&ccedil;&atilde;o, precisamos adicionar a seguinte linha ao bloco  
<code>Rails::Initializer.run</code> do arquivo <code>/config/environment.rb</code>.</p>

<pre class="ruby">
config.gem &quot;cancan&quot;
</pre>

<p>Podemos ent&atilde;o ter certeza de que a gem est&aacute; instalada executando:</p>

<pre class="terminal">sudo rake gems:install</pre>

<p>Se voc&ecirc; tinha instalado uma vers&atilde;o anterior do CanCan, voc&ecirc; precisa ter certeza de que atualizou para a vers&atilde;o mais recente, pois h&aacute; algumas funcionalidades que s&oacute; est&atilde;o dispon&iacute;veis a partir da vers&atilde;o 1.0.0.</p>

<h3>Usando o CanCan</h3>

<p>Para usar o CanCan, precisamos criar uma nova classe chamada <code>Ability</code>, que vamos colocar na pasta <code>/app/models</code>. A classe tem que incluir o m&oacute;dulo <code>CanCan::Ability</code> e tamb&eacute;m o m&eacute;todo <code>initialize</code>, que recebe um objeto usu&aacute;rio como par&acirc;metro. &Eacute; nesse m&eacute;todo que vamos definir as habilidades para cada tipo de usu&aacute;rio.</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)

  end
end
</pre>

<p>As habilidades s&atilde;o definidas com o m&eacute;todo de tr&ecirc;s letras &quot;can&quot;, o qual &eacute; o cora&ccedil;&atilde;o do CanCan. Esse m&eacute;todo tem dois par&acirc;metros: o primeiro &eacute; a a&ccedil;&atilde;o que desejamos realizar, e o segundo &eacute; a classe de modelo em que a a&ccedil;&atilde;o ser&aacute; aplicada. Alternativamente, para aplicar uma a&ccedil;&atilde;o a todos os modelos, podemos passar <code>:all</code>. Se queremos que todos os usu&aacute;rios sejam capazes de ler todos os modelos, podemos fazer isso:</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    can :read, :all
  end
end
</pre>

<p>Na nossa defini&ccedil;&atilde;o de autoriza&ccedil;&atilde;o, ningu&eacute;m pode editar ou apagar artigos ou coment&aacute;rios, mas ainda h&aacute; os links para as actions edit e destroy na p&aacute;gina de cada artigo. No c&oacute;digo da view da action show do artigo, podemos usar o m&eacute;todo <code>can?</code> (note o ponto de interroga&ccedil;&atilde;o) para determinar se o usu&aacute;rio atual est&aacute; autorizado a executar a action de cada link. Enquanto o m&eacute;todo <code>can</code> pode definir as habilidades, <code>can?</code> &eacute; um m&eacute;todo booleano que determina se o usu&aacute;rio atual tem essa habilidade. Como <code>can</code>, <code>can?</code> tem dois par&acirc;metros, uma action e um modelo, nesse caso, um artigo. Usaremos <code>can?</code> na view show para que os links de editar e apagar fiquem ocultos a menos que o usu&aacute;rio atual tenha a habilidade adequada. Para fazer isso, vamos colocar os links de artigos dentro de um comando <code>if</code> de forma que eles s&oacute; ser&atilde;o mostrados se o usu&aacute;rio atual puder executar a a&ccedil;&atilde;o apropriada em um artigo.</p>

<pre class="ruby">
&lt;p&gt;
  &lt;% if can? :update, @article %&gt;
    &lt;%= link_to &quot;Edit&quot;, edit_article_path(@article) %&gt; |
  &lt;% end %&gt;
  &lt;% if can? :destroy, @article %&gt;
    &lt;%= link_to &quot;Destroy&quot;, @article, :method =&gt; :delete, :confirm =&gt; &quot;Are you sure?&quot; %&gt; |
  &lt;% end %&gt;
  &lt;%= link_to &quot;Back to Articles&quot;, articles_path %&gt;
&lt;/p&gt;
</pre>

<p>Mais abaixo, no c&oacute;digo da mesma view, vamos fazer uma mudan&ccedil;a semelhante para cada link de coment&aacute;rio.</p>

<pre class="ruby">
&lt;p&gt;
  &lt;% if can? :update, comment %&gt;
    &lt;%= link_to &quot;Edit&quot;, edit_comment_path(comment) %&gt; |
  &lt;% end %&gt;
  &lt;% if can? :destroy, comment %&gt;
    &lt;%= link_to &quot;Destroy&quot;, comment, :method =&gt; :delete, :confirm =&gt; &quot;Are you sure?&quot; %&gt;
  &lt;% end %&gt;
&lt;/p&gt;
</pre>

<p>Podemos agora carregar a p&aacute;gina de um artigo e ver que os links para editar ou apagar artigos e coment&aacute;rios sumiram, pois n&atilde;o h&aacute; usu&aacute;rios com a habilidade de editar ou alter&aacute;-los.</p>

<div class="imageWrapper">
  <img src="/system/photos/266/original/E192I03.png" width="815" height="416" alt="The links are now hidden."/>
</div>

<h3>Protegendo os Controllers</h3>

<p>Embora tenhamos removido os links para editar artigos e coment&aacute;rios as pr&oacute;prias actions ainda est&atilde;o dispon&iacute;veis e se visitarmos diretamente a action edit para um artigo, ainda podemos atualiz&aacute;-lo. Portanto, assim como fizemos altera&ccedil;&otilde;es na camada view, ser&aacute; necess&aacute;rio modificarmos nossos controllers de modo que usu&aacute;rios possam acessar apenas as actions que est&atilde;o autorizados. Existem duas maneiras de fazermos isso com o CanCan. A primeira funciona no n&iacute;vel de uma action e vamos usar a action edit do <code>ArticleController</code> como exemplo.</p>

<pre class="terminal">
def edit
  @article = Article.find(params[:id])
  unauthorized! if cannot? :edit, @article
end
</pre>

<p>Para parar a action que est&aacute; sendo executada, chamamos <code>unauthorized!</code>, que ir&aacute; gerar uma exce&ccedil;&atilde;o. Obviamente, n&oacute;s s&oacute; queremos essa exce&ccedil;&atilde;o levantada se o usu&aacute;rio n&atilde;o tem a devida autoriza&ccedil;&atilde;o. Para verificar a autoriza&ccedil;&atilde;o, podemos usar <code>can</code> como fizemos na view ou, como temos aqui, <code>cannot?</code>.</p>

<p>Se tentarmos acessar a action edit diretamente agora, seremos interrompidos e uma exce&ccedil;&atilde;o ser&aacute; lan&ccedil;ada.</p>

<div class="imageWrapper">
  <img src="/system/photos/267/original/E192I04.png" width="815" height="416" alt="An exception will be raised if an attempt to access an unauthorized action is made."/>
</div>

<p>Poder&iacute;amos repetir isso em todas as actions de nossos controllers, mas como estamos usando a conven&ccedil;&atilde;o RESTful, h&aacute; uma maneira mais f&aacute;cil de fazer isso. Na parte superior dos controllers, podemos chamar <code>load_and_authorize_resource</code> que ir&aacute; carregar e autorizar o recurso adequado em um before filter. Como esse m&eacute;todo carrega o recurso necess&aacute;rio para n&oacute;s, com base na action, podemos eliminar as linhas de c&oacute;digo que criam uma vari&aacute;vel de inst&acirc;ncia para cada action (nesse caso, @article), tornando nosso <code>ArticlesController</code> parecido com isso:</p>

<pre class="ruby">
class ArticlesController &lt; ApplicationController

  load_and_authorize_resource

  def index
    @articles = Article.all
  end

  def show
    @comment = Comment.new(:article =&gt; @article)
  end

  def new
  end

  def create
    @article.user = current_user
    if @article.save
      flash[:notice] = &quot;Successfully created article.&quot;
      redirect_to @article
    else
      render :action =&gt; &#x27;new&#x27;
    end
  end

  def edit
  end

  def update
    if @article.update_attributes(params[:article])
      flash[:notice] = &quot;Successfully updated article.&quot;
      redirect_to @article
    else
      render :action =&gt; &#x27;edit&#x27;
    end
  end

  def destroy
    @article.destroy
    flash[:notice] = &quot;Successfully destroyed article.&quot;
    redirect_to articles_url
  end
end
</pre>

<p>Com isso os usu&aacute;rios existentes n&atilde;o ser&atilde;o capazes de criar, editar ou excluir todos os artigos.</p>

<p>N&oacute;s vamos ter que fazer uma mudan&ccedil;a semelhante no <code>CommentsController</code> para restringir o acesso &agrave;s suas actions tamb&eacute;m. Mais uma vez vamos usar <code>load_and_authorize_resources</code> para carregar um recurso <code>Comment</code> e verificar a autoriza&ccedil;&atilde;o para ele. Se o <code>Comment</code> &eacute; um recurso aninhado com <code>Article</code> nas rotas, podemos usar: <code>:nested</code> com o <code>load_and_authorize_resources</code> para carregar os coment&aacute;rios atrav&eacute;s do recurso <code>Article</code>.</p>

<pre class="ruby">
load_and_authorize_resource :nested =&gt; :article
</pre>

<p>N&atilde;o estamos usando aninhamento aqui, dessa forma, n&atilde;o precisamos fazer isso.</p>

<h3>Adicionando Habilidades</h3>

<p>Agora que nossa aplica&ccedil;&atilde;o &eacute; segura, podemos come&ccedil;ar a definir as habilidades que cada papel ter&aacute;. Isso &eacute; feito na classe <code>Ability</code> que criamos anteriormente. As habilidades que definimos no m&eacute;todo <code>initialize</code> ser&aacute; refletida pelo resto da nossa aplica&ccedil;&atilde;o.</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    can :read, :all
  end
end
</pre>

<p>Passamos o usu&aacute;rio atual para o m&eacute;todo <code>initialize</code> assim n&oacute;s podemos mudar as habilidades de acordo com o usu&aacute;rio logado no momento. Vamos come&ccedil;ar com os usu&aacute;rios na fun&ccedil;&atilde;o de administrador, que devem ser capazes de gerenciar tudo.</p>

<p>O usu&aacute;rio passado para o m&eacute;todo <code>initialize</code> pode ser objeto de qualquer tipo, o que significa que a autentica&ccedil;&atilde;o &eacute; completamente dissociada da autoriza&ccedil;&atilde;o. O que define um usu&aacute;rio como, por exemplo, um administrador depende inteiramente do sistema de autentica&ccedil;&atilde;o utilizado. Poder&iacute;amos, por exemplo, ter um m&eacute;todo boolean <code>admin?</code> no nosso modelo <code>User</code>. Em nossa aplica&ccedil;&atilde;o, o usu&aacute;rio pode ter muitos pap&eacute;is e n&oacute;s vamos ter um m&eacute;todo <code>role?</code> para nos dizer se o usu&aacute;rio &eacute; membro de um papel. Vamos usar esse m&eacute;todo para definir as habilidades.</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    if user.role? :admin
      can :manage, :all
    else
      can :read, :all
    end
  end
end
</pre>

<p>Nosso c&oacute;digo agora verifica se o usu&aacute;rio atual &eacute; um administrador e, se assim permite gerenciar todos os modelos. Passando <code>:manage</code> como uma a&ccedil;&atilde;o, significa que o usu&aacute;rio pode executar todas as a&ccedil;&otilde;es em um modelo.</p>

<p>Ainda precisamos definir o m&eacute;todo <code>role?</code> no modelo <code>User</code>. N&oacute;s criamos os pap&eacute;is aqui da mesma forma que fizemos no Epis&oacute;dio 189 [<a href="http://railscasts.com/episodes/189-embedded-association">assistir</a>, <a href="http://asciicasts.com/episodes/189-embedded-association">ler</a>], mas n&atilde;o importa como voc&ecirc; configura os seus pap&eacute;is, desde que voc&ecirc; possa determinar quais os pap&eacute;is ou fun&ccedil;&otilde;es que um usu&aacute;rio pertence.</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base
  acts_as_authentic
  has_many :articles
  has_many :comments

  named_scope :with_role, lambda { |role| {:conditions =&gt; &quot;roles_mask &amp; #{2**ROLES.index(role.to_s)} &gt; 0 &quot;} }

  ROLES = %w[admin moderator author editor]

  def roles=(roles)
    self.roles_mask = (roles &amp; ROLES).map { |r| 2**ROLES.index(r) }.sum
  end

  def roles
    ROLES.reject { |r| ((roles_mask || 0) &amp; 2**ROLES.index(r)).zero? }
  end

  def role?(role)
    roles.include? role.to_s
  end

end
</pre>

<p>O m&eacute;todo <code>role?</code> que n&oacute;s adicionamos aqui, verifica que o papel passado est&aacute; inclu&iacute;do nos pap&eacute;is do usu&aacute;rio.</p>

<p>De volta &agrave; classe <code>Ability</code>, precisamos fazer mais uma mudan&ccedil;a. No m&eacute;todo <code>initialize</code> estamos verificando se o usu&aacute;rio pertence a um papel, mas para usu&aacute;rios visitantes - que n&atilde;o est&atilde;o logados ainda por exemplo - <code>user</code> ser&aacute; <code>nil</code>. Poder&iacute;amos verificar se &eacute; <code>nil</code> antes de tentarmos verificar o papel do usu&aacute;rio, mas em vez disso, vamos criar um usu&aacute;rio convidado, se o usu&aacute;rio passado for <code>nil</code>. Desta forma, ainda podemos chamar m&eacute;todos como o <code>role?</code> para os usu&aacute;rios que ainda n&atilde;o tenham criado uma conta.</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    user ||= User.new # Guest user
    if user.role? :admin
      can :manage, :all
    else
      can :read, :all
    end
  end
end
</pre>

<p>Se voltarmos para a nossa aplica&ccedil;&atilde;o novamente, ainda n&atilde;o somos capazes de editar ou apagar coment&aacute;rios, mas se logarmos como um usu&aacute;rio com o papel de admin, ent&atilde;o os links ser&atilde;o mostrados.</p>

<div class="imageWrapper">
  <img src="/system/photos/268/original/E192I05.png" width="816" height="458" alt="The links are visible again for administrators."/>
</div>

<p>Tendo conseguido a autoriza&ccedil;&atilde;o funcionando para os administradores, precisamos agora criar as habilidades para os outros pap&eacute;is. Vamos come&ccedil;ar com usu&aacute;rios convidados, aqueles que n&atilde;o t&ecirc;m fun&ccedil;&otilde;es atribu&iacute;das a eles. Eles devem ser capazes de criar coment&aacute;rios e atualizar coment&aacute;rios que escreveram. Para fazer isso vamos alterar a nossa classe <code>Ability</code> da seguinte forma:</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    user ||= User.new

    if user.role? :admin
      can :manage, :all
    else
      can :read, :all
      can :create, Comment
      can :update, Comment do |comment|
        comment.try(:user) == user
      end
    end
  end
end
</pre>

<p>Escrever o c&oacute;digo para habilitar usu&aacute;rios convidados a criar coment&aacute;rios &eacute; simples, mas o c&oacute;digo de atualiza&ccedil;&atilde;o &eacute; um pouco mais complicado, pois os usu&aacute;rios s&oacute; devem ser capazes de atualizar os coment&aacute;rios que escreveram. Para fazer isso, podemos passar um bloco que vai passar um objeto do modelo que estamos verificando. O bloco deve retornar <code>true</code> ou <code>false</code> dependendo se o recurso deve ser permitido. No bloco vamos verificar se o dono do coment&aacute;rio &eacute; o usu&aacute;rio atual. H&aacute; a possibilidade do coment&aacute;rio n&atilde;o ter dono, ent&atilde;o vamos usar o m&eacute;todo <code>try</code> do Rails para tentar ler o atributo usu&aacute;rio de forma que <code>nil</code> &eacute; devolvido se o usu&aacute;rio &eacute; nulo em vez de uma exce&ccedil;&atilde;o ser lan&ccedil;ada.</p>

<p>Se logarmos como um usu&aacute;rio que n&atilde;o tem pap&eacute;is agora, podemos adicionar um coment&aacute;rio e atualiz&aacute;-lo, mas n&atilde;o os coment&aacute;rios feitos por outros.</p>

<div class="imageWrapper">
  <img src="/system/photos/269/original/E192I06.png" width="815" height="543" alt="Guest users can edit only their own comments."/>
</div>

<p>Agora vamos modificar o c&oacute;digo e adicionar as habilidades para moderadores. Moderadores devem poder modificar quaisquer coment&aacute;rios, ent&atilde;o vamos modificar a habilidade de atualizar coment&aacute;rios para permitir isso.</p>

<pre class="ruby">
can :update, Comment do |comment|
  comment.try(:user) == user || user.role?(:moderator)
end
</pre>

<p>N&oacute;s temos um papel a mais para cobrir: o autor. Os autores devem poder criar artigos e modificar todos os artigos que eles escreveram. Para adicionar essas capacidades, s&oacute; precisamos adicionar o seguinte c&oacute;digo para a classe <code>Ability</code>.</p>

<pre class="ruby">
class Ability
  include CanCan::Ability

  def initialize(user)
    user ||= User.new

    if user.role? :admin
      can :manage, :all
    else
      can :read, :all
      can :create, Comment
      can :update, Comment do |comment|
        comment.try(:user) == user || user.role?(:moderator)
      end
      if user.role?(:author)
        can :create, Article
        can :update, Article do |article|
          article.try(:user) == user
        end
      end
    end
  end
end
</pre>

<p>Como fizemos com os usu&aacute;rios visitantes e coment&aacute;rios, passamos o artigo atual para um bloco e na habilidade de atualiza&ccedil;&atilde;o de artigo verificamos se o dono do artigo &eacute; o usu&aacute;rio atual.</p>

<p>Agora temos todas as nossas habilidades definidas para cada papel de usu&aacute;rio. O bom do CanCan &eacute; que ele nos permite definir todas as habilidades em um s&oacute; local e as altera&ccedil;&otilde;es ser&atilde;o refletidas no resto da aplica&ccedil;&atilde;o.</p>

<h3>Uma P&aacute;gina de Erros Mais Bonita</h3>

<p>Se um usu&aacute;rio solicita uma a&ccedil;&atilde;o que n&atilde;o tem acesso, ver&aacute; uma p&aacute;gina de erro bastante feia mostrando uma exce&ccedil;&atilde;o <code>AccessDenied</code>. N&oacute;s podemos mudar isso para que ele veja uma p&aacute;gina de erro melhor, com apar&ecirc;ncia personalizada.</p>

<p>O Rails fornece um m&eacute;todo chamado <code>rescue_from</code> que podemos colocar em nosso <code>ApplicationController</code>. Vamos passar um bloco e dentro fazer a aplica&ccedil;&atilde;o mostrar uma mensagem de erro e redirecionar para a p&aacute;gina inicial.</p>

<pre class="ruby">
rescue_from CanCan::AccessDenied do |exception|
  flash[:error] = &quot;Access denied!&quot;
  redirect_to root_url
end
</pre>

<p>Se um usu&aacute;rio sem pap&eacute;is agora tentar editar um artigo digitando a url diretamente, ele ser&aacute; redirecionado para a p&aacute;gina inicial dizendo que ele n&atilde;o pode fazer isso.</p>

<div class="imageWrapper">
  <img src="/system/photos/270/original/E192I07.png" width="818" height="359" alt="An flash message is shown if an attempt to access an unauthorized action is made."/>
</div>

<p>&Eacute; isso. Para mais informa&ccedil;&otilde;es ou para relatar um problema, visite <a href="http://github.com/ryanb/cancan">a p&aacute;gina do projeto no GitHub do Ryan</a>.</p>