<p>A los que hayan usado Rails alguna vez les resultar&aacute;n familiares los generadores y habr&aacute;n utilizado el comando <code>script/generate</code> para crear modelos, controladores, andamiajes, etc&eacute;tera.  En Rails 3 los generadores han sido reescritos en su totalidad, siendo muy diferentes de los de la versi&oacute;n 2.   De entrada ahora son mucho m&aacute;s modulares y esto quiere decir que son m&aacute;s f&aacute;ciles de adaptar seg&uacute;n nuestras preferencias.</p>

<p>Si en el directorio ra&iacute;z de una aplicaci&oacute;n Rails 3 ejecutamos <code>rails g</code> veremos la lista de los generadores disponibles en esa aplicaci&oacute;n.  Si no hemos creado nuestros propios generadores tan s&oacute;lo veremos los que vienen incluidos en Rails 3: <code>controller</code>, <code>generator</code>, <code>helper</code>, <code>integration_test</code>, <code>mailer</code>, <code>metal</code>, <code>migration</code>, <code>model</code>, <code>observer</code>, <code>performance_test</code>, <code>plugin</code>, <code>resource</code>, <code>scaffold</code>, <code>scaffold_controller</code>, <code>session_migration</code> y <code>stylesheets</code>.  En su mayor&iacute;a estos generadores se comportan igual que sus equivalentes en Rails 2.</p>

<p>Para ver la ayuda acerca de un generador en concreto podemos ejecutar el generador con la opci&oacute;n <code>--help</code>.  Si lo hacemos con el generador de andamiajes veremos que hay muchas opciones disponibles que nos dan bastante flexibilidad para personalizar el comportamiento del generador.</p>

<pre class="terminal">
$ rails g scaffold --help
Usage:
  rails generate scaffold NAME [field:type field:type] [options]

Options:
  -c, --scaffold-controller=NAME  # Scaffold controller to be invoked
                                  # Default: scaffold_controller
      [--singleton]               # Supply to create a singleton controller
      [--force-plural]            # Forces the use of a plural ModelName
  -y, [--stylesheets]             # Indicates when to generate stylesheets
                                  # Default: true
  -o, --orm=NAME                  # Orm to be invoked
                                  # Default: active_record

ScaffoldController options:
  -e, [--template-engine=NAME]  # Template engine to be invoked
                                # Default: erb
      [--helper]                # Indicates when to generate helper
                                # Default: true
  -t, [--test-framework=NAME]   # Test framework to be invoked
                                # Default: test_unit

Runtime options:
  -f, [--force]    # Overwrite files that already exist
  -p, [--pretend]  # Run but do not make any changes
  -q, [--quiet]    # Supress status output
  -s, [--skip]     # Skip files that already exist

TestUnit options:
  -r, [--fixture-replacement=NAME]  # Fixture replacement to be invoked
      [--fixture]                   # Indicates when to generate fixture
                                    # Default: true

ActiveRecord options:
  [--parent=PARENT]  # The parent class for the generated model
  [--timestamps]     # Indicates when to generate timestamps
                     # Default: true
  [--migration]      # Indicates when to generate migration
                     # Default: true
</pre>

<p>N&oacute;tese que algunas opciones vienen con valores por defecto.  Por ejemplo la opci&oacute;n  <code>--stylesheets</code> por defecto vale <code>true</code>.  Pero, &iquest;y si no queremos que las hojas de estilo sean generadas autom&aacute;ticamente?  Pues bien, cuando tenemos una opci&oacute;n booleana cuyo valor por defecto es <code>true</code> podemos poner el prefijo <code>--no</code> para desactivar dicha opci&oacute;n.  A continuaci&oacute;n crearemos un andamiaje llamado  <code>project</code>, pero sin hoja de estilos esta vez.</p>

<pre class="terminal">
$ rails g scaffold project name:string --no-stylesheets
      invoke  active_record
      <span class="passed">create</span>    db/migrate/20100602201538_create_projects.rb
      <span class="passed">create</span>    app/models/project.rb
      invoke    test_unit
      <span class="passed">create</span>      test/unit/project_test.rb
      <span class="passed">create</span>      test/fixtures/projects.yml
       route  resources :projects
      invoke  scaffold_controller
      <span class="passed">create</span>    app/controllers/projects_controller.rb
      invoke    erb
      <span class="passed">create</span>      app/views/projects
      <span class="passed">create</span>      app/views/projects/index.html.erb
      <span class="passed">create</span>      app/views/projects/edit.html.erb
      <span class="passed">create</span>      app/views/projects/show.html.erb
      <span class="passed">create</span>      app/views/projects/new.html.erb
      <span class="passed">create</span>      app/views/projects/_form.html.erb
      invoke    test_unit
      <span class="passed">create</span>      test/functional/projects_controller_test.rb
      invoke    helper
      <span class="passed">create</span>      app/helpers/projects_helper.rb
      invoke      test_unit
      <span class="passed">create</span>        test/unit/helpers/projects_helper_test.rb
</pre>      

<p>Si inspeccionamos la salida del comando veremos que no se han generado hojas de estilo porque hemos desactivado la opci&oacute;n.</p>

<p>La salida del generador muestra (adem&aacute;s del listado de los archivos que se han creado) una serie de llamadas a <code>invoke</code>.  Estas l&iacute;neas indican cu&aacute;ndo se est&aacute;n invocando otros generadores.  Esto quiere decir que el generador de andamiajes no hace mucho por s&iacute; solo, sino que delega en otros generadores como el generador <code>active_record</code> que crea el archivo del modelo y la migraci&oacute;n.  El generador <code>active_record</code> llama a otro generador <code>test_unit</code>, para crear un fichero de tests unitarios.  Este patr&oacute;n se repite m&aacute;s abajo cuando el generador <code>scaffold_controller</code> invoca los generadores <code>erb</code>, <code>test_unit</code> y <code>helper</code> para crear el resto de archivos conectados con un controlador y sus vistas.  Esto hace que este sistema sea muy modular y podamos reemplazar lo que nos interese: si por ejemplo nos interesa utilizar Haml en lugar de erb en las vistas, o Shoulda o RSpec en lugar de Test::Unit podr&iacute;amos utilizar otros generadores para generar el andamiaje.</p>

<p>Con esto ya podemos repasar otra vez la lista de opciones que nos muestra el generador de andamiajes.  Todo deber&iacute;a empezar a adquirir m&aacute;s sentido.  Por ejemplo la opci&oacute;n  <code>--orm</code> nos permite cambiar el mapeo objeto-relacional que generar&aacute; nuestros modelos (podr&iacute;amos usar DataMapper en lugar de ActiveRecord).  M&aacute;s abajo en la lista de opciones hay una lista de opciones de ActiveRecord que s&oacute;lo aplican a la versi&oacute;n de ActiveRecord del generador as&iacute; como las opciones de los generadores de Test::Unit y ScaffoldController.</p>

<h3>Cambio de las opciones por defecto</h3>

<p>Aunque poder pasar a los generadores opciones como <code>--no-stylesheets</code> es bastante &uacute;til, ser&iacute;a mucho m&aacute;s &uacute;til si pudi&eacute;ramos cambiar el valor por defecto de estas opciones, y eso en Rails 3 lo podemos hacer (a nivel de aplicaci&oacute;n) modificando el archivo  <code>config/application.rb.</code>, que es generado autom&aacute;ticamente cuando se crea la aplicaci&oacute;n Rails, y que viene con la siguiente secci&oacute;n comentada:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">
# Configure generators values. Many other options are available, be sure to check the documentation.
# config.generators do |g|
#   g.orm             :active_record
#   g.template_engine :erb
#   g.test_framework  :test_unit, :fixture =&gt; true
# end
</pre>

<p>Si quitamos los comentarios de esta secci&oacute;n podemos cambiar las opciones por defecto de los generadores en nuestra aplicaci&oacute;n.  Las opciones que se muestran coinciden con los valores por defecto.  Por ejemplo para desactivar la generaci&oacute;n de hojas de estilo por defecto podr&iacute;amos escribir:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">
# Configure generators values. Many other options are available, be sure to check the documentation.
config.generators do |g|
  g.stylesheets false
end
</pre>

<p>Si ahora ejecutamos el comando <code>help</code> en el generador de andamiajes veremos que la nueva opci&oacute;n por defecto entra en acci&oacute;n y la opci&oacute;n  <code>--stylesheets</code> ya no tendr&aacute; <code>true</code> como valor por defecto.</p>

<pre class="terminal">
$ rails g scaffold --help
Usage:
  rails generate scaffold NAME [field:type field:type] [options]

Options:
  -y, [--stylesheets]             # Indicates when to generate stylesheets
  -c, --scaffold-controller=NAME  # Scaffold controller to be invoked
                                  # Default: scaffold_controller
      [--singleton]               # Supply to create a singleton controller
      [--force-plural]            # Forces the use of a plural ModelName
  -o, --orm=NAME                  # Orm to be invoked
                                  # Default: active_record
</pre>

<p>Hagamos algo un poco m&aacute;s a la aventura, cambiemos el <em>framework</em> de pruebas para que sea Shoulda en lugar de Test::Unit, y vamos a cambiar las <em>fixturas</em> por Factory Girl usando la opci&oacute;n <code>fixture-replacement</code>.</p>

<p>Por supuesto antes de hacer esto tenemos que detallar cu&aacute;les son las gemas relevantes en el fichero <code>Gemfile</code> de la aplicaci&oacute;n.  Tan s&oacute;lo necesitaremos estas gemas en el entorno de test, as&iacute; que las agruparemos.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
group :test do
  gem &quot;shoulda&quot;
  gem &quot;factory_girl&quot;
end
</pre>

<p>Por desgracia estas dos gemas no incluyen oficialmente generadores para Rails 3 pero podemos utilizar otra gema llamada <a href="http://github.com/indirect/rails3-generators">rails3-generators</a> que s&iacute; que proporciona generadores adaptados a Rails 3 de muchos <em>plugins</em> y gemas, incluyendo Shoulda y Factory Girl.  Vamos a a&ntilde;adir dicha gema tambi&eacute;n al fichero Gemfile pero s&oacute;lo lo haremos en el entorno de desarrollo.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &quot;rails3-generators&quot;, :group =&gt; :development
</pre>
<p>Con esto, s&oacute;lo tenemos que ejecutar</p>

<pre class="terminal">
bundle install
</pre>

<p>para instalar las gemas.  Una vez que se hayan instalado las gemas podemos ejecutar <code>rails g</code> para ver una lista de los generadores que hay disponibles.  Al final de la lista ahora deber&iacute;an aparecer los nuevos generadores definidos en la gema <code>rails3-generators</code>.</p>

<p>Con estos nuevos generadores podemos modificar la configuraci&oacute;n de  <code>application.rb</code> y poner los valores por defecto de las opciones  <code>test_framework</code> y <code>fixture_replacement</code>.</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">
# Configure generators values. Many other options are available, be sure to check the documentation.
config.generators do |g|
  g.stylesheets false
  g.test_framework :shoulda
  g.fixture_replacement :factory_girl
end
</pre>

<p>Ahora cuando ejecutemos la ayuda del generador de andamiajes otra vez veremos que habr&aacute; cambiado para mostrar las opciones por defecto de <em>framework</em> de pruebas.</p>

<pre class="terminal">
$ rails g scaffold --help
Usage:
  rails generate scaffold NAME [field:type field:type] [options]
  ...

ActiveRecord options:
  [--parent=PARENT]      # The parent class for the generated model
  [--migration]          # Indicates when to generate migration
                         # Default: true
  [--timestamps]         # Indicates when to generate timestamps
                         # Default: true
  [--textframework=NAME] # Test framework to be invoked
                         # Default: shoulda

Shoulda options:
  [--fixture-replacement=NAME]  # Fixture replacement to be invoked
                                # Default: factory_girl
  [--dir=DIR]                   # The directory where the model tests should go
                                # Default: test/unit
</pre>                              

<p>Podemos probar todo esto generando un nuevo andamiaje para un modelo llamado <code>task</code>.</p>

<pre class="terminal">
$ rails g scaffold task project_id:integer name:string
      invoke  active_record
      <span class="passed">create</span>    db/migrate/20100604202823_create_tasks.rb
      <span class="passed">create</span>    app/models/task.rb
      invoke    shoulda
      <span class="passed">create</span>      test/unit/task_test.rb
      invoke      factory_girl
      <span class="passed">create</span>        test/factories/tasks.rb
       route  resources :tasks
      invoke  scaffold_controller
      <span class="passed">create</span>    app/controllers/tasks_controller.rb
      invoke    erb
      <span class="passed">create</span>      app/views/tasks
      <span class="passed">create</span>      app/views/tasks/index.html.erb
      <span class="passed">create</span>      app/views/tasks/edit.html.erb
      <span class="passed">create</span>      app/views/tasks/show.html.erb
      <span class="passed">create</span>      app/views/tasks/new.html.erb
      <span class="passed">create</span>      app/views/tasks/_form.html.erb
       <span class="failed">error</span>    shoulda [not found]
      invoke    helper
      <span class="passed">create</span>      app/helpers/tasks_helper.rb
       <span class="failed">error</span>      shoulda [not found]
</pre> 

<p>Al principio vemos que se invocan correctamente los generadores de <code>shoulda</code> y <code>factory_girl</code> pero que m&aacute;s abajo, no se pudo encontrar un generador de Shoulda para erb o el fichero <em>helper</em>.  Si vemos otra vez la lista de <em>helpers</em> comprobaremos que s&oacute;lo tenemos generadores Shoulda para los modelos y los controladores.</p>

<pre class="terminal">
$ rails g
  ...
Shoulda:
  shoulda:controller
  shoulda:model
</pre>  

<p>&iquest;Qu&eacute; podemos hacer aqu&iacute;?  Bueno, si examinamos la p&aacute;gina de las <a href="http://guides.rails.info/generators.html#adding-generators-fallbacks">Gu&iacute;as Rails sobre generadores</a> veremos que es posibile a&ntilde;adir generadores de respaldo por si no se encuentran ciertos generadores.  Nuevamente, lo &uacute;nico que hay que hacer es modificar el bloque de configuraci&oacute;n en <code>application.rb</code>.</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">
# Configure generators values. Many other options are available, be sure to check the documentation.
config.generators do |g|
  g.stylesheets false
  g.test_framework :shoulda
  g.fallbacks[:shoulda] = :test_unit 
  g.fixture_replacement :factory_girl
end
</pre>

<p>Ahora ya podemos generar andamiajes con Shoulda y los generadores utilizar&aacute;n los generadores correspondientes a Test::Unit si no se puede encontrar un generador adecuado de Shoulda.</p>

<h3>Personalizaci&oacute;n de las plantillas</h3>

<p>Lo &uacute;ltimo que nos queda por ver en este episodio es c&oacute;mo personalizar las plantillas generadas.  Debajo se muestra la vista generada para la acci&oacute;n <code>index</code> del controlador que acabamos de generar.</p>

<p class="codeFilePath">/app/views/tasks/index.html.erb</p>
<pre class="ruby">
&lt;h1&gt;Listing tasks&lt;/h1&gt;

&lt;table&gt;
  &lt;tr&gt;
    &lt;th&gt;&lt;/th&gt;
    &lt;th&gt;&lt;/th&gt;
    &lt;th&gt;&lt;/th&gt;
  &lt;/tr&gt;

&lt;% @tasks.each do |task| %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Show&#x27;, task %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Edit&#x27;, edit_task_path(task) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Destroy&#x27;, task, :confirm =&gt; &#x27;Are you sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;
&lt;/table&gt;

&lt;br /&gt;

&lt;%= link_to &#x27;New Task&#x27;, new_task_path %&gt;
</pre>

<p>Supongamos que queremos eliminar la etiqueta <code>br</code> al final de la plantilla y poner el enlace del final en su p&aacute;rrafo.  &iquest;C&oacute;mo podemos cambiar la plantilla de forma que estos cambios ocurran en todas las vistas generadas?</p>

<p>Podemos crear nuestras propias plantillas en un directorio llamado <code>templates</code> dentro del directorio <code>lib</code>.  Los generadores mirar&aacute;n ah&iacute; en busca de plantillas en lugar de utilizar las incluidas por defecto.  Para determinar qu&eacute; plantilla tenemos que redefinir tendremos que mirar <a href="http://github.com/rails/rails">el c&oacute;digo fuente del generador</a>.  El c&oacute;digo de los generadores est&aacute; en el directorio  <a href="http://github.com/rails/rails/tree/master/railties/lib/rails/generators/">railties/lib/rails/generators</a> y las plantillas por defecto est&aacute;n en el directorio <a href="http://github.com/rails/rails/tree/master/railties/lib/rails/generators/erb/scaffold/templates/">erb/scaffold/templates/</a>.  Podemos copiar los contenidos de <code>index.html.erb</code> de ese directorio para cambiarlo seg&uacute;n nos convenga.</p>

<p>Tenemos que crear una estructura de directorios similar por lo que nuestra plantilla de &iacute;ndice personalizada tendr&iacute;a que estar en  <code>/lib/templates/erb/scaffold/index.html.erb</code>.  Ah&iacute; podemos poner la plantilla por defecto sobre la que hacer nuestros cambios.  Una vez que los hayamos hecho si creamos un nuevo andamiaje, por ejemplo para un modelo llamado <code>Category</code> veremos que la vista de &iacute;ndice ya incorpora nuestra propia plantilla.</p>

<pre class="terminal">
rails g scaffold category name:string
</pre>

<p class="codeFilePath">/app/views/categories/index.html.erb</p>
<pre class="ruby">
&lt;h1&gt;Listing categories&lt;/h1&gt;

&lt;table&gt;
  &lt;tr&gt;
    &lt;th&gt;Name&lt;/th&gt;
    &lt;th&gt;&lt;/th&gt;
    &lt;th&gt;&lt;/th&gt;
    &lt;th&gt;&lt;/th&gt;
  &lt;/tr&gt;

&lt;% @categories.each do |category| %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= category.name %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Show&#x27;, category %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Edit&#x27;, edit_category_path(category) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= link_to &#x27;Destroy&#x27;, category, :confirm =&gt; &#x27;Are you sure?&#x27;, :method =&gt; :delete %&gt;&lt;/td&gt;
  &lt;/tr&gt;
&lt;% end %&gt;
&lt;/table&gt;

&lt;p&gt;&lt;%= link_to &#x27;New Category&#x27;, new_category_path %&gt;&lt;/p&gt;
</pre>

<p>Y eso es todo por este episodio.   En Rails 3 se han introducido muchas mejoras en los generadores que los hacen mucho m&aacute;s f&aacute;ciles de personalizar.</p>
