<p>Cada vez es m&aacute;s y m&aacute;s frecuente navegar por sitios web utilizando dispositivos m&oacute;viles, que tienen capacidades de pantalla mucho m&aacute;s limitadas que sus primos los equipos port&aacute;tiles o de escritorio.  Debido a esto es muy importante probar nuestras aplicaciones web en estos dispositivos para comprobar c&oacute;mo funcionan.</p>

<p>La mejor forma de hacerlo es probar la aplicaci&oacute;n en el dispositivo real. Por supuesto, no podemos navegar a &quot;localhost&quot; con un m&oacute;vil as&iacute; que tendremos o bien que utilizar la IP de la m&aacute;quina en la que corre nuestra aplicaci&oacute;n o bien su nombre de dominio local, asumiendo que el m&oacute;vil se encuentra en la misma red local.  Por ejemplo, la m&aacute;quina en la que estamos ejecutando la aplicaci&oacute;n que veremos en este episodio se llama <code>noonoo</code> por lo que podemos visitarla desde cualquier otra m&aacute;quina de la misma red utilizando <code>http://noonoo.local:3000/</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/316/original/E199I01.png" alt="La p&aacute;gina de projectos de nuestra aplicaci&oacute;n." height="323" width="800" />
</div>

<p>Si no tenemos acceso a un dispositivo f&iacute;sico para pruebas podr&iacute;amos descargar un simulador de este dispositivo.  Si queremos testear en un iPhone podemos descargar el simulador que est&aacute; disponible en <a href="http://developer.apple.com/iphone/program/">el sitio para desarrolladores de Apple</a>.   Igualmente existe un emulador disponible como parte del <a  href="http://developer.palm.com/index.php?option=com_content&amp;view=article&amp;layout=page&amp;id=1788">SDK para Palm Pr&eacute;</a>.</p>

<p>Otra alternativa para hacer pruebas en iPhone es <a href="http://sourceforge.net/projects/iphonesimulator/">iPhoney</a>.  Proporciona una emulaci&oacute;n casi perfecta de un iPhone -aunque no tan perfecta como la del simulador de Apple- con la ventaja de que no tenemos que descargar todo el SDK de iPhone para poder utilizarlo.   Si lo usamos para probar un sitio web que debe tener un comportamiento diferente para dispositivos m&oacute;viles tendremos que acordarnos de configurar el <em>User Agent</em> adecuado en el men&uacute; de iPhoney para que se muestre el contenido correcto.</p>

<div class="imageWrapper">
  <img src="/system/photos/317/original/E199I02.png" alt="El sitio visto en el simulador iPhoney." height="386" width="728" />
</div>
<p class="title">Nuestra aplicaci&oacute;n en iPhoney.</p>

<p>La apariencia de nuestra aplicaci&oacute;n es francamente mejorable en estos dispositivos m&oacute;viles y durante el resto de este episodio veremos c&oacute;mo hacerlo.</p>

<p>Para empezar a&ntilde;adiremos al fichero de layout de nuestra aplicaci&oacute;n una hoja de estilos que s&oacute;lo se incluir&aacute; si accedemos a la aplicaci&oacute;n desde un dispositivo m&oacute;vil.</p>

<p class="codeFilePath">/app/views/products/_fields.html.erb</p>
<pre class="ruby">  
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
    &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;
    &lt;%= stylesheet_link_tag &#x27;application&#x27; %&gt;
    &lt;%= stylesheet_link_tag &#x27;mobile&#x27; if mobile_device? %&gt;
    &lt;%= yield(:head) %&gt;
  &lt;/head&gt;
  &lt;body&gt;
  &lt;!-- content omitted --&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>La nueva hoja de estilos para m&oacute;viles s&oacute;lo se incluira si cierto m&eacute;todo denominado <code>mobile_device?</code> devuelve <code>true</code>.  Podr&iacute;amos haber usado el atributo <code>media</code> del elemento <code>link</code> para restringir qu&eacute; dispositivos podr&iacute;an hacer uso de esta hoja de estilos, pero los navegadores de m&oacute;viles a veces interpretan este atributo de diferentes maneras.  Si utilizamos nuestro propio m&eacute;todo para determinar si incluimos o no esta hoja de estilos podremos controlar qu&eacute; dispositivos la incluyen simplemente leyendo la cadena de <em>User Agent</em> enviada por el navegador.</p>

<p>Por supuesto nuestra pr&oacute;xima tarea es escribir el m&eacute;todo <code>mobile_device?</code>.  Lo pondremos en <code>ApplicationController</code> para que todos los controladores puedan acceder a este m&eacute;todo.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">
class ApplicationController &lt; ActionController::Base
  helper :all
  protect_from_forgery

  private
  def mobile_device?
    request.user_agent =~ /Mobile|webOS/
  end
  helper_method :mobile_device?
end
</pre>

<p>En el m&eacute;todo comprobamos la cadena de agente de usuario para ver si contiene o bien la palabra &quot;Mobile&quot; (lo cual detectar&aacute; dispositivos iPhone y Android) o bien la palabra &quot;webOS&quot; (que detectar&aacute; dispositivos Palm Pr&eacute;).  Por supuesto podemos personalizar la expresi&oacute;n regular para detectar cualquier otro dispositivo al que le queramos mostrar la hoja de estilos alternativa (existe un <a href="http://www.zytrax.com/tech/web/mobile_ids.html">listado exhaustivo</a> de cadenas que podemos buscar para detectar otros dispositivos m&oacute;viles). Por &uacute;ltimo, marcamos el m&eacute;todo como  <em>helper</em> para que pueda ser utilizado desde las vistas.</p>

<p>Ahora que hemos escrito este m&eacute;todo podemos crear la hoja de estilos que se enviar&aacute; a los dispositivos m&oacute;viles.</p>

<p class="codeFilePath">/public/stylesheets/mobile.css</p>
<pre style="display: none;" class="ruby">  
body {
    background-color: #FFF;
  }

  #container {
    width: 90%;
    min-width: none;
    margin: 0 auto;
    background-color: #FFF;
    padding: 0;
    border: none;
    margin-top: 20px;
  }
</pre>

<p>Podemos utilizar la funcionalidad de cambio de <em>User Agent</em> en Safari para ver el aspecto de la p&aacute;gina con la hoja de estilos para m&oacute;viles.  En el men&uacute; <code>Develop &gt; User Agent</code> hay una lista de cadenas de <em>User Agent</em> que podemos escoger, incluyendo varias versiones de Mobile Safari.  Si escogemos cualquiera de ellas y recargamos la p&aacute;gina esta vez la veremos con la hoja de estilos para m&oacute;viles.</p>

<div class="imageWrapper">
  <img src="/system/photos/318/original/E199I03.png" alt="The site with the mobile stylesheet applied." height="280" width="800" />
</div>

<h3>Cambiando de sitio </h3>

<p>Una vez que nuestro <em>helper</em> <code>mobile_device?</code> hace lo que queremos podemos utilizarlo para cambiar el comportamiento de nuestro sitio dependiendo del dispositivo con el que se accede.  Tendremos que a&ntilde;adir un enlace para que los usuarios puedan ver el sitio en su versi&oacute;n completa o en su versi&oacute;n m&oacute;vil.  Para ello vamos a cambiar el fichero de <em>layout</em> de nuestra aplicaci&oacute;n y pondremos el siguiente c&oacute;digo al principio de la etiqueta <code>body</code>.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">  
&lt;p&gt;
  &lt;% if mobile_device? %&gt;
    &lt;%= link_to &quot;Full Site&quot;, :mobile =&gt; 0 %&gt;
  &lt;% else %&gt;
    &lt;%= link_to &quot;Mobile Site&quot;, :mobile =&gt; 1 %&gt;
  &lt;% end %&gt;
&lt;/p&gt;
</pre>

<p>Con esto veremos un enlace a la versi&oacute;n completa del sitio si estamos viendo la versi&oacute;n m&oacute;vil, y viceversa.   Este enlace redirige a la p&aacute;gina actual con un par&aacute;metro llamado <code>mobile</code> que determinar&aacute; qu&eacute; versi&oacute;n del sitio mostrar.</p>

<p>En nuestro <code>ApplicationController</code> podemos a&ntilde;adir un <code>before_filter</code> que establecer&aacute; una variable de sesi&oacute;n de forma que una vez que se haya hecho clic en el enlace se siga mostrando la versi&oacute;n escogida al usuario cuando contin&uacute;e su navegaci&oacute;n por nuestro sitio.  El m&eacute;todo <code>before_filter</code> establecer&aacute; una variable de sesi&oacute;n si aparece el par&aacute;metro <code>mobile</code> en la cadena de la petici&oacute;n.  Vamos tambi&eacute;n a cambiar nuestro m&eacute;todo <code>mobile_device?</code> de forma que compruebe si existe dicha variable de sesi&oacute;n y act&uacute;e en consecuencia.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">  
class ApplicationController &lt; ActionController::Base
  helper :all
  protect_from_forgery
  before_filter :prepare_for_mobile

  private
  def mobile_device?
    if session[:mobile_param]
      session[:mobile_param] == &quot;1&quot;
    else
      request.user_agent =~ /Mobile|webOS/
    end
  end
  helper_method :mobile_device?

  def prepare_for_mobile
    session[:mobile_param] = params[:mobile] if params[:mobile]
  end
end
</pre>

<p>Si ahora recargamos la p&aacute;gina veremos que hay un enlace a la versi&oacute;n completa del sitio y si hacemos clic en &eacute;l veremos la versi&oacute;n completa a&uacute;n cuando estamos accediendo utilizando un navegador cuya  cadena de <em>User Agent</em> contiene la cadena &quot;mobile&quot;.</p>

<div class="imageWrapper">
  <img src="/system/photos/319/original/E199I04.png" alt="Ahora aparece el enlace a la versi&oacute;n para m&oacute;viles." height="353" width="800" />
</div>

<p>Esta preferencia ser&aacute; persistente de forma que si se sigue cualquier enlace seguiremos estando en la versi&oacute;n completa de la aplicaci&oacute;n.</p>

<h3>Vistas separadas para dispositivos m&oacute;viles</h3>

<p>Lo que hemos hecho hasta ahora nos funcionar&aacute; para los casos en los que queramos hacer algunos retoques a la aplicaci&oacute;n cuando se vea en dispositivos m&oacute;viles.  Pero, &iquest;qu&eacute; pasa si tenemos planes m&aacute;s ambiciosos y lo que queremos es cambiar la aplicaci&oacute;n de forma que tenga un aspecto y un comportamiento similares a una aplicaci&oacute;n nativa cuando se acceda desde un dispositivo m&oacute;vil?  Para hacerlo tendr&iacute;amos que cambiar pr&aacute;cticamente cada una de las vistas de nuestra aplicaci&oacute;n...</p>

<p>El truco aqu&iacute; es crear un nuevo tipo MIME para nuestra aplicaci&oacute;n, y Rails proporciona el sitio adecuado para hacerlo en el fichero <code>config/initializers/mime_types.rb</code>. Dicho fichero contiene un ejemplo comentado de c&oacute;mo proporcionar un nuevo tipo <code>iPhone</code> en el que nos basaremos para crear uno llamado <code>mobile</code>, que nos devolver&aacute; un formato HTML alternativo para dispositivos m&oacute;viles.</p>

<p class="codeFilePath">/config/initializers/mime_types.rb</p>
<pre class="ruby">  # Be sure to restart your server when you modify this file.

  # Add new mime types for use in respond_to blocks:
  # Mime::Type.register &quot;text/richtext&quot;, :rtf
  # Mime::Type.register_alias &quot;text/html&quot;, :iphone
  Mime::Type.register_alias &quot;text/html&quot;, :mobile
</pre>

<p>A&uacute;n tenemos que establecer dicho tipo MIME y para hacerlo tenemos que regresar al <code>before_filter</code> de nuestra aplicaci&oacute;n y establecer el formato MIME a <code>:mobile</code> si hay que mostrar la versi&oacute;n m&oacute;vil del sitio.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">  
def prepare_for_mobile
  session[:mobile_param] = params[:mobile] if params[:mobile]
  format :mobile if mobile_device?
end
</pre>

<p>Una vez que tengamos esto podemos utilizarlo en las acciones de nuestros controladores para cambiar el comportamiento de cada acci&oacute;n utilizando <code>respond_to</code>, tal y como vemos en la acci&oacute;n <code>index</code> del controlador de proyectos.</p>

<p class="codeFilePath">/app/controllers/projects_controller.rb</p>
<pre class="ruby">  
def index
  @projects = Project.all
  respond_to do |format|
    format.html
    format.mobile
  end
end
</pre>

<p>Sin embargo, el bloque <code>respond_to</code> no es necesario si lo que estamos haciendo es &uacute;nicamente proporcionar una vista alternativa basada en el formato de la petici&oacute;n.  En este caso tan s&oacute;lo tenemos que escribir una nueva plantilla con el nombre del formato donde normalmente aparecer&iacute;a <code>html</code>  Para la vista de &iacute;ndice crearemos un fichero llamado <code>/app/views/projects/index.mobile.erb</code> y para empezar simplemente escribiremos en &eacute;l alg&uacute;n texto.</p>

<p class="codeFilePath">/app/views/projects/index.mobile.erb</p>
<pre class="ruby">  
This is a mobile version!
</pre>
<p>Si visitamos la versi&oacute;n m&oacute;vil de la p&aacute;gina ahora veremos que la vista se est&aacute; mostrando con tipo MIME <code>mobile</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/320/original/E199I05.png" alt="Ahora se
muestra la versi&oacute;n de la plantilla para m&oacute;viles." height="280" width="740" />
</div>

<p>Bas&aacute;ndonos en esto ahora podemos crear una interfaz de usuario que dar&aacute; una aspecto mucho m&aacute;s parecido al de una aplicaci&oacute;n nativa.  Hay un par de librer&iacute;as que podemos utilizar para hacerlo m&aacute;s f&aacute;cil, <a  href="http://code.google.com/p/iui/">iui</a> y <a href="http://www.jqtouch.com/">jQTouch</a>, nosotros utilizaremos esta &uacute;ltima.  jQTouch hace que sea mucho m&aacute;s f&aacute;cil crear una aplicaci&oacute;n web que se comporte como una aplicaci&oacute;n iPhone nativa.</p>

<p>Despu&eacute;s de descargar y descomprimir jQTouch tendr&aacute; una estructura de carpetas como:</p>
<div class="imageWrapper">
  <img src="/system/photos/321/original/E199I06.png" alt="The directory  structure for jQTouch." height="393" width="808" />
</div>

<p>Para que nos sea m&aacute;s f&aacute;cil trabajar con jQTouch vamos a mover las carpetas de temas y extensiones a la carpeta <code>jqtouch</code> y luego arrastraremos dicha carpeta al directorio <code>public</code> de nuestra aplicaci&oacute;n.</p>

<p>A continuaci&oacute;n crearemos un nuevo fichero de <em>layout</em> para la versi&oacute;n m&oacute;vil de nuestro sitio.</p>

<p class="codeFilePath">/app/views/layouts/application.mobile.erb</p>
<pre class="ruby">  
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
    &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;
    &lt;%= stylesheet_link_tag &quot;/jqtouch/jqtouch.min.css&quot;, &quot;/jqtouch/themes/apple/theme.min.css&quot; %&gt;
    &lt;%= javascript_include_tag &quot;/jqtouch/jquery.1.3.2.min.js&quot;, &quot;/jqtouch/jqtouch.min.js&quot;, &quot;mobile&quot; %&gt;
    &lt;%= yield(:head) %&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;div class=&quot;current&quot;&gt;
      &lt;%- if show_title? -%&gt;
      &lt;div class=&quot;toolbar&quot;&gt;
        &lt;%= link_to &quot;Back&quot;, nil, :class =&gt; &quot;back&quot; unless current_page? root_path %&gt;
        &lt;h1&gt;&lt;%=h yield(:title) %&gt;&lt;/h1&gt;
        &lt;%= yield(:toolbar) %&gt;
      &lt;/div&gt;
      &lt;%- end -%&gt;

      &lt;% unless flash.empty? %&gt;
        &lt;div class=&quot;info&quot;&gt;
        &lt;%- flash.each do |name, msg| -%&gt;
          &lt;%= content_tag :div, msg, :id =&gt; &quot;flash_#{name}&quot; %&gt;
        &lt;%- end -%&gt;
        &lt;/div&gt;
      &lt;% end %&gt;

      &lt;%= yield %&gt;
    &lt;/div&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>En este fichero incluimos referencias a un par de hojas de estilo que proporciona jQTouch as&iacute; como al JavaScript de jQuery y de la propia jQTouch. Tambi&eacute;n se hace referencia a un archivo <code>mobile.js</code> que escribiremos m&aacute;s adelante.  En el <em>layout</em> el contenido de la p&aacute;gina est&aacute; rodeado de un <code>div</code> con la clase <code>current</code>.  Si la p&aacute;gina debe tener un t&iacute;tulo lo mostrar&iacute;a rodeado por otro <code>div</code> con la clase <code>toolbar</code>.  As&iacute; mismo si hay cualquier texto informativo que visualizar lo colocar&iacute;amos en otro <code>div</code> esta vez con la clase <code>info</code>.  Despu&eacute;s de &eacute;sto, simplemente se hace un <code>yield</code> mostrar lo que venga en la plantilla actual.</p>

<p>A continuaci&oacute;n crearemos el nuevo fichero <code>mobile.js</code>. Lo que tenemos que hacer aqu&iacute; es invocar al inicializador de jQTouch.</p>

<p class="codeFilePath">/public/javascripts/mobile.js</p>
<pre class="javascript">  
$.jQTouch({});
</pre>

<p>La funci&oacute;n de inicializaci&oacute;n recibe un <a href="http://code.google.com/p/jqtouch/wiki/InitOptions"><em>hash</em> de opciones</a> aunque nosotros no configuraremos ninguna.  Cuando recarguemos la p&aacute;gina m&oacute;vil de proyectos esta vez veremos que se aplican los estilos de jQTouch, si bien la p&aacute;gina tendr&aacute; un aspecto poco atractivo porque a&uacute;n no tenemos ning&uacute;n contenido en la plantilla de la p&aacute;gina.</p>

<div class="imageWrapper">
  <img src="/system/photos/322/original/E199I07.png" alt="Ya se aplica el CSS de jQTouch." height="293" width="814" />
</div>

<p>Si volvemos al c&oacute;digo de la vista para m&oacute;viles de la p&aacute;gina podemos reemplazar lo que ten&iacute;amos con el c&oacute;digo necesario para listar todos los proyectos y un contador del n&uacute;mero de tareas que tiene cada uno de ellos, as&iacute; como un enlace para crear un nuevo proyecto.</p>

<p class="codeFilePath">/app/views/projects/index.mobile.erb</p>
<pre class="ruby">  
&lt;% title &quot;Projects&quot; %&gt;
  &lt;ul&gt;
    &lt;% for project in @projects %&gt;
    &lt;li class=&quot;arrow&quot;&gt;
      &lt;%= link_to h(project.name), project %&gt;
      &lt;small class=&quot;counter&quot;&gt;&lt;%= project.tasks.size %&gt;&lt;/small&gt;
    &lt;/li&gt;
    &lt;% end %&gt;
  &lt;/ul&gt;
  &lt;ul&gt;&lt;li class=&quot;arrow&quot;&gt;&lt;%= link_to &quot;New Project&quot;, new_project_path %&gt;&lt;/li&gt;&lt;/ul&gt;
</pre>

<p>Si recargamos la p&aacute;gina otra vez veremos un interfaz totalmente equiparable al de una aplicaci&oacute;n nativa.</p>


<div class="imageWrapper">
  <img src="/system/photos/323/original/E199I08.png" alt="La versi&oacute;n m&oacute;vil de la p&aacute;gina principal ahora parece una aplicaci&oacute;n nativa." height="350" width="784" />
</div>

<p>Obviamente la interfaz ser&aacute; mucho m&aacute;s estrecha cuando se vea en un iPhone de verdad, pero funcionar&aacute; correctamente en un navegador de escritorio.</p>

<p>Habr&aacute; que hacer una versi&oacute;n para m&oacute;vil de todas y cada una de las vistas de nuestra aplicaci&oacute;n. Se trata de demasiado c&oacute;digo como para mostrarlo aqu&iacute;, pero los archivos <a href="http://github.com/ryanb/railscasts-episodes/tree/master/episode-199/">est&aacute;n disponibles para su descarga</a> en la p&aacute;gina de GitHub de Ryan Bates.  Una vez que lo hagamos tendremos una aplicaci&oacute;n para m&oacute;vil totalmente funcional que tiene el aspecto de una aplicaci&oacute;n nativa.</p>

<div class="imageWrapper">
  <img src="/system/photos/324/original/E199I09.png" alt="La p&aacute;gina de alta de proyecto en la versi&oacute;n m&oacute;vil." height="285" width="783" />
</div>

<p>Si bien hemos mejorado mucho el aspecto de la versi&oacute;n m&oacute;vil de nuestro sitio hemos perdido la posibilidad de volver a la versi&oacute;n completa. A&ntilde;adiremos un bot&oacute;n a la derecha de la barra superior de herramientas para volver a tener esta funcionalidad.</p>

<p>La barra de herramientas est&aacute; definida en el fichero de <em>layout</em> y es muy f&aacute;cil a&ntilde;adir nuevos controles en ella porque los elementos en jQTouch se definen con etiquetas HTML.  Podemos a&ntilde;adir un nuevo bot&oacute;n creando un nuevo enlace dentro de la barra de herramientas con la clase <code>button</code>.</p>

<p class="codeFilePath">/app/views/layouts/application.mobile.erb</p>
<pre class="ruby">  
&lt;div class=&quot;toolbar&quot;&gt;
  &lt;%= link_to &quot;Back&quot;, nil, :class =&gt; &quot;back&quot; unless current_page? root_path %&gt;
  &lt;h1&gt;&lt;%=h yield(:title) %&gt;&lt;/h1&gt;
  &lt;%= link_to &quot;Full Site&quot;, root_url(:mobile =&gt; 0), :class =&gt; &quot;button&quot;, :rel =&gt; &quot;external&quot; %&gt;
   &lt;%= yield(:toolbar) %&gt;
&lt;/div&gt;
</pre>

<p>Tambi&eacute;n tenemos que proporcionar el atributo <code>rel</code> con valor <code>external</code> para que jQTouch trate el enlace como un enlace a otro sitio, si no hici&eacute;semos as&iacute; lanzar&iacute;a una petici&oacute;n AJAX, que no es lo que pretendemos.</p>

<p>Si recargamos la p&aacute;gina por &uacute;ltima vez tendremos un bot&oacute;n en cada p&aacute;gina que nos permite volver a la versi&oacute;n completa de nuestra aplicaci&oacute;n.</p>

<div class="imageWrapper">
  <img src="/system/photos/325/original/E199I10.png" alt="La versi&oacute;n m&oacute;vil
ahora tiene un enlace a la versi&oacute;n completa." height="285" width="783" />
</div>