<p>C&#x27;est devenu de plus en plus courant de naviguer sur des sites en utilisant des appareils mobiles, comme les smartphones. Compar&eacute;s aux ordinateurs portables ou de bureau, ces machines ont de plus petits &eacute;crans et des fonctionalit&eacute;s plus limit&eacute;es, et ayant cela en t&ecirc;te, il est important de v&eacute;rifier vos applications web sur ces petits appareils pour voir comment ils r&eacute;agissent.</p>

<p>La meilleur fa&ccedil;on de le faire est de tester concr&egrave;tement votre application sur un appareil. De toute &eacute;vidence,&ldquo;localhost&rdquo; ne fonctionnera pas sur un mobile, et vous devrez donc utiliser soit l&#x27;adresse IP de votre machine sur laquelle tourne votre application soit sur votre domaine local, en pr&eacute;sumant que le mobile soit aussi sur votre r&eacute;seau local. Par exemple, la machine sur laquelle tourne l&#x27;application que l&#x27;on va utiliser dans cet &eacute;pisode s&#x27;appelle noonoo, si bien que l&#x27;on va y avoir acc&egrave;s sur le r&eacute;seau en tapant l&#x27;adresse <code>http://noonoo.local:3000/</code>.</p>

<div class="imageWrapper">
 <img src="/system/photos/316/original/E199I01.png" width="800" height="323" alt="La page projets de notre application."/>
</div>

<p>Si vous ne pouvez pas y acc&eacute;der physiquement, vous serez oblig&eacute; de t&eacute;l&eacute;charger un simulateur pour l&#x27;appareil, pour lequel vous voulez tester votre application. Si vous voulez tester sur un iPhone, alors un simulateur est disponible sur le <a href="http://developer.apple.com/iphone/program/">site d&#x27;Apple pour les d&eacute;veloppeurs</a>. De la m&ecirc;le mani&egrave;re, un &eacute;mulateur fait partie du <a href="http://developer.palm.com/index.php?option=com_content&amp;view=article&amp;layout=page&amp;id=1788">SDK Palm Pr&eacute;</a>.</p>

<p>Pour tester sur l&#x27;iPhone, une autre alternative est <a href="http://sourceforge.net/projects/iphonesimulator/">iPhoney</a>. Il fournit presqu&#x27;exactement la m&ecirc;me &eacute;mulation qu&#x27;un iPhone, m&ecirc;me s&#x27;il n&#x27;est pas aussi fid&egrave;le que le simulateur Apple, sauf qu&#x27;il n&#x27;est pas aussi lourd &agrave; t&eacute;l&eacute;charger que le SDK iPhone. Si vous avez pr&eacute;vu de tester un site qui devra avoir des comportements diff&eacute;rents pour les mobiles, alors il ne faudra pas oublier de d&eacute;finir le user agent correctement dans  le menu iPhoney, de telle sorte que le contenu appropri&eacute; soit bien affich&eacute;.</p>

<div class="imageWrapper">
  <img src="/system/photos/317/original/E199I02.png" width="728" height="386" alt="Le site vu sur l'émulateur iPhoney." />
</div>
<p class="title">Notre application tournant sur iPhoney.</p>

<p>L&#x27;apparence de l&#x27;application peut de tout &eacute;vidence &ecirc;tre am&eacute;lior&eacute;e pour l&#x27;affichage sur un mobile, et c&#x27;est que nous allons faire tout au long de cet &eacute;pisode.</p>

<p>Commen&ccedil;ons par ajouter une feuille de style (stylesheet) dans la layout de notre application, qui ne sera incluse que si notre application est visit&eacute;e par un mobile.</p>

<p class="codeFilePath">/app/views/products/_fields.html.erb</p>
<pre class="ruby">
  &lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
    &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
  &lt;html&gt;
    &lt;head&gt;
      &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;

      &lt;%= stylesheet_link_tag &#x27;application&#x27; %&gt;
      &lt;%= stylesheet_link_tag &#x27;mobile&#x27; if mobile_device? %&gt;
      &lt;%= yield(:head) %&gt;
    &lt;/head&gt;

    &lt;body&gt;
    &lt;!-- content omitted --&gt;
    &lt;/body&gt;
  &lt;/html&gt;
</pre>

<p>La nouvelle feuille de style mobile ne sera incluse que si une m&eacute;thode appel&eacute;e <code>mobile_device?</code> retourne <code>true</code>, et pour cela nous allons &eacute;crire cette m&eacute;thode. On aurait pu aussi utiliser l&#x27;attribut <code>media</code> de la balise <code>link</code> 
 pour restreindre aux mobiles l&#x27;utilisation de cette feuille de style, mais les navigateurs mobiles pourraient interpr&eacute;ter cet attribut de fa&ccedil;ons fort diff&eacute;rentes. En utilisant notre propre m&eacute;thode pour d&eacute;terminer s&#x27;il faut ou non inclure la feuille de style, on va avoir un meilleur contr&ocirc;le sur quels appareils vont afficher cette feuille, lorsque l&#x27;on va lire la cha&icirc;ne de leur user agent envoy&eacute; par leur navigateur.</p>

<p>La prochaine &eacute;tape est d&#x27;&eacute;crire la m&eacute;thode <code>mobile_device?</code>. on va la placer dans l&#x27;application controller, ainsi tous les controllers pourront avoir acc&egrave;s &agrave; cette m&eacute;thode.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">
class ApplicationController &lt; ActionController::Base
  helper :all
  protect_from_forgery

  private
  def mobile_device?
    request.user_agent =~ /Mobile|webOS/
  end
  helper_method :mobile_device?
end
</pre>

<p>Dans cette m&eacute;thode, on va v&eacute;rifier la requ&ecirc;te du user agent pour voir s&#x27;il contient soit le mot &ldquo;Mobile&rdquo;, correspondant aux appareils iPhone et Android, soit &ldquo;webOS&rdquo; correspondant au Palm Pr&eacute;. Vous pouvez, bien s&ucirc;r, customiser cette expression r&eacute;guli&egrave;re pour cibler quels appareils doivent afficher la feuille de style mobile. Au final on d&eacute;signe cette m&eacute;thode comme une helper m&eacute;thode, de telle sorte qu&#x27;on pourra y avoir acc&egrave;s dans toutes nos vues. Si vous d&eacute;cidez de cibler un appareil sp&eacute;cifique, il existe une <a href="http://www.zytrax.com/tech/web/mobile_ids.html">liste compl&egrave;te</a> d&#x27;agents pour appareils mobiles.</p>

<p>Maintenant que l&#x27;on a &eacute;crit notre helper m&eacute;thode, on va &eacute;crire la feuille de style mobile, que les mobiles vont utiliser.</p>

<p class="codeFilePath">/public/stylesheets/mobile.css</p>
<pre class="ruby">
body {
  background-color: #FFF;
}

#container {
  width: 90%;
  min-width: none;
  margin: 0 auto;
  background-color: #FFF;
  padding: 0;
  border: none;
  margin-top: 20px;
}
</pre>

<p>Afin de voir &agrave; quoi ressemble notre page avec notre feuille de style mobile, on peut utiliser les fonctions de simulation du user-agent dans Safari. (Safari propose un menu D&eacute;veloppeur qui est, par d&eacute;faut, d&eacute;sactiv&eacute;. Pour l&#x27;activer, il faut se rendre dans les pr&eacute;f&eacute;rences du navigateur, menu Avanc&eacute; et cocher la case correspondante; pour la version anglaise, Show Develop menu in menu bar.) (NdT: il existe aussi un module pour Firefox, appel&eacute; <code>User Agent Switcher</code> qui permet de changer dynamiquement son user agent, suivant diff&eacute;rents profils.) Dans le menu <code>D&eacute;veloppeur &gt; User Agent</code> se trouve une liste de user-agents, qui peuvent &ecirc;tre s&eacute;lectionn&eacute;s, incluant plusieurs des diff&eacute;rentes versions de Safari Mobile. Si on choisit l&#x27;une d&#x27;elles et que l&#x27;on regarde de nouveau notre application, on va voir la page avec la feuille de style mobile qui lui est appliqu&eacute;e.</p>

<div class="imageWrapper">
  <img src="/system/photos/318/original/E199I03.png" width="800" height="280" alt="Le site avec notre stylesheet mobile appliqu&eacute;e."/>
</div>

<h3>Basculer entre les Sites</h3>
<p>Maintenant que nous avons notre helper m&eacute;thode <code>mobile_device?</code>, on peut l&#x27;utiliser pour modifier le comportement du site en fonction de l&#x27;appareil qui le visite. Ce que l&#x27;on va ajouter, c&#x27;est un lien qui va permettre aux utilisateurs de basculer entre la version int&eacute;grale et la version mobile du site. Pour ce faire, on va modifier notre layout d&#x27;application en ajoutant le code suivant avant la balise <code>body</code>.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">
&lt;p&gt;
  &lt;% if mobile_device? %&gt;
    &lt;%= link_to &quot;Full Site&quot;, :mobile =&gt; 0 %&gt;

  &lt;% else %&gt;
    &lt;%= link_to &quot;Mobile Site&quot;, :mobile =&gt; 1 %&gt;
  &lt;% end %&gt;
&lt;/p&gt;
</pre>

<p>Ce code va afficher un lien vers le site int&eacute;gral si on est actuellement sur les pages mobiles et vice versa. Le lien va rediriger vers la page qui est actuellement visit&eacute;e avec une cha&icirc;ne de requ&ecirc;te comme param&egrave;tre, appel&eacute;e mobile, qui va d&eacute;terminer quelle version du site &agrave; afficher.</p>

<p>Dans notre application controller, on peut d&eacute;finir un <code>before_filter</code> qui va d&eacute;finir une variable de session, si bien que, d&egrave;s que le lien est cliqu&eacute;, cette version continuera d&#x27;&ecirc;tre affich&eacute;e tout au long de la navigation de l&#x27;utilisateur sur le site. Le <code>before_filter</code> va d&eacute;finir une variable de session s&#x27;il y a un param&egrave;tre &#x27;mobile&#x27; dans la cha&icirc;ne de requ&ecirc;te. On va aussi modifier notre m&eacute;thode <code>mobile_device?</code> de telle sorte qu&#x27;elle v&eacute;rifie si cette variable existe et, auquel cas,  choisira quelle version du site &agrave; afficher, en se basant sur sa valeur. Si cette valeur n&#x27;a pas &eacute;t&eacute; d&eacute;finie, on se basera sur la cha&icirc;ne de requ&ecirc;te.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">
class ApplicationController &lt; ActionController::Base
  helper :all
  protect_from_forgery
  before_filter :prepare_for_mobile

  private
  def mobile_device?
    if session[:mobile_param]
      session[:mobile_param] == &quot;1&quot;
    else
      request.user_agent =~ /Mobile|webOS/
    end
  end
  helper_method :mobile_device?

  def prepare_for_mobile
    session[:mobile_param] = params[:mobile] if params[:mobile]
  end
end
</pre>
<p>Si on recharge la page maintenant, il va y avoir un lien vers la version int&eacute;grale du site, et lorsque l&#x27;on clique, on verra la version compl&egrave;te, m&ecirc;me si on est en train de voir le site avec un user agent, dont la cha&icirc;ne contient le mot &ldquo;mobile&rdquo;.</p>

<div class="imageWrapper">
  <img src="/system/photos/319/original/E199I04.png" width="800" height="353" alt="Le lien vers le site mobile est maintenant visible."/>
</div>

<p>Cette pr&eacute;f&eacute;rence va demeurer, si bien que si l&#x27;on clique sur n&#x27;importe quel lien ci-dessus, on restera sur la version int&eacute;grale de l&#x27;application.</p>

<h3>Vues distinctes pour les Appareils Mobiles</h3>

<p>Tout ce que l&#x27;on a fait jusqu&#x27;&agrave; pr&eacute;sent marchera pour les cas o&ugrave; l&#x27;on veut une application cousue-main pour des mobiles, mais qu&#x27;en serait-il si l&#x27;on a de plus grandes ambitions et que l&#x27;on veuille changer l&#x27;application afin qu&#x27;elle ressemble et r&eacute;ponde comme une application mobile native? Pour cela, il faudrait changer toutes les vues ou presque de notre application. 
 Comment allons-nous faire?</p>

<p>L&#x27;astuce est de cr&eacute;er un nouveau type MIME dans notre application, et Rails fournit justement un fichier ad hoc pour cela: <code>/config/initializers/mime_types.rb</code>. Ce fichier contient un exemple comment&eacute; pour fournir un nouveau type <code>iphone</code>, que nous allons modifier pour cr&eacute;er notre nouveau type <code>mobile</code>. Cela nous permet d&#x27;avoir un nouveau format HTML alternatif pour les appareils mobiles.</p>

<p class="codeFilePath">/config/initializers/mime_types.rb</p>
<pre class="ruby">
# Be sure to restart your server when you modify this file.

# Add new mime types for use in respond_to blocks:
# Mime::Type.register &quot;text/richtext&quot;, :rtf
# Mime::Type.register_alias &quot;text/html&quot;, :iphone
Mime::Type.register_alias &quot;text/html&quot;, :mobile
</pre>

<p>De toute fa&ccedil;on, on doit encore d&eacute;finir ce type MIME, et pour ce faire, on revient dans notre <code>before_filter</code> dans l&#x27;application controller et d&eacute;finir le format &agrave; <code>:mobile</code> si c&#x27;est la version mobile qui est demand&eacute;e.</p>

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">
def prepare_for_mobile
  session[:mobile_param] = params[:mobile] if params[:mobile]
  format :mobile if mobile_device?
end
</pre>
<p>Maintenant que le type MIME est d&eacute;fini, on peut l&#x27;utiliser dans nos actions des controllers pour changer le comportement de chaque action selon le type en utilisant <code>respond_to</code>, comme on va le d&eacute;montrer dans l&#x27;action <code>index</code> du controller des projects.</p>

<p class="codeFilePath">/app/controllers/projects_controller.rb</p>
<pre class="ruby">
def index
  @projects = Project.all
  respond_to do |format|
    format.html
    format.mobile
  end
end
</pre>
<p>Le bloc <code>respond_to</code> n&#x27;est pas n&eacute;cessaire, si nous pouvons fournir une vue alternative bas&eacute;e sur le format. Dans ce cas, on a juste besoin de fournir a nouveau template ayant comme nom celui du nouveau format,l&agrave; o&ugrave; normallement se trouve html. Pour la vue index ci-dessus, on va cr&eacute;er un fichier appel&eacute; <code>/app/views/projects/index.mobile.erb</code> et pour commencer, on y placer un peu de texte.</p>

<p class="codeFilePath">/app/views/projects/index.mobile.erb</p>
  <pre class="ruby">
  Voil&agrave; la version mobile!
  </pre>
<p>Si on regarde la version mobile de cette page, on voit maintenant que la vue mobile s&#x27;affiche.</p>

<div class="imageWrapper">
 <img src="/system/photos/320/original/E199I05.png" width="740" height="280" alt="Le template de la vue mobile est bien rendu."/>
</div>

<p>Maintenant que c&#x27;est en place, on peut cr&eacute;er une Interface Utilisateur (IU) qui va bien plus ressembler &agrave; une applicaion mobile native. Il existe un certain nombre de librairies qui permettent de rendre les choses plus faciles: <a href="http://code.google.com/p/iui/">iui</a> et <a href="http://www.jqtouch.com">jQTouch</a> et celle que nous allons utiliser ici est jQTouch. jQTouch facilite grandement les choses pour cr&eacute;er une appli web, qui ressemble &agrave; une appli iPhone.</p>

<p>Apr&egrave;s avoir t&eacute;l&eacute;charg&eacute; et d&eacute;zipp&eacute; jQTouch, la structure des r&eacute;pertoires devrait &ecirc;tre:</p>

<div class="imageWrapper">
 <img src="/system/photos/321/original/E199I06.png" width="808" height="393" alt="La structure des dossiers pour jQTouch."/>
</div>

<p>Pour faciliter l&#x27;utilisation de jQTouch, on va d&eacute;placer les r&eacute;pertoires extensions et themes dans le r&eacute;pertoire <code>jqtouch</code> et ensuite faire glisser ce r&eacute;pertoire dans le dossier <code>public</code> de notre application.</p>

<p>Ensuite, on va cr&eacute;er un nouveau fichier layout pour la version mobile de notre application.</p>

<p class="codeFilePath">/app/views/layouts/application.mobile.erb</p>
<pre class="ruby">
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
  &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;

&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;&lt;%= h(yield(:title) || &quot;Untitled&quot;) %&gt;&lt;/title&gt;
    &lt;%= stylesheet_link_tag &quot;/jqtouch/jqtouch.min.css&quot;, &quot;/jqtouch/themes/apple/theme.min.css&quot; %&gt;

    &lt;%= javascript_include_tag &quot;/jqtouch/jquery.1.3.2.min.js&quot;, &quot;/jqtouch/jqtouch.min.js&quot;, &quot;mobile&quot; %&gt;
    &lt;%= yield(:head) %&gt;
  &lt;/head&gt;
  &lt;body&gt;

    &lt;div class=&quot;current&quot;&gt;
      &lt;%- if show_title? -%&gt;
      &lt;div class=&quot;toolbar&quot;&gt;
        &lt;%= link_to &quot;Back&quot;, nil, :class =&gt; &quot;back&quot; unless current_page? root_path %&gt;

        &lt;h1&gt;&lt;%=h yield(:title) %&gt;&lt;/h1&gt;
        &lt;%= yield(:toolbar) %&gt;
      &lt;/div&gt;
      &lt;%- end -%&gt;

      &lt;% unless flash.empty? %&gt;

        &lt;div class=&quot;info&quot;&gt;
        &lt;%- flash.each do |name, msg| -%&gt;
          &lt;%= content_tag :div, msg, :id =&gt; &quot;flash_#{name}&quot; %&gt;
        &lt;%- end -%&gt;

        &lt;/div&gt;
      &lt;% end %&gt;

      &lt;%= yield %&gt;
    &lt;/div&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>

<p>Dans ce fichier layout, on va inclure quelques fichiers CSS, fournis par jQTouch et dans le m&ecirc;me temps les r&eacute;f&eacute;rences JavaScript de <code>jQuery</code> et de <code>jQTouch</code>. On va y mettre aussi une r&eacute;f&eacute;rence au fichier <code>mobile.js</code>, que l&#x27;on va cr&eacute;er. Dans cette layout, le contenu de la page est englob&eacute; dans une balise <code>div</code> ayant comme classe <code>current</code>. si cette page doit afficher un titre, alors il sera englob&eacute; dans une autre <code>div</code> de classe <code>toolbar</code>. Pareillement, si on doit afficher un m&eacute;ssage flash, il sera plac&eacute; dans une autre <code>div</code>, cette fois avec une classe <code>info</code>. Enfin, on retourne <code>yield</code> de ce qui doit &ecirc;tre affich&eacute; dans le template courant.</p>

<p>ensuite, il nous faut &eacute;crire le nouveau fichier <code>mobile.js</code>. Tout ce qu&#x27;on doit y mettre est un appel pour initaliser jQTouch.</p>

<p class="codeFilePath">/public/javascripts/mobile.js</p>
<pre class="javascript">
$.jQTouch({});
</pre>

<p>La fonction d&#x27;initialisation prend un <a href="http://code.google.com/p/jqtouch/wiki/InitOptions">hash d&#x27;options</a>, mais ici, on ne va d&eacute;finir aucun d&#x27;eux. Quand on va recharger de nouveau la page mobile des projets, on peut voir que les styles jQTouch sont bien appliqu&eacute;s, mais le rendu est assez moche, et aussi on n&#x27;y voit aucun contenu.</p>

<div class="imageWrapper">
  <img src="/system/photos/322/original/E199I07.png" width="814" height="293" alt="Le CSS jQTouch est maintenant appliqué."/>
</div>

<p>Si on revient au code de la vue mobile de la page, on peut remplacer le code substituable par un code qui listerait tous les projets et un compteur du nombre de t&acirc;ches pour chacun des projets, et enfin un lien pour cr&eacute;er un nouveau projet.</p>

<p class="codeFilePath">/app/views/projects/index.mobile.erb</p>
<pre class="ruby">
&lt;% title &quot;Projects&quot; %&gt;

&lt;ul&gt;
  &lt;% for project in @projects %&gt;
  &lt;li class=&quot;arrow&quot;&gt;
    &lt;%= link_to h(project.name), project %&gt;
    &lt;small class=&quot;counter&quot;&gt;&lt;%= project.tasks.size %&gt;&lt;/small&gt;

  &lt;/li&gt;
  &lt;% end %&gt;
&lt;/ul&gt;
&lt;ul&gt;&lt;li class=&quot;arrow&quot;&gt;&lt;%= link_to &quot;New Project&quot;, new_project_path %&gt;&lt;/li&gt;&lt;/ul&gt;

</pre>

<p>Apr&egrave;s avoir recharg&eacute; de nouveau la page, on va voir une belle interface qui ressemble beaucoup &agrave; une application mobile native.</p>

<div class="imageWrapper">
  <img src="/system/photos/323/original/E199I08.png" width="784" height="350" alt="La version mobile de notre home page ressemble maintenant &agrave; une application native."/>
</div>

<p>&Eacute;videmment l&#x27;interface sera bien plus petite lorsqu&#x27;affich&eacute;e sur un iPhone, mais cela fonctionnera de la m&ecirc;me fa&ccedil;on sur un navigateur d&#x27;ordinateur.</p> 

<p>Chaque vue de notre application aura aussi besoin d&#x27;une version mobile. Cela rep&eacute;sente bien trop de code &agrave; vous pr&eacute;senter, mais vous pouvez <a href="http://github.com/ryanb/railscasts-episodes/tree/master/episode-199/">t&eacute;l&eacute;charger les sources</a> sur la page Github de Ryan Bates. Une fois que cela est fait, on a une application mobile compl&egrave;tment fonctionnelle, qui ressemble &agrave; une application mobile.</p>

<div class="imageWrapper">
  <img src="/system/photos/324/original/E199I09.png" width="783" height="285" alt="La page d'un nouveau projet sur la version mobile du site."/>
</div>

<p>Alors que l&#x27;on a un bien meilleur rendu mobile de notre application, on a perdu la possibilit&eacute; de basculer vers la version int&eacute;grale. On va rajouter un bouton sur le c&ocirc;t&eacute; droit de la barre d&#x27;outils (toolbar) du haut pour r&eacute;activer cette fonctionalit&eacute;.</p>

<p>La toolbar est definie dans la layout mobile, et lui ajouter de nouveaux contr&ocirc;les est facile, dans le sens o&ugrave; les &eacute;l&eacute;ments de jQTouch sont definis par des balises HTML. On peut donc ajouter un nouveau bouton en cr&eacute;ant un nouveau lien &agrave; l&#x27;int&eacute;rieur de la div toolbar et en lui d&eacute;finissant une classe <code>button</code>.</p>

<p class="codeFilePath">/app/views/layouts/application.mobile.erb</p>
<pre class="ruby">
&lt;div class=&quot;toolbar&quot;&gt;
  &lt;%= link_to &quot;Back&quot;, nil, :class =&gt; &quot;back&quot; unless current_page? root_path %&gt;

  &lt;h1&gt;&lt;%=h yield(:title) %&gt;&lt;/h1&gt;
  &lt;%= link_to &quot;Full Site&quot;, root_url(:mobile =&gt; 0), :class =&gt; &quot;button&quot;, :rel =&gt; &quot;external&quot; %&gt;

   &lt;%= yield(:toolbar) %&gt;
&lt;/div&gt;
</pre>

<p>On doit aussi d&eacute;finir un attribut <code>rel</code> ayant une valeur d&#x27;<code>external</code>, ainsi jQTouch traitera ce lien comme un appel externe &agrave; un autre site. Si on ne fait pas cela, une requ&ecirc;te AJAX sera faite, ce qui n&#x27;est pas exactement ce que l&#x27;on recherche.</p> 

<p>Lorsqu&#x27;on recharge la page une derni&egrave;re fois, on aura un bouton sur chaque page, qui pourra nous emmener sur la version int&eacute;grale du site.</p>