<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>

	<title>template</title>
	
</head>
<body>

  <p>&#x4EFB;&#x4F55;&#x5A92;&#x4F53;&#x6216;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x6216;&#x8BB8;&#x90FD;&#x6709;&#x5927;&#x91CF;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6837;&#x5F0F;&#x8868;&#x6269;&#x6563;&#x7684;CSS&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x6837;&#x5F0F;&#x8868;&#x91CC;&#x7684;&#x9009;&#x62E9;&#x5668;&#x5728;&#x7F51;&#x7AD9;&#x7684;&#x4EFB;&#x4F55;&#x9875;&#x9762;&#x4E2D;&#x90FD;&#x7528;&#x4E0D;&#x5230;&#x3002;&#x8FD9;&#x4E9B;&#x9009;&#x62E9;&#x5668;&#x5E94;&#x8BE5;&#x5220;&#x6389;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5C11;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#x8FD8;&#x662F;&#x4F1A;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x6837;&#x603B;&#x662F;&#x4F1A;&#x6709;&#x5C0F;&#x5C0F;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7528;&#x6765;&#x641C;&#x7D22;&#x7F51;&#x7AD9;&#x5E76;&#x627E;&#x5230;&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x7528;&#x7684;CSS,&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E00;&#x96C6;&#x91CC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x3002;</p>

  <h3>Dust-Me Selectors</h3>

  <p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x770B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<a href="https://addons.mozilla.org/en-US/firefox/addon/5392">Dust-Me Selectors</a>&#x7684;Firefox&#x7684;&#x63D2;&#x4EF6;&#x3002;&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x70B9;&#x51FB;&#x90A3;&#x4E2A;&#x5E95;&#x90E8;&#x72B6;&#x6001;&#x680F;&#x7684;&#x7C89;&#x7EA2;&#x8272;&#x5237;&#x5B50;&#xFF0C;Dust-Me Selectors&#x4F1A;&#x626B;&#x63CF;&#x9875;&#x9762;&#x7684;&#x6837;&#x5F0F;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x5F39;&#x51FA;&#x4E00;&#x4E2A;&#x62A5;&#x544A;&#xFF0C;&#x663E;&#x793A;&#x9875;&#x9762;&#x4E0A;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x9009;&#x62E9;&#x5668;&#x3002;</p>

  <div class="imageWrapper">
    <img src="/system/photos/195/original/E180I01.png" width="800" height="600" alt="Dust Me Selectors&rsquo; results for a page" style="border:solid 1px #666;"/>
  </div>

  <p>&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x50CF;&#x5339;&#x914D;&#x5B83;&#x4EEC;&#x7684;&#x5143;&#x7D20;&#x90A3;&#x6837;&#x6807;&#x8BB0;&#x4E3A;&#x65E0;&#x7528;&#x7684;CSS&#x9009;&#x62E9;&#x5668;&#x5728;&#x5176;&#x4ED6;&#x9875;&#x9762;&#x4E0A;&#x3002;&#x8BA9;&#x8FD9;&#x4E9B;Dust-Me Selectors&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;<a href="http://en.wikipedia.org/wiki/Sitemaps">sitemap</a>&#x6587;&#x4EF6;&#x7684;URL&#x7684;Spider Log&#x6807;&#x7B7E;&#x9875;&#x3002;Dust Me Selectors&#x4F1A;&#x5C31;&#x90A3;&#x4E9B;&#x7F51;&#x7AD9;&#x5730;&#x56FE;&#x91CC;&#x4EFB;&#x4F55;&#x9875;&#x9762;&#x90FD;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x7684;&#x9009;&#x62E9;&#x5668;&#x63D0;&#x51FA;&#x62A5;&#x544A;&#xFF0C;&#x7F51;&#x7AD9;&#x5730;&#x56FE;&#x4F1A;&#x7ED9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x5173;&#x4E8E;&#x54EA;&#x4E9B;CSS&#x9009;&#x62E9;&#x5668;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x6CA1;&#x6709;&#x7528;&#x5230;&#x7684;&#x62A5;&#x544A;&#x3002;</p>

  <div class="imageWrapper">
    <img src="/system/photos/196/original/E180I02.png" width="334" height="236" alt="" style="border:solid 1px #666;" />
  </div>

  <h3> Deadweight </h3>
  <p>Dust-Me Selectors&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x627E;&#x7F51;&#x7AD9;&#x4E0A;&#x65E0;&#x7528;CSS&#x9009;&#x62E9;&#x5668;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x518D;&#x627E;&#x4E00;&#x4E2A;&#x80FD;&#x8DDF;Ruby on Rails&#x66F4;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x80FD;&#x5728;&#x811A;&#x672C;&#x4E0A;&#x6709;&#x66F4;&#x591A;&#x63A7;&#x5236;&#x3002;&#x4E00;&#x4E2A;&#x53EB;&#x505A;Deadweight&#x7684;gem&#x6765;&#x4E86;&#x3002;&#x5B83;&#x6709;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x641C;&#x7D22;&#x4E00;&#x4E2A;rails&#x5E94;&#x7528;&#x7684;CSS&#x4E2D;&#x7684;&#x65E0;&#x7528;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5E76;&#x7528;ruby&#x4EE3;&#x7801;&#x6765;&#x6307;&#x5B9A;&#x89E3;&#x6790;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x548C;&#x6837;&#x5F0F;&#x8868;&#x3002;</p>

  <p>&#x8981;&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;gem&#x6211;&#x4EEC;&#x9996;&#x5148;&#x786E;&#x4FDD;Github&#x5728;&#x6211;&#x4EEC;&#x7684;sources&#x5217;&#x8868;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x518D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x52A0;&#x4E0A;&#x5B83;</p>

  <pre class="terminal">
  gem sources -a http://gems.github.com
  </pre>

  <p>&#x52A0;&#x4E0A;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;gem&#x4E86;</p>

  <pre class="terminal">
  sudo gem install aanand-deadweight
  </pre>

  <h3>&#x521B;&#x5EFA;rake&#x4EFB;&#x52A1;</h3>

  <p>&#x901A;&#x5E38;&#x8FD0;&#x884C;Deadweight&#x662F;&#x7528;rake&#x4EFB;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7684;<code>/lib/tasks</code>&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>deadweight.rake</code>&#x6587;&#x4EF6;&#x3002;</p>

  <p>&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5934;&#x90E8;&#x6211;&#x4EEC;&#x9700;&#x8981;require Deadweight gem&#x3002;&#x5728;rake&#x4EFB;&#x52A1;&#x91CC;require gems&#x7684;&#x65F6;&#x5019;&#x8981;&#x5C0F;&#x5FC3;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5B89;&#x88C5;&#x54EA;&#x4E2A;gem&#xFF0C;&#x4F1A;&#x5728;&#x751F;&#x4EA7;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x663E;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E2A;rake&#x4EFB;&#x52A1;&#x90FD;&#x4F1A;&#x4E2D;&#x65AD;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;<code>begin/rescue</code>&#x5757;&#x4E2D;&#x5305;&#x542B;require&#x58F0;&#x660E;&#x3002;</p>

  <pre class="ruby">
  begin
    require &#x27;deadweight&#x27;
  rescue LoadError
  end
  </pre>

  <p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5199;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x3002;</p>

  <pre class="ruby">
  desc &quot;run Deadweight (requires script/server)&quot;
  task :deadweight do
    dw = Deadweight.new
    dw.stylesheets = [&#x27;/stylesheets/application.css&#x27;]
    dw.pages = [&#x27;/&#x27;]
    puts dw.run
  end
  </pre>

  <p>&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5148;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x63CF;&#x8FF0;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4EFB;&#x52A1;&#x672C;&#x8EAB;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;Deadweight&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x6307;&#x5B9A;&#x8981;&#x89E3;&#x6790;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x548C;&#x9875;&#x9762;&#x7684;&#x5168;&#x8DEF;&#x5F84;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x8F93;&#x51FA;Deadweight&#x8FD0;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>

  <p>&#x6CE8;&#x610F;&#x63CF;&#x8FF0;&#x4E2D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x542F;&#x52A8;<code>script/server</code>&#x6765;&#x8FD0;&#x884C;&#x6211;&#x4EEC;&#x7684;rake&#x4EFB;&#x52A1;&#x3002;&#x670D;&#x52A1;&#x5668;&#x8FD0;&#x884C;&#x4E86;&#x5C31;&#x53EF;&#x4EE5;&#x8BD5;&#x9A8C;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x4E86;&#x3002;</p>

  <pre class="terminal">
  $ rake deadweight
  (in /Users/eifion/rails/asciicasts)
  /stylesheets/application.css
  /
    html
    body
    h1
    ...
  found 31 unused selectors out of 60 total
  h2 a
  code
  pre
  form.searchForm input[type=text]
  form.searchForm input[type=submit]
  ...
  </pre>

  <p>&#x4E0A;&#x9762;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x622A;&#x65AD;&#xFF09;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E0A;&#x5339;&#x914D;&#x7684;&#x9009;&#x62E9;&#x5668;&#x5217;&#x8868;&#xFF0C;&#x63A5;&#x7740;&#x662F;&#x6CA1;&#x6709;&#x5339;&#x914D;&#x5230;&#x7684;&#x5217;&#x8868;&#x3002;&#x4E0A;&#x9762;&#x5217;&#x8868;&#x4E2D;&#x6709;31&#x4E2A;&#x6CA1;&#x7528;&#x5230;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EA;&#x68C0;&#x67E5;&#x9996;&#x9875;&#x5339;&#x914D;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x6DFB;&#x52A0;&#x5E94;&#x7528;&#x4E2D;&#x66F4;&#x591A;&#x7684;&#x9875;&#x9762;&#x5230;Deadweight&#x641C;&#x7D22;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x5236;&#x5B9A;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x5E94;&#x8BE5;&#x88AB;&#x641C;&#x7D22;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x7528;<code>rake routes</code>&#x6765;&#x770B;&#x5E94;&#x7528;&#x7684;&#x8DEF;&#x7531;&#x8868;&#x3002;</p>

  <p>&#x8981;&#x66F4;&#x51C6;&#x786E;&#x7684;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x4E2D;&#x65E0;&#x7528;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6DFB;&#x52A0;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x9875;&#x9762;&#x5230;&#x9875;&#x9762;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x662F;&#x8DB3;&#x591F;&#x8986;&#x76D6;&#x7F51;&#x7AD9;&#x7684;&#x5927;&#x90E8;&#x5206;&#x4E86;&#x3002;</p>

  <pre class="ruby">
  dw.pages = [&#x27;/&#x27;, &#x27;/episodes/all&#x27;, &#x27;/about&#x27;, &#x27;/episodes/150-rails-metal&#x27;, &#x27;/episodes/155-beginning-with-cucumber&#x27;, &#x27;/search/index&#x27;]
  </pre>

  <p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x8FD0;&#x884C;<code>rake deadweight</code>&#xFF0C;&#x5B83;&#x5C06;&#x8FD0;&#x884C;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x90A3;&#x4E9B;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x77ED;&#x4E00;&#x70B9;&#x7684;&#x4E0D;&#x5339;&#x914D;&#x9009;&#x62E9;&#x5668;&#x5217;&#x8868;&#x3002;&#xFF08;&#x8FD9;&#x513F;&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x8FD8;&#x662F;&#x88AB;&#x7F29;&#x77ED;&#x4E86;&#x3002;&#xFF09;</p>

  <pre class="terminal">
  $ rake deadweight
  (in /Users/eifion/rails/asciicasts)
  /stylesheets/application.css
  /
    html
    body
    h1
    ...
  /episodes/all
    dl#episodeArchive dt
    dl#episodeArchive dd
  /about
  /episodes/150-rails-metal
    h2 a
    code
    pre
    ...
  /search/index
  found 10 unused selectors out of 60 total
  form.searchForm input[type=text]
  form.searchForm input[type=submit]
  code.terminal
  ...
  </pre>

  <p>&#x5982;&#x679C;&#x6709;&#x9009;&#x62E9;&#x5668;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x7528;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x5728;&#x67D0;&#x79CD;&#x73AF;&#x5883;&#x4E0B;&#x663E;&#x793A;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x6765;&#x663E;&#x793A;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x6216;flash&#x63D0;&#x9192;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;ignore_selectors&#x6765;&#x4ECE;&#x7ED3;&#x679C;&#x4E2D;&#x6392;&#x9664;&#x5B83;&#x4EEC;&#x3002;</p>

  <pre class="ruby">
  dw.ignore_selectors = /flash_notice|flash_error|errorExplanation|fieldWithErrors/
  </pre>

  <p>&#x5F53;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8FD0;&#x884C;<code>rake deadweight</code>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x66F4;&#x77ED;&#x7684;&#x4E0D;&#x5339;&#x914D;&#x9009;&#x62E9;&#x5668;&#x5217;&#x8868;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8DB3;&#x591F;&#x53EF;&#x4EE5;&#x624B;&#x5DE5;&#x53BB;&#x505A;&#x5E76;&#x5220;&#x9664;&#x90A3;&#x4E9B;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x65E0;&#x7528;&#x7684;&#x3002; &#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x6211;&#x4EEC;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;TextMate&#x7684;Find In Project&#x9009;&#x9879;&#xFF08;&#x6216;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x63D0;&#x4F9B;&#x7684;&#x7C7B;&#x4F3C;&#x529F;&#x80FD;&#xFF09;&#x3002;&#x53BB;&#x641C;&#x7D22;&#x7F51;&#x7AD9;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x5339;&#x914D;&#x3002;</p>
  <p>&#x8FD9;&#x4E00;&#x96C6;&#x5C31;&#x5230;&#x8FD9;&#x513F;&#x3002;&#x6211;&#x4EEC;&#x6DB5;&#x76D6;&#x4E86;Deadweight&#x7684;&#x5927;&#x90E8;&#x5206;&#x57FA;&#x672C;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x8BBE;&#x7F6E;&#x503C;&#x5F97;&#x53BB;&#x770B;&#x4E00;&#x770B;&#x3002;&#x5728;<a href="http://github.com/aanand/deadweight">Deadweight&rsquo;s GitHub page</a>&#x6709;&#x8BE6;&#x7EC6;&#x7C7B;&#x5BB9;&#x3002;</p>

</body>
</html>