<p>Debajo tenemos un archivo layout de aplicaci&oacute;n y una acci&oacute;n index:</p>

<pre class="ruby">
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot; 
  &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;Todo List&lt;/title&gt;
    &lt;%= stylesheet_link_tag &#x27;application&#x27; %&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;div id=&quot;container&quot;&gt;
      &lt;h1&gt;Todo List&lt;/h1&gt;
      &lt;%= yield %&gt;
    &lt;/div&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>
<p class="title">application.rhtml<a href="#fn1"><sup>[1]</sup></a></p>

<pre class="ruby">
&lt;h2&gt;Projects&lt;/h2&gt;
&lt;ul&gt;
&lt;% for project in @projects %&gt;
  &lt;li&gt;&lt;%= project.name %&gt;&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>
<p class="title">index.rhtml <a href="#fn1"><sup>[1]</sup></a></p>

<p>Cuando se genera la acci&oacute;n <code>index</code>, se genera dentro del archivo layout (Ver <a href="/episodes/7-todo-acerca-de-los-layouts">episodio anterior</a> para m&aacute;s detalles acerca de los layouts). Pero, &iquest;y si queremos m&aacute;s control sobre el layout y queremos personalizarlo basado en el template que est&aacute; siendo generado? Digamos que queremos utilizar un archivo CSS personalizado en el template de la acci&oacute;n <code>index</code>. La soluci&oacute;n es utilizar un m&eacute;todo helper llamado <code>content_for</code> en nuestro template. <code>content_for</code> toma un s&iacute;mbolo como identificador, en este caso <code>:head</code>, y un bloque. El c&oacute;digo colocado dentro del bloque ser&aacute; almacenado para su posterior uso y no aparecer&aacute; dentro del template.</p>

<pre class="ruby">
&lt;% content_for :head do %&gt;
  &lt;%= stylesheet_link_tag &#x27;projects&#x27; %&gt;
&lt;% end %&gt;
&lt;h2&gt;Projects&lt;/h2&gt;
&lt;ul&gt;
&lt;% for project in @projects %&gt;
  &lt;li&gt;&lt;%= project.name %&gt;&lt;/li&gt;
&lt;% end %&gt;
&lt;/ul&gt;
</pre>
<p class="title">index.rhtml<a href="#fn1"><sup>[1]</sup></a></p>

<p>Este cambio no va a generar ning&uacute;n cambio de por s&iacute;, ya que no estamos mostrando el contenido de <code>content_for</code>. Lo que necesitamos hacer a continuaci&oacute;n es mostrar la salida en alg&uacute;n lugar en el layout. Esto puede hacerse realizando una llamada a <code>yield</code> con el s&iacute;mbolo que le dimos al <code>content_for</code>. Entonces, al agregar yield :head en un bloque ERB a la secci&oacute;n del encabezado de nuestro layout, el c&oacute;digo dentro de <code>content_for :head</code> en nuestro template ser&aacute; generado en ese lugar.</p>

<pre class="ruby">
  &hellip;
  &lt;head&gt;
    &lt;title&gt;Todo List&lt;/title&gt;
    &lt;%= stylesheet_link_tag &#x27;project&#x27; %&gt;
    &lt;%= yield :head %&gt;
  &lt;/head&gt;
  &hellip;
</pre>

<p>Observando al c&oacute;digo fuente de la p&aacute;gina, vemos que la referencia a la hoja de estilo de nuestro bloque <code>content_for</code> ha sido agregada a la p&aacute;gina.</p> 

<div class="imageWrapper">
<img src="/system/photos/6/original/E008I01.png" title="The page's source with the stylesheet added" alt="The page's source with the stylesheet added" width="735" height="285" />
</div>
 
<p><code>content_for</code> provee una forma realmente &uacute;til de cambiar el contenido de un layout que depende de una acci&oacute;n. As&iacute; como se puede utilizar para agregar hojas de estilo, tambi&eacute;n se puede utilizar para mostrar barras de men&uacute;, barras laterales o cualquier otro tipo de contenido que deseemos que aparezca en cierta acci&oacute;n.</p>  

<h3>Notas</h3>
<p>Para Rails 2 y versiones superiores la extensi&oacute;n del archivo deber&iacute;a ser .html.erb en vez de .rhtml.</p>