<p>O primeiro release candidate do Rails 3.0 j&aacute; foi lan&ccedil;ado. Esse &eacute; um &oacute;timo momento para experimentar o Rails 3, se voc&ecirc; j&aacute; n&atilde;o tiver feito isso, e para ver quais mudan&ccedil;as precisam ser feitas em suas aplica&ccedil;&otilde;es Rails 2 para atualiz&aacute;-las. Neste epis&oacute;dio vamos mostrar como atualizar uma aplica&ccedil;&atilde;o Rails 2.3 para Rails 3.0.</p>

<p>J&aacute; existe uma s&eacute;rie de epis&oacute;dios sobre Rails 3.0 que voc&ecirc; pode assistir ou ler e n&oacute;s vamos fazer refer&ecirc;ncias a alguns epis&oacute;dios relevantes enquanto trabalhamos com a atualiza&ccedil;&atilde;o. A aplica&ccedil;&atilde;o que vamos come&ccedil;ar a atualizar &eacute; o site railscasts.com. O c&oacute;digo fonte est&aacute; dispon&iacute;vel no <a href="http://github.com/ryanb/railscasts">Github</a>.</p>

<p>Mesmo se voc&ecirc; n&atilde;o estiver pronto para usar Rails 3 em produ&ccedil;&atilde;o, ainda vale a pena tentar atualizar as aplica&ccedil;&otilde;es Rails 2 s&oacute; para ver quais problemas voc&ecirc; ter&aacute; que enfrentar. Se suas aplica&ccedil;&otilde;es usam Git para controle de vers&atilde;o, &eacute; f&aacute;cil criar um branch separado para experimentar. Vamos criar um novo branch chamado <code>rails3</code>.</p>

<pre class="terminal">
$ git checkout -b rails3
Switched to a new branch &#x27;rails3&#x27;
</pre>

<h3>Antes de come&ccedil;armos a atualiza&ccedil;&atilde;o</h3>

<p>Antes de atualizar uma aplica&ccedil;&atilde;o para o Rails 3, devemos atualiz&aacute;-la para a &uacute;ltima vers&atilde;o do Rails 2.3, que no momento &eacute; o Rails 2.3.8. Da mesma forma, qualquer gem que a aplica&ccedil;&atilde;o usa, deve ser atualizada para a vers&atilde;o mais recente. Desta forma, vamos garantir que n&atilde;o existem problemas de compatibilidade com as vers&otilde;es mais recentes.</p>

<p>Uma vez que tenhamos atualizado o Rails e as gems, devemos executar nossos testes. Ter uma boa su&iacute;te de testes automatizados ajudar&aacute; a garantir que tudo ainda est&aacute; funcionando como deveria.</p>

<pre class="terminal">
$ rake spec
(in /Users/eifion/rails/apps_for_asciicasts/ep225/railscasts)
DEPRECATION WARNING: Rake tasks in vendor/plugins/hoptoad_notifier/tasks 
........................................................................................................................................................

152 examples, 0 failures
</pre>

<p>Todos os testes passaram. Ent&atilde;o estamos prontos para a atualiza&ccedil;&atilde;o.</p>

<h3>Atualizando o Ruby e Instalando o Rails 3</h3>

<p>Para a atualiza&ccedil;&atilde;o, queremos utilizar a &uacute;ltima vers&atilde;o do Ruby em um ambiente limpo para a aplica&ccedil;&atilde;o Rails 3, por isso vamos usar o <a href="http://rvm.beginrescueend.com">rvm</a> para instalar a &uacute;ltima vers&atilde;o do Ruby 1.9.2 e instalar o Rails 3.0. O rvm &eacute; atualizado frequentemente, por isso vamos garantir que temos a vers&atilde;o mais recente executando <code>update rvm</code> antes de instalar o Ruby.</p>

<pre class="terminal">
$ rvm update

rvm 0.1.40 by Wayne E. Seguin (wayneeseguin@gmail.com) [http://rvm.beginrescueend.com/]

info: fetching rvm-0.1.43.tar.gz

info: Extracting rvm-0.1.43.tar.gz ...

info: Installing rvm-0.1.43...
</pre>

<p>Uma vez que o rvm est&aacute; atualizado, precisamos recarreg&aacute;-lo. Podemos fazer isso, executando:</p>

<pre class="terminal">
$ rvm reload
</pre>

<p>Agora podemos usar o rvm para instalar o Ruby 1.9.2.</p>

<pre class="terminal">
$ rvm install 1.9.2
</pre>

<p>Esse comando ir&aacute; baixar, compilar e instalar a &uacute;ltima vers&atilde;o do Ruby 1.9.2, atualmente em rc2. Quando estiver conclu&iacute;do (pode demorar alguns minutos) poderemos mudar para a nova vers&atilde;o e verificar se ela funciona.</p>

<pre class="terminal">
$ rvm 1.9.2
$ ruby -v
ruby 1.9.2dev (2010-07-11 revision 28618) [x86_64-darwin10.4.0]
</pre>

<p>Agora que sabemos que estamos rodando a vers&atilde;o correta do Ruby, podemos instalar a gem do Rails 3.0 release candidate.</p>

<pre class="terminal">
gem install rails --pre
</pre>

<p>Note que como estamos usando uma vers&atilde;o do Ruby instalada com rvm, n&atilde;o precisamos usar sudo para instalar gems.</p>

<h3>Come&ccedil;ando a atualiza&ccedil;&atilde;o</h3>

<p>Agora temos uma nova instala&ccedil;&atilde;o do Ruby e o Rails 3.0. Ent&atilde;o estamos prontos para come&ccedil;ar a atualizar nossa aplica&ccedil;&atilde;o. Para nos ajudar, temos o <a href="http://github.com/rails/rails_upgrade">rails_upgrade plugin</a>, que &eacute; um plugin oficial que podemos usar para ver quais altera&ccedil;&otilde;es precisamos fazer. Para instalar o rails_upgrade, primeiro precisamos voltar para o Rails 2, que est&aacute; instalado no ambiente do Ruby do sistema.</p>

<pre class="terminal">
$ rvm system
</pre>

<p>Agora podemos instalar o plugin.</p>

<pre class="terminal">
$ script/plugin install git://github.com/rails/rails_upgrade.git
</pre>

<p>Ser&aacute; apresentada uma <a href="http://github.com/rails/rails_upgrade/blob/master/install.rb">documenta&ccedil;&atilde;o &uacute;til</a> depois da instala&ccedil;&atilde;o. Um dos principais comandos que ele acrescenta &eacute; o <code>rake rails:upgrade:check</code>. Quando executamos esse comando no diret&oacute;rio da nossa aplica&ccedil;&atilde;o, ele ir&aacute; mostrar uma lista de tudo que precisa ser atualizado em nossa aplica&ccedil;&atilde;o. A sa&iacute;da &eacute; muito longa para mostrar aqui, mas como exemplo, veremos a primeira parte.</p>

<pre class="terminal">
$ rake rails:upgrade:check

(in /Users/eifion/rails/apps_for_asciicasts/ep225/railscasts)
Old router API
The router API has totally changed.
More information: http://yehudakatz.com/2009/12/26/the-rails-3-router-rack-it-up/

The culprits: 
	- config/routes.rb
</pre>	

<p>Antes de come&ccedil;armos a atualiza&ccedil;&atilde;o, vamos executar <code>rake rails:upgrade:backup</code>. Isso ir&aacute; fazer backup de alguns dos principais arquivos que s&atilde;o suscet&iacute;veis de altera&ccedil;&atilde;o durante a atualiza&ccedil;&atilde;o.</p>

<pre class="terminal">
$ rake rails:upgrade:backup
(in /Users/eifion/rails/apps_for_asciicasts/ep225/railscasts)
DEPRECATION WARNING: Rake tasks in vendor/plugins/hoptoad_notifier/tasks are deprecated. Use lib/tasks instead. (called from /Library/Ruby/Gems/1.8/gems/rails-2.3.8/lib/tasks/rails.rb:10)

* backing up .gitignore to .gitignore.rails2
* backing up app/controllers/application_controller.rb to app/controllers/application_controller.rb.rails2
* backing up app/helpers/application_helper.rb to app/helpers/application_helper.rb.rails2
* backing up config/routes.rb to config/routes.rb.rails2
* backing up config/environment.rb to config/environment.rb.rails2
* backing up config/environments/development.rb to config/environments/development.rb.rails2
* backing up config/environments/production.rb to config/environments/production.rb.rails2
* backing up config/database.yml to config/database.yml.rails2

This is a list of the files analyzed and backed up (if they existed);
you will probably not want the generator to replace them since
you probably modified them (but now they&#x27;re safe if you accidentally do!).

- .gitignore
- app/controllers/application_controller.rb
- app/helpers/application_helper.rb
- config/routes.rb
- config/environment.rb
- config/environments/development.rb
- config/environments/production.rb
- config/environments/staging.rb
- config/database.yml
- config.ru
- doc/README_FOR_APP
- test/test_helper.rb
</pre>

<p>Come&ccedil;aremos a atualizar criando uma nova aplica&ccedil;&atilde;o Rails 3 no diret&oacute;rio da aplica&ccedil;&atilde;o. Para fazer isso, &eacute; necess&aacute;rio voltar ao ambiente do Ruby 1.9.2.</p>

<pre class="terminal">
$ rvm 1.9.2
</pre>

<p>Agora podemos criar a nova aplica&ccedil;&atilde;o Rails 3 com:</p>

<pre class="terminal">
$ rails new .
</pre>

<p>Como estamos criando uma nova aplica&ccedil;&atilde;o no mesmo diret&oacute;rio de uma existente, seremos questionados sobre sobrescrever alguns arquivos existentes. Se n&atilde;o temos certeza se o arquivo deve ser sobrescrito, podemos usar a op&ccedil;&atilde;o <code>d</code> para ver as diferen&ccedil;as entre o arquivo existente e o que vai sobrescrever.</p>

<p>N&oacute;s fizemos backup dos arquivos mais importantes e podemos sobrescrever todos os arquivos conflitantes, exceto esses:</p>

<ul style="list-style-type:disc; list-style-position: inside;">
 <li><code>/README</code></li>
 <li><code>/app/views/layouts/application.html.erb</code></li>
 <li><code>/public/javascripts/application.js</code></li>
</ul>
 
<p>Os outros arquivos, ou n&atilde;o tiveram mudan&ccedil;as, ou t&ecirc;m backup, nos permitindo refazer quaisquer altera&ccedil;&otilde;es na nova vers&atilde;o a medida que avan&ccedil;amos.</p>

<p>Nossa aplica&ccedil;&atilde;o est&aacute; agora atualizada para o Rails 3.0, mas ainda temos que percorrer os arquivos que fizemos backup e copiar qualquer c&oacute;digo que seja espec&iacute;fico da nossa aplica&ccedil;&atilde;o. Cada arquivo que foi feito backup, est&aacute; em seu diret&oacute;rio original com uma extens&atilde;o <code>.rails2</code>. Ent&atilde;o s&oacute; precisamos abrir cada arquivo de backup, juntamente com a nova vers&atilde;o, e copiar os c&oacute;digos que precisam ser mantidos.</p>

<p>Vamos come&ccedil;ar com o arquivo de rotas. A sintaxe das rotos mudou, mas a antiga ainda funciona no Rails 3, embora esteja obsoleta (deprecated). Nesse momento podemos apenas copiar as rotas do arquivo de backup para o novo arquivo de rotas e vamos testar isso depois.</p>

<p>Em seguida vamos dar uma olhada no arquivo <code>/config/environment.rb</code>. Corrigir esse arquivo vai dar um pouco mais de trabalho, pois a configura&ccedil;&atilde;o mudou bastante no Rails 3. O arquivo padr&atilde;o dos ambientes est&aacute; bem menor pois as op&ccedil;&otilde;es de configura&ccedil;&atilde;o n&atilde;o est&atilde;o mais l&aacute;, foram para o arquivo <code>/config/application.rb</code>.</p>

<p>Existem tr&ecirc;s coisas no backup do <code>environment.rb</code> que precisamos considerar. A primeira &eacute; a configura&ccedil;&atilde;o do time zone.</p>

<pre class="terminal">
config.time_zone = &#x27;Pacific Time (US &amp; Canada)&#x27;
</pre>

<p>Essa linha pode ser movida para o arquivo <code>/config/application.rb</code>.</p> 

<p>A segunda parte &eacute; o c&oacute;digo da sess&atilde;o.</p>

<pre class="terminal">
config.action_controller.session = {
  :session_key =&gt; APP_CONFIG[&#x27;session_key&#x27;],
  :secret      =&gt; APP_CONFIG[&#x27;session_secret&#x27;]
}
</pre>

<p>No Rails 3 esse c&oacute;digo pertence a um arquivo initializer e se olharmos esse arquivo, vamos ver o c&oacute;digo para configurar os dados de sess&atilde;o da aplica&ccedil;&atilde;o.</p>

<p class="codeFilePath">/config/initializers/session_store.rb</p>
<pre class="ruby">
# Be sure to restart your server when you modify this file.

Railscasts::Application.config.session_store :cookie_store, :key =&gt; &#x27;_railscasts_session&#x27;

# Use the database for sessions instead of the cookie-based default,
# which shouldn&#x27;t be used to store highly confidential information
# (create the session table with &quot;rake db:sessions:create&quot;)
# Railscasts::Application.config.session_store :active_record_store
</pre>

<p>Podemos deixar esse c&oacute;digo como est&aacute; por enquanto. Vamos alterar isso depois, mas isso n&atilde;o ser&aacute; necess&aacute;rio para ter o site instalado e funcionando.</p>

<p>Finalmente, no final do arquivo de backup do <code>environment.rb</code> est&aacute; o c&oacute;digo de configura&ccedil;&atilde;o das gems da aplica&ccedil;&atilde;o.</p>

<pre class="ruby">
config.gem &quot;RedCloth&quot;, :lib =&gt; &#x27;redcloth&#x27;, :version =&gt; &quot;&gt;= 4.0&quot;
config.gem &quot;coderay&quot;
config.gem &#x27;acts-as-list&#x27;
config.gem &#x27;will_paginate&#x27;
config.gem &#x27;thinking-sphinx&#x27;, :lib =&gt; &#x27;thinking_sphinx&#x27;
config.gem &#x27;whenever&#x27;, :lib =&gt; false
</pre>

<p>Esse c&oacute;digo pode ser copiado para o <code>Gemfile</code>, que est&aacute; no diret&oacute;rio raiz da aplica&ccedil;&atilde;o. A sintaxe foi ligeiramente modificada e o c&oacute;digo precisa ser alterado assim:</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &quot;RedCloth&quot;, &quot;&gt;=4.0&quot;, :require =&gt; &#x27;redcloth&#x27;
gem &quot;coderay&quot;
gem &#x27;acts-as-list&#x27;
gem &#x27;will_paginate&#x27;
gem &#x27;thinking-sphinx&#x27;, :require =&gt; &#x27;thinking_sphinx&#x27;
gem &#x27;whenever&#x27;, :require =&gt; false
</pre>

<p>Al&eacute;m de alterar o <code>config.gem</code> para <code>gem</code> em cada linha, h&aacute; algumas outras altera&ccedil;&otilde;es que precisamos fazer. O n&uacute;mero da vers&atilde;o agora &eacute; passado como segundo par&acirc;metro e a op&ccedil;&atilde;o <code>:lib</code> foi renomeada para <code>:required</code>.</p>

<p>Feito isso, precisamos executar <code>bundle install</code> para ter certeza de que todas as gems necess&aacute;rias est&atilde;o instaladas. Para mais informa&ccedil;&otilde;es sobre o bundler e instala&ccedil;&atilde;o de gems voc&ecirc; pode <a href="http://railscasts.com/episodes/201-bundler">assistir</a> ou <a href="http://asciicasts.com/episodes/201-bundler">ler</a> o epis&oacute;dio 201. N&atilde;o vamos falar em copiar os c&oacute;digos dos outros arquivos de backup, mas deve ser bastante simples transferir o c&oacute;digo necess&aacute;rio do backup para o novo arquivo.</p>

<p>Com as gems instaladas, vamos tentar iniciar o servidor para ver se a aplica&ccedil;&atilde;o ser&aacute; iniciada.</p>

<pre class="terminal">
$ rails s
/Users/eifion/.rvm/gems/ruby-1.8.7-p299/gems/will_paginate-2.3.14/lib/will_paginate.rb:39:in `enable_activerecord&#x27;: 
undefined method `returning&#x27; for WillPaginate:Module (NoMethodError)
# rest of error truncated&hellip;
</pre>

<p>N&atilde;o foi. E o motivo foi um erro no c&oacute;digo da gem <code>will_paginate</code>, onde temos um m&eacute;todo <code>returning</code> indefinido. Esse m&eacute;todo estava dispon&iacute;vel no Rails 2, mas foi removido no Rails 3.</p>

<p>Em casos como esse, vale a pena chegar o site <a href="http://rubygems.org">RubyGems</a> para ver se h&aacute; dispon&iacute;vel uma nova vers&atilde;o da gem em prerelease compat&iacute;vel com o Rails 3. No caso do <code>will_paginate</code> existe e podemos usar, acrescentando o n&uacute;mero da vers&atilde;o da gem em nosso <code>Gemfile</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="terminal">
gem &#x27;will_paginate&#x27;, &#x27;&gt;=3.0.pre&#x27;
</pre>

<p>Se executarmos <code>bundle install</code> novamente, a vers&atilde;o prerelease da gem ser&aacute; instalada e poderemos usar. Agora podemos tentar iniciar o servidor de novo.</p>

<pre class="terminal">
$ rails s
/Users/eifion/.rvm/gems/ruby-1.8.7-p299/gems/after_commit-1.0.7/lib/after_commit/active_record.rb:15:in `include_after_commit_extensions&#x27;: undefined method `subclasses_of&#x27; for Object:Class (NoMethodError)
	from /Users/eifion/.rvm/gems/ruby-1.8.7-p299/gems/after_commit-1.0.7/lib/after_commit.rb:81
	from /Users/eifion/.rvm/gems/ruby-1.8.7-p299/gems/thinking-sphinx-1.3.18/lib/thinking_sphinx.rb:2:in `require&#x27;
	from /Users/eifion/.rvm/gems/ruby-1.8.7-p299/gems/thinking-sphinx-1.3.18/lib/thinking_sphinx.rb:2
</pre>

<p>Esse erro parece ter sido causado pela gem Thinking Sphinx. Novamente h&aacute; uma vers&atilde;o prerelease dispon&iacute;vel que podemos usar. Ent&atilde;o temos que fazer outra altera&ccedil;&atilde;o no <code>Gemfile</code> e da&iacute; executar o <code>bundle install</code> de novo.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &#x27;thinking-sphinx&#x27;, &#x27;&gt;=2.0.0.rc1&#x27;, :require =&gt; &#x27;thinking_sphinx&#x27;
</pre>

<p>Vamos tentar iniciar o servidor de novo.</p>

<pre class="terminal">
$ rails s
DEPRECATION WARNING: railtie_name is deprecated and has no effect. (called from &lt;class:Railtie&gt; at /Users/eifion/.rvm/gems/ruby-1.9.2-rc2/gems/will_paginate-3.0.pre/lib/will_paginate/railtie.rb:6)
=&gt; Booting WEBrick
=&gt; Rails 3.0.0.rc application starting in development on http://0.0.0.0:3000
=&gt; Call with -d to detach
=&gt; Ctrl-C to shutdown server
Exiting
/Users/eifion/rails/apps_for_asciicasts/ep225/railscasts/config/routes.rb:2:in `block in &lt;top (required)&gt;&#x27;: undefined local variable or method `map&#x27; for #&lt;ActionDispatch::Routing::Mapper:0x00000101dffde8&gt; (NameError)
</pre>

<p>Dessa vez temos algo novo. O servidor tenta iniciar mas reclama sobre uma vari&aacute;vel ou m&eacute;todo indefinido chamado <code>map</code> nas rotas. Conforme n&oacute;s colamos o antigo c&oacute;digo das rotas no novo arquivo de rotas, estamos usando uma vari&aacute;vel <code>map</code>, mas a vari&aacute;vel n&atilde;o &eacute; passada para o bloco, pois ela n&atilde;o &eacute; obrigat&oacute;ria no Rails 3. N&oacute;s ainda podemos usar a antiga sintaxe de rotas e passar essa vari&aacute;vel.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Railscasts::Application.routes.draw do |map|
  map.resources :spam_questions

  map.resources :spam_checks

  map.with_options :controller =&gt; &#x27;info&#x27; do |info|
    info.about &#x27;about&#x27;, :action =&gt; &#x27;about&#x27;
    info.contest &#x27;contest&#x27;, :action =&gt; &#x27;contest&#x27;
    info.feeds &#x27;feeds&#x27;, :action =&gt; &#x27;feeds&#x27;
    info.give_back &#x27;give_back&#x27;, :action =&gt; &#x27;give_back&#x27;
  end
  
  map.login &#x27;login&#x27;, :controller =&gt; &#x27;sessions&#x27;, :action =&gt; &#x27;new&#x27;
  map.logout &#x27;logout&#x27;, :controller =&gt; &#x27;sessions&#x27;, :action =&gt; &#x27;destroy&#x27;
  
  map.resources :sponsors
  map.resources :comments
  map.resources :tags
  map.resources :episodes, :collection =&gt; { :archive =&gt; :get }
  map.resources :sessions
  map.resources :spam_reports, :member =&gt; { :confirm =&gt; :post }, :collection =&gt; { :confirm =&gt; :post }
  
  map.root :episodes
end
</pre>

<p>Quando tentamos iniciar o servidor pela quarta vez, temos sorte e ele inicia sem erros.</p>

<pre class="terminal">
$ rails s
DEPRECATION WARNING: railtie_name is deprecated and has no effect. (called from &lt;class:Railtie&gt; at /Users/eifion/.rvm/gems/ruby-1.9.2-rc2/gems/will_paginate-3.0.pre/lib/will_paginate/railtie.rb:6)
=&gt; Booting WEBrick
=&gt; Rails 3.0.0.rc application starting in development on http://0.0.0.0:3000
=&gt; Call with -d to detach
=&gt; Ctrl-C to shutdown server
[2010-08-05 19:30:22] INFO  WEBrick 1.3.1
[2010-08-05 19:30:22] INFO  ruby 1.9.2 (2010-07-11) [x86_64-darwin10.4.0]
[2010-08-05 19:30:22] INFO  WEBrick::HTTPServer#start: pid=9933 port=3000
</pre>

<p>Se visitarmos a p&aacute;gina principal no navegador, vamos ver a p&aacute;gina inicial padr&atilde;o, pois ela foi recriada no diret&oacute;rio <code>/public</code> quando criamos a aplica&ccedil;&atilde;o Rails 3. Podemos ver nessa p&aacute;gina, que o ambiente correto est&aacute; sendo usado.</p>

<div class="imageWrapper">
  <img src="/system/photos/439/original/E225I01.png" width="807" height="538" alt="The default home page of our updates application."/>
</div>

<p>Embora tenhamos iniciado o servidor com sucesso, ainda temos muitas coisas que precisamos corrigir, como vemos quando executamos <code>rails:upgrade:check</code> novamente. Tamb&eacute;m precisamos executar nossas <code>specs</code> de novo para ver se elas passam. N&oacute;s vamos fazer isso no pr&oacute;ximo epis&oacute;dio.</p>