<p>&#x7B2C;16&#x96C6;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x8BB2;&#x5230;&#x4E86;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x8FD8;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5148;&#x8BFB;&#x4E00;&#x4E0B;&#x90A3;&#x4E00;&#x96C6;&#x7684;&#x6587;&#x5B57;&#x7248;&#xFF0C;&#x6216;&#x8005;&#x770B;&#x90A3;&#x96C6;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5C06;&#x4F1A;&#x5BF9;&#x4F60;&#x7406;&#x89E3;&#x672C;&#x96C6;&#x7684;&#x5185;&#x5BB9;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x5F53;&#x4F60;&#x8981;&#x5904;&#x7406;&#x7684;&#x8868;&#x5355;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5B57;&#x6BB5;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5BF9;&#x5E94;&#x5230;&#x4F60;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x5C5E;&#x6027;&#x4E0A;&#x7684;&#x8BDD;&#xFF0C;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x4F1A;&#x5927;&#x663E;&#x8EAB;&#x624B;&#x3002;</p>

<p>&#x672C;&#x96C6;&#x5F53;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7ED3;&#x5408;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7528;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x6765;&#x7ED9;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x589E;&#x52A0;&#x6807;&#x7B7E;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x6587;&#x7AE0;&#x7684;&#x7B80;&#x5355;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/131/original/E167I01.png" width="823" height="462" alt="The articles page from our example blogging app."/>
</div> 

<p>&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x6846;&#x4E2D;&#x8F93;&#x5165;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x3001;&#x6216;&#x8005;&#x65B0;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x628A;&#x4ED6;&#x4EEC;&#x52A0;&#x5230;&#x4E00;&#x7BC7;&#x65B0;&#x6587;&#x7AE0;&#x4E0A;&#x3002;&#x867D;&#x7136;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x7ED9; Rails &#x7528;&#x7684;&#x6807;&#x7B7E;&#x63D2;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x6253;&#x7B97;&#x91CD;&#x5934;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5229;&#x7528;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x5C06;&#x53D8;&#x7684;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;</p>
 
<h3>&#x521B;&#x5EFA;&#x6570;&#x636E;&#x6A21;&#x578B;</h3>
 
<p>&#x6211;&#x4EEC;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>Tag</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C; <code>name</code> &#x3002;
&#x63A7;&#x5236;&#x53F0;&#x4EE3;&#x7801;</p>

<pre class="terminal">
script/generate model tag name:string  
</pre>

<p><code>Tag</code> &#x548C;<code>Article</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x5FC5;&#x7136;&#x662F;&#x6709;&#x8054;&#x7CFB;&#x7684;&#x3002;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x4E5F;&#x53EF;&#x4EE5;&#x5C5E;&#x4E8E;&#x591A;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x8D77;&#x540D;&#x53EB;<code>Tagging</code> &#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x5B57;&#x6BB5;&#xFF0C;<code>article_id</code> &#x548C;<code>tag_id</code> &#xFF0C;&#x5206;&#x522B;&#x662F;<code>Article</code> &#x548C;<code>Tag</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x5916;&#x90E8;&#x952E;&#x3002;
&#x63A7;&#x5236;&#x53F0;&#x4EE3;&#x7801;</p> 

<pre class="terminal">
script/generate model tagging article_id:integer tag_id:integer  
</pre>

<p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x65B0;&#x5EFA;&#x7684;&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>

<pre class="terminal">
rake db:migrate
</pre>
  
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x4F1A;&#x5F88;&#x5FEB;&#x5730;&#x5728;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x6765;&#x5B9A;&#x4E49;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x3002;<code>Tagging</code> &#x5C06;&#x540C;&#x65F6;&#x5C5E;&#x4E8E;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;<code>belong_to</code> &#xFF09;<code>Article</code> &#x548C;<code>Tag</code> &#x3002;</p>

<p class="codeFilePath">/app/models/tagging.rb</p>
<pre class="ruby">
class Tagging &lt; ActiveRecord::Base     
  belongs_to :article    
  belongs_to :tag    
end
</pre>
  
<p><code>Tag</code> &#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code>Article</code> &#x7684;<code>has_many :though</code> &#x7684;&#x5173;&#x7CFB;&#x3002;</p>

<p class="codeFilePath">/app/models/tag.rb</p>
<pre class="ruby">
class Tag &lt; ActiveRecord::Base     
  has_many :taggings, :dependent =&gt; :destroy    
  has_many :articles, :through =&gt; :taggings    
end 
</pre>   
  
<p>&#x540C;&#x6837;&#xFF0C;<code>Article</code> &#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code>Tag</code> &#x8FD9;&#x6837;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>

<p class="codeFilePath">/app/models/article.rb</p>
<pre class="ruby">
class Article &lt; ActiveRecord::Base  
  has_many :comments, :dependent =&gt; :destroy  
  has_many :taggings, :dependent =&gt; :destroy  
  has_many :tags, :through =&gt; :taggings  
  validates_presence_of :name, :content  
end 
</pre> 
  
<p>&#x6CE8;&#x610F;&#x5728;<code>Tag</code> &#x548C;<code>Article</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7528;&#x5230;&#x7684; <code>:dependent =&gt; :destroy</code> &#x3002;&#x8FD9;&#x5C06;&#x4FDD;&#x8BC1;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;<code>Tag</code> &#x6216;&#x8005;<code>Article</code> &#x88AB;&#x5220;&#x9664;&#x540E;&#x3001;&#x4EFB;&#x4F55;&#x4E0D;&#x88AB;&#x5F15;&#x7528;&#x7684;<code>Tagging</code> &#x4E5F;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x3002;</p>
 
<h3>&#x89C6;&#x56FE;</h3>
 
<p>&#x641E;&#x5B9A;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x7AE0;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x52A0;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x6846;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x8F93;&#x5165;&#x7A7A;&#x683C;&#x5206;&#x9694;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4F7F;&#x5176;&#x4E0E;&#x6587;&#x7AE0;&#x5173;&#x8054;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x6587;&#x672C;&#x6846;&#x4E2D;&#x7684;&#x6587;&#x5B57;&#x8F6C;&#x5316;&#x4E3A;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7B80;&#x6D01;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x7528;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x3002;</p>

<p class="codeFilePath">/app/views/articles/new.html.erb</p>
<pre class="ruby">
&lt;% form_for @article do |form| %&gt;     
  &lt;ol class=&quot;formList&quot;&gt;     
    &lt;li&gt;     
      &lt;%= form.label :name, &quot;Name&quot; %&gt;     
      &lt;%= form.text_field :name %&gt;     
    &lt;/li&gt;     
    &lt;li&gt;     
      &lt;%= form.label :tag_names, &quot;Tags&quot; %&gt;     
      &lt;%= form.text_field :tag_names %&gt;     
    &lt;li&gt;     
      &lt;%= form.label :content, &quot;Content&quot; %&gt;     
      &lt;%= form.text_area :content, :rows =&gt; 10 %&gt;     
    &lt;/li&gt;     
    &lt;li&gt;     
      &lt;%= form.submit &quot;Submit&quot; %&gt;     
    &lt;/li&gt;     
  &lt;/ol&gt;     
&lt;% end %&gt;    
</pre>
<p class="title">&#x6DFB;&#x52A0;&#x4E86;<code>tag_names</code>&#x5B57;&#x6BB5;&#x7684;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x7AE0;&#x7684;&#x8868;&#x5355;</p>
 
<p>&#x6211;&#x4EEC;&#x7684;<code>Article</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x53EB;<code>tag_names</code> &#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x6765;&#x8868;&#x793A;&#x5173;&#x8054;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6807;&#x7B7E;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8BFB;&#x65B9;&#x6CD5;&#x548C;&#x8D4B;&#x503C;&#x65B9;&#x6CD5;&#x6765;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;<code>Article</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;<code>tag_names=</code> &#x65B9;&#x6CD5;&#x6765;&#x7ED9;&#x6587;&#x7AE0;&#x7684;&#x6807;&#x7B7E;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x9677;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x662F;&#xFF0C;&#x65E0;&#x8BBA;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x4FDD;&#x5B58;&#xFF0C;&#x5728;&#x8D4B;&#x503C;&#x51FD;&#x6570;&#x4E2D;&#x521B;&#x5EFA;&#x6807;&#x7B7E;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>Tagging</code> &#x8BB0;&#x5F55;&#x3002;</p>
 
<p>&#x66F4;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x5728; <code>Article</code> &#x7C7B;&#x4E2D;&#x7528;&#x4E00;&#x4E2A; <code>after_save</code> &#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x5728;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x88AB;&#x4FDD;&#x5B58;&#x540E;&#x5B83;&#x7684;&#x6807;&#x7B7E;&#x624D;&#x4F1A;&#x88AB;&#x4FDD;&#x5B58;&#x3002;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>

<p class="codeFilePath">/app/models/article.rb</p>
<pre class="ruby">
class Article &lt; ActiveRecord::Base     
  has_many :comments, :dependent =&gt; :destroy    
  has_many :taggings, :dependent =&gt; :destroy    
  has_many :tags, :through =&gt; :taggings    
  validates_presence_of :name, :content    
    
  attr_accessor :tag_names    
  after_save :assign_tags    
    
  private     
  def assign_tags     
    if @tag_names    
      self.tags = @tag_names.split(/\s+/).map do |name|     
        Tag.find_or_create_by_name(name)     
      end    
    end    
  end    
    
end    
</pre>

<p>&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4E3A;&#x865A;&#x62DF;&#x5C5E;&#x6027; <code>tag_names</code> &#x5B9A;&#x4E49;&#x8BFB;&#x65B9;&#x6CD5;&#x548C;&#x8D4B;&#x503C;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x5668;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A; accessor &#xFF09;&#x6765;&#x5B9A;&#x4E49;&#x3002;&#x5F53;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x88AB;&#x4FDD;&#x5B58;&#x540E;&#xFF0C;&#x79C1;&#x6709;&#x65B9;&#x6CD5; <code>assign_tags</code> &#x5C06;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5B83;&#x5148;&#x770B; <code>@tag_names</code> &#x662F;&#x4E0D;&#x662F; <code>nil</code> &#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5C31;&#x628A;&#x5B83;&#x7684;&#x503C;&#x6309;&#x627E;&#x5230;&#x7684;&#x7A7A;&#x683C;&#x6765;&#x5206;&#x5272;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x3002;&#x7136;&#x540E;&#x518D;&#x7528; <code>map</code> &#x65B9;&#x6CD5;&#x8FED;&#x4EE3;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#x8FD4;&#x56DE;&#x6BCF;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x3002; <code>find_or_create_by_name</code> &#x51FD;&#x6570;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x6807;&#x7B7E;&#x4E0D;&#x5B58;&#x5728;&#x5C31;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A; <code>Tag</code> &#x6570;&#x7EC4;&#x8D4B;&#x503C;&#x7ED9; <code>Article</code> &#x7C7B;&#x7684; <code>tags</code> &#x5C5E;&#x6027;&#x3002;</p>
 
<p>&#x7ECF;&#x8FC7;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E0A;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x65B0;&#x5EFA;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3001;&#x5E76;&#x7ED9;&#x5B83;&#x52A0;&#x4E00;&#x4E9B;&#x6807;&#x7B7E;&#x6765;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
 
<div class="imageWrapper">
  <img src="/system/photos/132/original/E167I02.png" width="808" height="536" alt="Adding a new article with tags."/>
</div>

<p>&#x65B0;&#x5EFA;&#x597D;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x540E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528; Rails &#x7684;&#x63A7;&#x5236;&#x53F0;&#x6765;&#x770B;&#x770B;&#x5B83;&#x7684;&#x6807;&#x7B7E;&#x662F;&#x4E0D;&#x662F;&#x5DF2;&#x7ECF;&#x88AB;&#x6B63;&#x786E;&#x7684;&#x52A0;&#x4E0A;&#x4E86;&#x3002;</p>

<pre class="terminal">
&gt;&gt; a = Article.last  
=&gt; #&lt;Article id: 3, name: &quot;New Article&quot;, content: &quot;I am a new article.&quot;, author_name: nil, created_at: &quot;2009-06-24 20:38:56&quot;, updated_at: &quot;2009-06-24 20:38:56&quot;&gt;  
&gt;&gt; a.tags  
=&gt; [#&lt;Tag id: 1, name: &quot;stuff&quot;, created_at: &quot;2009-06-24 20:38:56&quot;, updated_at: &quot;2009-06-24 20:38:56&quot;&gt;, #&lt;Tag id: 2, name: &quot;things&quot;, created_at: &quot;2009-06-24 20:38:56&quot;, updated_at: &quot;2009-06-24 20:38:56&quot;&gt;]  
</pre>

<p>&#x6CA1;&#x9519;&#xFF0C;&#x4E24;&#x4E2A;&#x6807;&#x7B7E;&#x5DF2;&#x7ECF;&#x88AB;&#x521B;&#x5EFA;&#x5E76;&#x4E14;&#x5173;&#x8054;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x7AE0;&#x4E0A;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x5927;&#x529F;&#x544A;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x7F16;&#x8F91;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x6807;&#x7B7E;&#x6587;&#x672C;&#x6846;&#x91CC;&#x662F;&#x7A7A;&#x7684;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/133/original/E167I03.png" width="808" height="536" alt="The tags field is not repopulated when the article is invalid."/>
</div> 

<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6539;&#x4E00;&#x4E0B;<code>Article</code> &#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x4E3A;<code>tag_names</code> &#x52A0;&#x4E00;&#x4E2A;&#x8BFB;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C06;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6240;&#x6709;&#x6807;&#x7B7E;&#x4EE5;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x663E;&#x5F0F;&#x5730;&#x52A0;&#x4E00;&#x4E2A;&#x8BFB;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;<code>attr_accessor</code> &#x66FF;&#x6362;&#x4E3A;<code>attr_writer</code> &#x3002;</p> 


<p class="codeFilePath">/app/models/article.rb</p>
<pre class="ruby">
def tag_names     
  @tag_names || tags.map(&amp;:name).join(&#x27; &#x27;)     
end
</pre>
  
<p>&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x53D8;&#x91CF;<code>@tag_names</code> &#x5DF2;&#x7ECF;&#x6709;&#x503C;&#xFF0C;&#x5C31;&#x8FD4;&#x56DE;&#x5B83;&#xFF1B;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5C31;&#x628A;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6240;&#x6709;&#x7684;&#x6807;&#x7B7E;&#x7528;&#x7A7A;&#x683C;&#x8FDE;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x3002;</p>
 

<h3>&#x4E0E;&#x9A8C;&#x8BC1;&#x5668;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;Validators&#xFF09;&#x4E00;&#x540C;&#x5DE5;&#x4F5C;</h3>
 
<p>&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x548C;&#x9A8C;&#x8BC1;&#x5668;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x540C;&#x65F6;&#x5220;&#x9664;&#x6587;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x4F7F;&#x5F97;&#x8868;&#x5355;&#x4E0D;&#x5408;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x6709;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x6807;&#x7B7E;&#x6587;&#x672C;&#x6846;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x8FD8;&#x80FD;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
 
<div class="imageWrapper">
  <img src="/system/photos/134/original/E167I04.png" width="808" height="627" alt="The tags field now has its value maintained when the form in invalid."/>
</div>
 
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;<code>after_save</code> &#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6CA1;&#x6709;&#x88AB;&#x4FDD;&#x5B58;&#x524D;&#xFF0C;&#x65B0;&#x6807;&#x7B7E;&ldquo;etc&rdquo;&#x4E0D;&#x4F1A;&#x88AB;&#x521B;&#x5EFA;&#x3002;&#x6807;&#x7B7E;&#x4EE5;&#x53CA;&#x5B83;&#x548C;&#x6587;&#x7AE0;&#x7684;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x53EA;&#x6709;&#x5728;&#x8868;&#x5355;&#x5408;&#x6CD5;&#x5E76;&#x4E14;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x88AB;&#x4FDD;&#x5B58;&#x540E;&#x624D;&#x4F1A;&#x88AB;&#x521B;&#x5EFA;&#x3002;</p>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x7AE0;&#x52A0;&#x6807;&#x7B7E;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8868;&#x5355;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x6216;&#x8005;&#x91CC;&#x9762;&#x6709;&#x5173;&#x8054;&#x5230;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x865A;&#x62DF;&#x5C5E;&#x6027;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x771F;&#x7684;&#x503C;&#x5F97;&#x4E00;&#x7528;&#x3002;</p>