<p>&#x4E0B;&#x9762;&#x663E;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7528;Rails&#x5F00;&#x53D1;&#x7684;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x9875;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x96C6;&#x6210;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7F51;&#x7AD9;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x8BA9;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x3002;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5217;&#x8868;&#x6307;&#x5411;&#x53E6;&#x5916;&#x4E00;&#x4E2A;Rails&#x76F8;&#x5173;&#x7684;&#x7AD9;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;ASCIIcasts&#x4E0A;&#x6700;&#x65B0;&#x6587;&#x7AE0;&#x7684;&#x5217;&#x8868;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/135/original/E168I01.png" width="823" height="468" alt="The home page of our blogging application" />
</div>

<p>&#x8BBF;&#x95EE;asciicasts.com&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E3B;&#x9875;&#x4E0A;&#x6700;&#x65B0;&#x6587;&#x7AE0;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5F04;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x6765;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9875;&#x9762;&#x6293;&#x53D6;&#xFF0C;&#x6293;&#x5230;&#x9875;&#x9762;&#x7684;HTML&#x6570;&#x636E;&#xFF0C;&#x901A;&#x8FC7;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x5F88;&#x591A;&#x7F3A;&#x70B9;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7AD9;&#x7684;&#x7AD9;&#x957F;&#x6539;&#x53D8;&#x4E86;&#x9875;&#x9762;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x6790;&#x4EE3;&#x7801;&#x5C31;&#x6CA1;&#x6CD5;&#x6B63;&#x786E;&#x5730;&#x62BD;&#x53D6;&#x51FA;&#x6570;&#x636E;&#x4E86;&#x3002;</p>

<p>&#x73B0;&#x5728;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;RSS&#x8BA2;&#x9605;&#x70B9;&#x3002;ASCIIcasts&#x7AD9;&#x6709;&#x4E00;&#x4E2A;RSS&#x8BA2;&#x9605;&#x70B9;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x96C6;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x9700;&#x8981;&#x6293;&#x53D6;&#x7AD9;&#x70B9;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x8BA2;&#x9605;&#x70B9;&#x6765;&#x63D0;&#x53D6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>

<h3>Feedzirra</h3>

<p>Ruby&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x89E3;&#x6790;RSS&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x4F73;&#x65B9;&#x6848;&#x4E4B;&#x4E00;&#x662F;&#x4E00;&#x4E2A;&#x53EB;<a href="http://github.com/pauldix/feedzirra/tree/master">Feedzirra</a>&#x7684;gem&#x3002;Feedzirra&#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x5B83;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5FEB;&#x5730;&#x89E3;&#x6790;&#x8BA2;&#x9605;&#x70B9;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x6790;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8BA2;&#x9605;&#x70B9;&#x3002;</p>

<p>&#x5B89;&#x88C5;Feedzirra&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x770B;&#x770B;<code>http://gems.github.com</code>&#x662F;&#x4E0D;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x7684;gem&#x6E90;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x5148;&#x52A0;&#x4E0A;&#x3002;</p>

<pre class="terminal">
gem sources -a http://gems.github.com  
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;gem&#x4E86;&#xFF1A;
&#x63A7;&#x5236;&#x53F0;&#x4EE3;&#x7801;</p>

<pre class="terminal">
sudo gem install pauldix-feedzirra  
</pre>

<p>&#x5B89;&#x88C5;&#x8FD9;&#x4E2A;gem&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x540C;&#x65F6;&#x5B89;&#x88C5;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x4F9D;&#x8D56;&#x7684;&#x5305;&#x3002;&#x90FD;&#x88C5;&#x5B8C;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5728;&#x7A0B;&#x5E8F;&#x7684;<code>/config/environment.rb</code>&#x91CC;&#x9762;&#x52A0;&#x5165;&#x5BF9;&#x8FD9;&#x4E2A;gem&#x7684;&#x5F15;&#x7528;&#x3002;</p>

<p class="codeFilePath">/config/environment.rb</p>
<pre class="ruby">
config.gem &quot;pauldix-feedzirra&quot;, :lib =&gt; &quot;feedzirra&quot;, :source =&gt; &quot;http://gems.github.com&quot;  
</pre> 

<p>&#x641E;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x91CC;&#x89E3;&#x6790;RSS&#x8BA2;&#x9605;&#x70B9;&#x4E86;&#x3002;</p>

<h3>&#x63D0;&#x8D77;&#x53D6;&#x8BA2;&#x9605;&#x70B9;</h3>

<p>&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x663E;&#x793A;&#x5728;&#x6211;&#x4EEC;&#x7AD9;&#x70B9;&#x7684;&#x4E3B;&#x9875;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x5728;&#x7528;&#x6237;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x53BB;&#x8BFB;&#x53D6;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x6837;&#x592A;&#x8D39;&#x65F6;&#x8D39;&#x529B;&#x4E86;&#x3002;&#x6700;&#x597D;&#x662F;&#x80FD;&#x628A;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x7F13;&#x5B58;&#x5728;&#x672C;&#x5730;&#x3002;&#x7F13;&#x5B58;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6765;&#x8868;&#x793A;&#x8BA2;&#x9605;&#x70B9;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x3002;&#x6211;&#x4EEC;&#x7ED9;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x8D77;&#x540D;&#x53EB;<code>feed_entry</code>&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7528;&#x56DB;&#x4E2A;&#x5C5E;&#x6027;&#x6765;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x7684;&#x6570;&#x636E;&#xFF0C;<code>name</code>&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x6807;&#x9898;&#xFF0C;summary&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x5185;&#x5BB9;&#xFF0C;<code>url</code>&#x4FDD;&#x5B58;&#x6761;&#x76EE;&#x7684;&#x94FE;&#x63A5;&#xFF0C;<code>published_at</code>&#x4FDD;&#x5B58;&#x6761;&#x76EE;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;<code>guid</code>&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x6765;&#x53BB;&#x9664;&#x91CD;&#x590D;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x6765;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x6A21;&#x578B;</p>

<pre class="terminal">
script/generate model feed_entry name:string summary:text url:string published_at:datetime guid:string
</pre>

<p>&#x7136;&#x540E;&#x6267;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#x6765;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x8868;&#x3002;</p>

<pre class="terminal">
rake db:migrate  
</pre>

<p>&#x89E3;&#x6790;&#x8BA2;&#x9605;&#x70B9;&#x548C;&#x66F4;&#x65B0;&#x6761;&#x76EE;&#x7684;&#x903B;&#x8F91;&#x8981;&#x52A0;&#x5230;<code>FeedEntry</code>&#x7C7B;&#x91CC;&#x9762;&#x53BB;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x6790;&#x8BA2;&#x9605;&#x70B9;&#x5E76;&#x4E14;&#x628A;&#x65B0;&#x7684;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x65B9;&#x6CD5;<code>update_from_feed</code>&#x3002;</p>

<p class="codeFilePath">/app/models/FeedEntry.rb</p>
<pre class="ruby">
def self.update_from_feed(feed_url)     
  feed = Feedzirra::Feed.fetch_and_parse(feed_url)     
  feed.entries.each do |entry|     
    unless exists? :guid =&gt; entry.id     
      create!(     
        :name         =&gt; entry.title,     
        :summary      =&gt; entry.summary,     
        :url          =&gt; entry.url,     
        :published_at =&gt; entry.published,     
        :guid         =&gt; entry.id     
      )     
    end    
  end    
end
</pre>

<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x662F;&#x7ED9;Feedzirra&#x7528;&#x6765;&#x89E3;&#x6790;&#x7684;&#x8BA2;&#x9605;&#x70B9;URL&#x3002;Feedzirra&#x63D0;&#x53D6;&#x8BA2;&#x9605;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x6790;&#xFF0C;&#x7136;&#x540E;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x6BCF;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x628A;&#x4ED6;&#x4EEC;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;ActiveRecord&#x4E2D;&#x7684;<code>exists?</code>&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x6761;&#x76EE;&#x7684;guid&#x6765;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x662F;&#x4E0D;&#x662F;&#x5DF2;&#x7ECF;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E86;&#x3002;</p>

<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x4E0A;&#x8BD5;&#x8BD5;&#x6211;&#x4EEC;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;ASCIIcasts&#x7684;&#x8BA2;&#x9605;&#x70B9;&#x4E0A;&#x63D0;&#x53D6;&#x6761;&#x76EE;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x3002;</p>

<pre class="terminal">
&gt;&gt; FeedEntry.update_from_feed(&quot;http://asciicasts.com/episodes.xml&quot;)  
</pre>

<p>&#x63D0;&#x53D6;&#x548C;&#x89E3;&#x6790;&#x8BA2;&#x9605;&#x70B9;&#x4F1A;&#x6709;&#x51E0;&#x79D2;&#x949F;&#x7684;&#x5EF6;&#x65F6;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;FeedZilla&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x90FD;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x6211;&#x4EEC;&#x8981;&#x7684;&#x6761;&#x76EE;&#x3002;</p>

<pre class="terminal">
&gt;&gt; FeedEntry.count 
=&gt; 61  
</pre> 

<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x518D;&#x8FD0;&#x884C;&#x4E00;&#x904D;&#x521A;&#x624D;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x628A;&#x4E0A;&#x6B21;&#x8FD0;&#x884C;&#x540E;&#x624D;&#x6709;&#x7684;&#x65B0;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x3002;&#x4E3A;&#x4E86;&#x53CA;&#x65F6;&#x540C;&#x6B65;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x8BA1;&#x5212;&#x4EFB;&#x52A1;&#x6765;&#x5B9A;&#x671F;&#x63D0;&#x53D6;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#x3002;<a href="http://asciicasts.com/episodes/164-cron-in-ruby">164&#x96C6;</a>&#x4E2D;&#x8BB2;&#x5230;&#x7684;&#x53EB;Whenever&#x7684;gem&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BBE;&#x5B9A;&#x8FD9;&#x6837;&#x7684;&#x8BA1;&#x5212;&#x4EFB;&#x52A1;&#x3002;</p>

<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x4E86;&#x6211;&#x4EEC;&#x8981;&#x7684;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6539;&#x4E00;&#x6539;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x56FE;&#x4EE3;&#x7801;&#x6765;&#x663E;&#x793A;&#x6700;&#x65B0;&#x7684;&#x6761;&#x76EE;&#x4E86;&#x3002;&#x5728;&#x6587;&#x7AE0;&#x7684;&#x7D22;&#x5F15;&#x89C6;&#x56FE;&#x7684;&#x6700;&#x4E0A;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x663E;&#x793A;10&#x6761;&#x6700;&#x65B0;&#x7684;&#x6761;&#x76EE;</p>

<pre class="ruby">
&lt;div id=&quot;recent_episodes&quot;&gt;     
  &lt;h3&gt;Recent ASCIIcasts Episodes&lt;/h3&gt;     
  &lt;ul&gt;     
  &lt;% for entry in FeedEntry.all(:limit =&gt; 10, :order =&gt; &quot;published_at desc&quot;) %&gt;     
    &lt;li&gt;&lt;%= link_to h(entry.name), entry.url %&gt;&lt;/li&gt;     
  &lt;% end %&gt;     
  &lt;/ul&gt;     
&lt;/div&gt;
</pre>  

<p>&#x7ED9;div&#x52A0;&#x4E00;&#x4E9B;CSS&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x5217;&#x8868;&#x663E;&#x793A;&#x5728;&#x6587;&#x7AE0;&#x9875;&#x9762;&#x7684;&#x53F3;&#x4E0A;&#x89D2;&#x3002;</p>

<pre class="terminal">
#recent_episodes { float: right; border: solid 1px #666; margin: 8px 0 16px 16px; padding: 4px; background-color: #DDD; }  
#recent_episodes h3 { margin: 0; font-size: 1em; }  
#recent_episodes ul { list-style: none; margin-left: 8px; padding-left: 0; }  
#recent_episodes a { font-size: 0.9em; }  
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9875;&#x9762;&#x4E0A;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x53EF;&#x4EE5;&#x663E;&#x793A;ASCIIcasts&#x7684;&#x6700;&#x65B0;&#x6587;&#x7AE0;&#x4E86;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/136/original/E168I02.png" width="824" height="473" alt="The home page now shows the data from the feed." />
</div>

<h3>&#x66F4;&#x9891;&#x7E41;&#x7684;&#x66F4;&#x65B0;</h3>

<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x9891;&#x7E41;&#x5730;&#x67E5;&#x770B;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x5730;&#x5F88;&#x597D;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x5C31;&#x67E5;&#x770B;&#x4E00;&#x6B21;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x4E0D;&#x662F;&#x6548;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x4E86;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x628A;&#x6574;&#x4E2A;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x90FD;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x63D0;&#x53D6;&#x6574;&#x4E2A;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x65E2;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x53C8;&#x6D6A;&#x8D39;&#x5E26;&#x5BBD;&#x3002;</p>

<p>&#x5E78;&#x597D;Feedzirra&#x63D0;&#x4F9B;&#x4E86;&#x83B7;&#x53D6;&#x8BA2;&#x9605;&#x70B9;&#x66F4;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x770B;&#x4E00;&#x770B;<a href="http://gist.github.com/57285">Feedzirra</a>&#x7684;&#x4F8B;&#x5B50;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x53EA;&#x63D0;&#x53D6;&#x8BA2;&#x9605;&#x70B9;&#x4E2D;&#x4E0A;&#x6B21;&#x63D0;&#x53D6;&#x4EE5;&#x540E;&#x7684;&#x66F4;&#x65B0;&#x90E8;&#x5206;&#x3002;</p>

<pre class="ruby">
# updating a single feed     
updated_feed = Feedzirra::Feed.update(feed)    
</pre>

<p>update&#x65B9;&#x6CD5;&#x4F7F;&#x7528;<a href="http://en.wikipedia.org/wiki/HTTP_ETag">ETags</a>&#x6765;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x8BA2;&#x9605;&#x70B9;&#x4ECE;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x4EE5;&#x540E;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x624D;&#x4F1A;&#x63D0;&#x53D6;&#x5E76;&#x89E3;&#x6790;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;<code>new_entries</code>&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x8FD4;&#x56DE;&#x65B0;&#x6761;&#x76EE;&#x7684;&#x96C6;&#x5408;&#x3002;</p>

<p>&#x5199;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x6CA1;&#x6CD5;&#x8BA9;&#x5B83;&#x8DD1;&#x8D77;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x9891;&#x7E41;&#x5730;&#x4ECE;&#x8BA2;&#x9605;&#x70B9;&#x4E0A;&#x63D0;&#x53D6;&#x66F4;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x548C;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x7684;<code>update_from_feed</code>&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x518D;&#x7ED9;<code>FeedEntry</code>&#x7C7B;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x8F6E;&#x8BE2;&#x8BA2;&#x9605;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x66F4;&#x65B0;&#x7684;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x4F1A;&#x4F7F;&#x7528;&#x628A;&#x6761;&#x76EE;&#x5199;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x90A3;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5148;&#x628A;&#x90A3;&#x4E9B;&#x4EE3;&#x7801;&#x62BD;&#x53D6;&#x5230;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x53BB;&#x3002;</p>

<p class="codeFilePath">/app/models/feed_entry.rb</p>
<pre class="ruby"> 
class FeedEntry &lt; ActiveRecord::Base     
  def self.update_from_feed(feed_url)     
    feed = Feedzirra::Feed.fetch_and_parse(feed_url)     
    add_entries(feed.entries)     
  end    

  private     
  def self.add_entries(entries)     
    entries.each do |entry|     
      unless exists? :guid =&gt; entry.id     
        create!(     
          :name         =&gt; entry.title,     
          :summary      =&gt; entry.summary,     
          :url          =&gt; entry.url,     
          :published_at =&gt; entry.published,     
          :guid         =&gt; entry.id     
        )     
      end    
    end    
  end    
end   
</pre> 

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5199;&#x8FD9;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x5B83;&#x8D77;&#x540D;&#x53EB;<code>update_from_feed_continuously</code>&#x3002;</p>

<p class="codeFilePath">/app/models/feed_entry.rb</p>
<pre class="ruby">
def self.update_from_feed_continuously(feed_url, delay_interval = 15.minutes)     
  feed = Feedzirra::Feed.fetch_and_parse(feed_url)     
  add_entries(feed.entries)     
  loop do    
    sleep delay_interval.to_i     
    feed = Feedzirra::Feed.update(feed)     
    add_entries(feed.new_entries) if feed.updated?     
  end      
end   
</pre>

<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x548C;<code>update_from_feed</code>&#x5F88;&#x50CF;&#xFF0C;&#x53EA;&#x662F;&#x591A;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x8F6E;&#x8BE2;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x9891;&#x7387;&#x3002;&#x5F00;&#x59CB;&#x5148;&#x63D0;&#x53D6;&#x6574;&#x4E2A;&#x8BA2;&#x9605;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x628A;&#x6761;&#x76EE;&#x90FD;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x4F11;&#x7720;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5C31;&#x67E5;&#x770B;&#x8BA2;&#x9605;&#x70B9;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5C31;&#x628A;&#x65B0;&#x7684;&#x6761;&#x76EE;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x3002;</p>

<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C31;&#x6709;&#x4E86;&#x4E24;&#x4E2A;&#x4ECE;RSS&#x8BA2;&#x9605;&#x70B9;&#x63D0;&#x53D6;&#x6761;&#x76EE;&#x7684;&#x65B9;&#x6CD5;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x9002;&#x7528;&#x4E8E;&#x8BA1;&#x5212;&#x4EFB;&#x52A1;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x7528;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x9002;&#x5408;&#x4E8E;&#x9700;&#x8981;&#x9891;&#x7E41;&#x67E5;&#x770B;&#x8BA2;&#x9605;&#x70B9;&#x66F4;&#x65B0;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>

<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4E2D;&#x7528;&#x6B7B;&#x5FAA;&#x73AF;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x770B;<a href="http://railscasts.com/episodes/129-custom-daemon">129&#x96C6;</a>&#xFF0C;&#x91CC;&#x9762;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x7528;&#x4E00;&#x4E2A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;gem&#x6765;&#x521B;&#x5EFA;&#x540E;&#x53F0;&#x8FDB;&#x7A0B;&#x3002;</p>