<p>&#x5728;&#x4E0A;&#x4E00;&#x96C6;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x89D2;&#x8272;&#x7684;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x6CE8;&#x518C;&#x9875;&#x9762;&#x4E0A;&#x6709;&#x51E0;&#x4E2A;&#x590D;&#x9009;&#x6846;(checkbox)&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x89D2;&#x8272;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/249/original/E189I01.png" width="808" height="510" alt="The signup page showing the roles checkboxes."/>
</div>

<p>&#x5728;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x578B;<code>Role</code>&#xFF0C;&#x5B83;&#x548C;&#x6A21;&#x578B;<code>User</code>&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5173;&#x8054;&#x8868;&#x8FDB;&#x884C;&#x4E86;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x8054;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x4E09;&#x6761;roles&#x7684;&#x6570;&#x636E;&#x3002;</p>

<pre class="terminal">
&gt;&gt; Role.all 
 +----+-----------+-------------------------+-------------------------+ 
 | id | name | created_at | updated_at | 
 +----+-----------+-------------------------+-------------------------+ 
 | 1 | Admin | 2009-11-16 21:22:59 UTC | 2009-11-16 21:22:59 UTC | 
 | 2 | Moderator | 2009-11-16 21:23:06 UTC | 2009-11-16 21:23:06 UTC | 
 | 3 | Author | 2009-11-16 21:23:16 UTC | 2009-11-16 21:23:16 UTC | 
 +----+-----------+-------------------------+-------------------------+ 
3 rows in set 
</pre>

<p>&#x73B0;&#x5728;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x6570;&#x636E;&#x548C;&#x6587;&#x4EF6;<code>authorization_rules</code>&#x4E2D;&#x4E3A;&#x89D2;&#x8272;&#x5B9A;&#x4E49;&#x7684;&#x6743;&#x9650;&#x4EE3;&#x7801;&#x4EA7;&#x751F;&#x4E86;&#x7D27;&#x5BC6;&#x8026;&#x5408;</p>

<pre class="ruby">
role :author do  
  includes :guest  
  has_permission_on :articles, :to =&gt; [:new, :create]  
  has_permission_on :articles, :to =&gt; [:edit, :update] do  
    if_attribute :user =&gt; is { user }  
  end  
end  
</pre>

<p>&#x5982;&#x679C;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x89D2;&#x8272;&#x548C;&#x6743;&#x9650;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x80FD;&#x5728;&#x4E0D;&#x4FEE;&#x6539;ruby&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53BB;&#x7ED9;&#x89D2;&#x8272;&#x8868;&#x505A;&#x4FEE;&#x6539;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x89D2;&#x8272;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x5C06;&#x6F14;&#x793A;&#x5982;&#x4F55;&#x53BB;&#x9664;&#x8026;&#x5408;&#xFF0C;&#x5C06;&#x89D2;&#x8272;&#x53EA;&#x5B9A;&#x4E49;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8131;&#x79BB;&#x5173;&#x7CFB;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x6A21;&#x578B;<code>Role</code>&#xFF0C;&#x5728;&#x6A21;&#x578B;<code>User</code>&#x4E2D;&#xFF0C;&#x4E5F;&#x5C06;&#x628A;&#x4E0B;&#x9762;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x5220;&#x6389;&#x3002;</p>

<pre class="ruby">
has_many :assignments  
has_many :roles, :through =&gt; :assignments 
</pre>

<p>&#x505A;&#x5B8C;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x89D2;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x89D2;&#x8272;&#x548C;&#x7528;&#x6237;&#x662F;&#x5173;&#x8054;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x6A21;&#x578B;<code>User</code>&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;ROLE&#x7684;&#x5E38;&#x91CF;</p>

<pre class="ruby">
class User &lt; ActiveRecord::Base  
  acts_as_authentic  
  has_many :articles  
  has_many :comments  
  
  ROLES = %w[admin moderator author]  
  
  def role_symbols  
    roles.map do |role|  
      role.name.underscore.to_sym  
    end  
  end  
end  
</pre>

<p>&#x73B0;&#x5728;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4FEE;&#x6539;&#x89D2;&#x8272;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F46;&#x95EE;&#x9898;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x5168;&#x90E8;&#x89E3;&#x51B3;&#xFF1A;&#x5982;&#x4F55;&#x5C06;&#x89D2;&#x8272;&#x548C;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x5173;&#x8054;&#xFF1F;&#x7531;&#x4E8E;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6CA1;&#x6709;&#x4E86;&#x89D2;&#x8272;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x5C06;&#x89D2;&#x8272;&#x548C;&#x6A21;&#x578B;<code>User</code>&#x8FDB;&#x884C;&#x5173;&#x8054;&#x3002;</p>

<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x6F14;&#x793A;&#x4E24;&#x79CD;&#x5173;&#x8054;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>

<h3>&#x5D4C;&#x5165;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x8054;</h3>

<p>&#x76EE;&#x524D;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x89D2;&#x8272;&#x548C;&#x7528;&#x6237;&#x662F;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x4FEE;&#x6539;&#x4E3A;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x53EA;&#x80FD;&#x662F;&#x89D2;&#x8272;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x89D2;&#x8272;&#x5C06;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x8868;<code>users</code>&#x5F53;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x7684;&#x89D2;&#x8272;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#x6765;&#x5B58;&#x50A8;&#x5B83;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x751F;&#x6210;&#x6570;&#x636E;&#x5E93;&#x8FC1;&#x79FB;&#x6587;&#x4EF6;</p>

<pre class="terminal">
script/generate migration add_role_to_users role:string 
</pre>

<p>&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E3A;&#x8868;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B57;&#x6BB5;</p>

<pre class="terminal">
rake db:migrate 
</pre>

<p>&#x4E0B;&#x4E00;&#x6B65;&#x662F;&#x5728;&#x6CE8;&#x518C;&#x9875;&#x9762;&#x7684;&#x8868;&#x5355;&#x4E2D;&#x4F7F;&#x7528;&#x4E0B;&#x62C9;&#x83DC;&#x5355;(select menu)&#x4EE3;&#x66FF;&#x5148;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x590D;&#x9009;&#x6846;(checkbox)&#xFF0C;&#x50CF;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x4E00;&#x6837;&#x4FEE;&#x6539;<code>/app/views/users/new.html.erb</code></p>

<p class="codeFilePath">/app/views/users/new.html.erb</p>
<pre class="ruby">
&lt;%= form.label :roles %&gt;  
&lt;% for role in Role.all %&gt;  
  &lt;%= check_box_tag &quot;user[role_ids][]&quot;, role.id, @user.roles.include?(role) %&gt;  
  &lt;%=h role.name %&gt;&lt;br /&gt;  
&lt;% end %&gt;  
</pre>

<p>&#x4FEE;&#x6539;&#x4E3A;</p>

<p class="codeFilePath">/app/views/users/new.html.erb</p>
<pre class="ruby">
&lt;%= form.label :role %&gt;  
&lt;%= form.collection_select :role, User::ROLES, :to_s, :humanize %&gt;
</pre>

<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>collection_select</code>&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x4E0B;&#x62C9;&#x83DC;&#x5355;(select menu)&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x505A;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5C06;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x662F;&#x4F20;&#x9012;&#x4E00;&#x4E32;&#x6A21;&#x578B;&#x5BF9;&#x8C61;&#x6570;&#x7EC4;&#x548C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x8BBE;&#x7F6E;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#x7684;&#x503C;(options&#x7684;value)&#x548C;&#x663E;&#x793A;&#x5B57;&#x7B26;(options&#x7684;innerText)&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4F20;&#x9012;&#x4E86;&#x5728;&#x6A21;&#x578B;User&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x89D2;&#x8272;&#x6570;&#x7EC4;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#x7684;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;&#x89D2;&#x8272;<code>.to_s</code>&#x65B9;&#x6CD5;&#x548C;&#x4E3A;&#x663E;&#x793A;&#x5B57;&#x7B26;&#x8BBE;&#x7F6E;&#x8C03;&#x7528;<a href="http://api.rubyonrails.org/classes/ActiveSupport/CoreExtensions/String/Inflections.html#M001370"><code>:humanize</code></a>&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x7EC8;&#x663E;&#x793A;&#x5982;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/250/original/E189I02.png" width="808" height="478" alt="The checkboxes have now been replaced by a select menu."/>
</div>

<p>&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x58F0;&#x660E;&#x7684;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x65B9;&#x6CD5;role_symbols&#x7A0D;&#x4F5C;&#x4FEE;&#x6539;&#xFF0C;&#x8BA9;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;symbol&#x7C7B;&#x578B;</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
def role_symbols  
  [role.to_sym]  
end  
</pre>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x89D2;&#x8272;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x8868;<code>Users</code>&#x7684;<code>role</code>&#x5B57;&#x6BB5;&#x4E2D;</p>

<pre class="terminal">
&gt;&gt; User.last.role  
=&gt; &quot;moderator&quot;  
</pre>

<h3>&#x591A;&#x5BF9;&#x591A;&#x5173;&#x8054;</h3>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E0D;&#x6062;&#x590D;&#x6A21;&#x578B;<code>Role</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x591A;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x529F;&#x80FD;&#x5462;&#xFF1F;&#x8FD9;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x591A;&#x4E2A;&#x503C;&#x5E8F;&#x5217;&#x5316;&#x5230;&#x8868;users&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4E2D;&#x53BB;</p>

<p>&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x6211;&#x4EEC;&#x4E3A;&#x8868;<code>users</code>&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;text&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;<code>roles</code>&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;Rails&#x7684;<code>serialize</code>&#x65B9;&#x6CD5;&#x5BF9;&#x8981;&#x5B58;&#x50A8;&#x7684;&#x7528;&#x6237;&#x89D2;&#x8272;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x6570;&#x636E;&#x8FDB;&#x5165;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x524D;&#x4F1A;&#x5BF9;&#x5B57;&#x6BB5;&#x8C03;&#x7528;<code>to_yaml</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x786E;&#x5B9E;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x5728;&#x9047;&#x5230;&#x6839;&#x636E;&#x6307;&#x5B9A;&#x89D2;&#x8272;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x884C;&#x4E0D;&#x901A;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x627E;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;</p>

<p>&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x53EB;&#x4F4D;&#x63A9;&#x7801;(bitmask)&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x5728;&#x4E00;&#x4E2A;integer&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#x4E2D;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x6839;&#x636E;&#x89D2;&#x8272;&#x67E5;&#x8BE2;&#x51FA;&#x6307;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x6765;&#x3002;</p>

<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x4E3A;&#x8868;users&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x5B57;&#x6BB5;--<code>roles_mask</code>&#xFF0C;integer&#x7C7B;&#x578B;</p>

<pre class="terminal">
script/generate migration add_roles_mask_to_users roles_mask:integer 
</pre>

<p>&#x6267;&#x884C;&#x8FC1;&#x79FB;&#x6587;&#x4EF6;</p>
<pre class="terminal">
rake db:migrate 
</pre>

<p>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4F4D;&#x63A9;&#x7801;(bitmask)&#x548C;&#x89D2;&#x8272;&#x6570;&#x7EC4;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x5728;&#x6A21;&#x578B;<code>User</code>&#x4E2D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;<code>roles_mask</code>&#x5199;&#x4E00;&#x4E2A;getter&#x65B9;&#x6CD5;&#x548C;&#x4E00;&#x4E2A;setter&#x65B9;&#x6CD5;</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
def roles=(roles)  
  self.roles_mask = (roles &amp; ROLES).map { |r| 2**ROLES.index(r) }.sum  
end  
  
def roles  
  ROLES.reject { |r| ((roles_mask || 0) &amp; 2**ROLES.index(r)).zero? }  
end  
</pre>

<p>&#x8FD9;&#x4E2A;setter&#x65B9;&#x6CD5;&#x628A;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#x4E3A;&#x4F4D;&#x63A9;&#x7801;(bitmask)&#x7136;&#x540E;&#x8D4B;&#x503C;&#x7ED9;<code>roles_mask</code>&#x3002;getter&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x904D;&#x5386;&#x8FD4;&#x56DE;&#x5728;&#x4F4D;&#x63A9;&#x7801;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x89D2;&#x8272;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x6211;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x9700;&#x8981;&#x5904;&#x7406;&#x5E76;&#x4E14;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x5199;&#x592A;&#x591A;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x6CA1;&#x6709;&#x5F15;&#x5165;&#x8FDB;&#x6765;&#x3002;</p>

<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;<code>role_symbols</code>&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x4FEE;&#x6539;&#x89D2;&#x8272;&#x3002;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5C06;&#x89D2;&#x8272;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#x4E3A;symbol&#x7C7B;&#x578B;&#x3002;</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
def role_symbols  
  roles.map(&amp;:to_sym)  
end
</pre>

<p>&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x4FEE;&#x6539;&#x89C6;&#x56FE;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x9700;&#x8981;&#x4F7F;&#x7528;checkbox&#x8FD9;&#x6837;&#x5728;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x4E2A;&#x89D2;&#x8272;</p>

<pre class="ruby">
&lt;%= form.label :roles %&gt;  
&lt;% for role in User::ROLES %&gt;  
  &lt;%= check_box_tag &quot;user[roles][]&quot;, role, @user.roles.include?(role) %&gt;  
  &lt;%= h role.humanize %&gt;  
&lt;% end %&gt;  
&lt;%= hidden_field_tag &quot;user[roles][]&quot;%&gt;
</pre>

<p>&#x8FD9;&#x91CC;&#x521B;&#x5EFA;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x4F7F;&#x7528;&#x7684;checkbox&#x548C;&#x7B2C;17&#x96C6;[<a href="http://railscasts.com/episodes/17-habtm-checkboxes">&#x89C6;&#x9891;</a>  <a href="http://asciicasts.com/episodes/17-habtm-checkboxes">&#x6587;&#x7AE0;</a>]&#x6709;&#x7C7B;&#x4F3C;&#x4E4B;&#x5904;&#x3002;<code>user[roles][]</code>&#x6700;&#x540E;&#x7684;&#x8FD9;&#x4E2A;&#x7A7A;&#x7684;&#x65B9;&#x62EC;&#x53F7;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF1A;&#x5F53;&#x6211;&#x4EEC;&#x5BF9;&#x8868;&#x5355;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x65F6;&#x7CFB;&#x7EDF;&#x4F1A;&#x628A;&#x9009;&#x4E2D;&#x7684;checkbox&#x5F53;&#x505A;&#x6570;&#x7EC4;&#x4F20;&#x9012;&#x7ED9;&#x6A21;&#x578B;<code>User</code>&#xFF0C;User&#x518D;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x3002;<code>check_box_tag</code>&#x65B9;&#x6CD5;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x5F53;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x662F;&#x67D0;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;checkbox&#x9ED8;&#x8BA4;&#x4F1A;&#x9009;&#x4E2D;&#x3002;&#x9690;&#x85CF;&#x8868;&#x5355;&#x786E;&#x4FDD;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x7ED9;&#x6539;&#x7528;&#x6237;&#x5206;&#x914D;&#x89D2;&#x8272;&#x7CFB;&#x7EDF;&#x4E5F;&#x4F1A;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x7A7A;&#x6570;&#x7EC4;&#x5230;&#x540E;&#x53F0;&#x3002;</p>

<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x6CE8;&#x518C;&#x9875;&#x9762;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x65B0;&#x7528;&#x6237;&#x5E76;&#x7ED9;&#x4ED6;&#x5206;&#x914D;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/251/original/E189I03.png" width="808" height="478" alt="Signing up a new user and assigning their roles."/>
</div>

<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x89D2;&#x8272;&#x4EE5;&#x53CA;&#x4E3A;&#x5B83;&#x5206;&#x914D;&#x7684;&#x4F4D;&#x63A9;&#x7801;(<code>roles_mask</code>)</p>

<pre class="terminal">
&gt;&gt; User.last.roles  
=&gt; [&quot;admin&quot;, &quot;author&quot;]  
&gt;&gt; User.last.roles_mask  
=&gt; 5  
</pre>

<p>&#x6BCF;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x503C;&#x90FD;&#x4F1A;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF08;Each role has a value twice that of the role next to it&#xFF09;&#xFF0C;&#x6700;&#x5C0F;&#x503C;&#x662F;1.&#x6240;&#x4EE5;5&#x662F;&#x901A;&#x8FC7;&#x516C;&#x5F0F;<code>(1*1) + (2*0) + (4*1)</code>&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;</p>

<p>&#x4E0B;&#x9762;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x627E;&#x51FA;&#x67D0;&#x79CD;&#x89D2;&#x8272;&#x7684;&#x6240;&#x6709;&#x7528;&#x6237;&#x5462;&#xFF1F;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x627E;&#x51FA;&#x6240;&#x6709;&#x89D2;&#x8272;&#x662F;moderator&#x7684;&#x7528;&#x6237;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;<code>User</code>&#x6DFB;&#x52A0;&#x5982;&#x4E0B;&#x4EE3;&#x7801;</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">
named_scope :with_role, lambda { |role| {:conditions =&gt; &quot;roles_mask &amp; #{2**ROLES.index(role.to_s)} &gt; 0 &quot;} } 
</pre>

<p>&#x8FD9;&#x4E2A;named scope&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6309;&#x4F4D;&#x64CD;&#x4F5C;&#x53BB;&#x68C0;&#x67E5;&#x67D0;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x662F;&#x5426;&#x5177;&#x6709;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x67E5;&#x627E;&#x6240;&#x6709;&#x89D2;&#x8272;&#x4E3A;admin&#x7684;&#x7528;&#x6237;&#x3002;</p>

<pre class="terminal">
&gt;&gt; User.with_role(&quot;admin&quot;) 
+----+----------+-------------+-------------+-------------+-------------+------------+
| id | username | email       | crypted_... | password... | persiste... | roles_mask |
+----+----------+-------------+-------------+-------------+-------------+------------+
| 6  | paul     | paul@tes... | cffada11... | FDGoNtM1... | 35a7d8c8... | 5          |
+----+----------+-------------+-------------+-------------+-------------+------------+
 1 row in set 
</pre>

<p>&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x4E86;&#x81EA;&#x4ECE;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x5B57;&#x6BB5;<code>roles_mask</code>&#x540E;&#x6DFB;&#x52A0;&#x7684;&#x5339;&#x914D;&#x7528;&#x6237;&#x3002;</p>

<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x518D;&#x6DFB;&#x52A0;&#x65B0;&#x89D2;&#x8272;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8981;&#x5C0F;&#x5FC3;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x7684;&#x4F4D;&#x63A9;&#x7801;(bitmask)&#x662F;&#x57FA;&#x4E8E;&#x89D2;&#x8272;&#x6570;&#x7EC4;<code>ROLES</code>&#x4F4D;&#x7F6E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x59CB;&#x6216;&#x4E2D;&#x95F4;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x90A3;&#x4E48;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x89D2;&#x8272;&#x4E5F;&#x5C06;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;</p>

<pre class="ruby">
ROLES = %w[admin moderator author editor]  
</pre>

<p>&#x8FD9;&#x4E00;&#x96C6;&#x5230;&#x6B64;&#x7ED3;&#x675F;&#x3002;&#x4F4D;&#x63A9;&#x7801;(bitmasking)&#x5728;&#x5E94;&#x7528;&#x4E8E;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x65F6;&#x975E;&#x5E38;&#x597D;&#x7528;&#xFF0C;&#x5B83;&#x4EC5;&#x9700;&#x8981;&#x4E00;&#x4E2A;integer&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x53EA;&#x6709;&#x5728;&#x8BB0;&#x5F55;&#x4E0D;&#x5C5E;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x65F6;&#x5019;&#x624D;&#x6709;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x89D2;&#x8272;&#x5217;&#x8868;&#x662F;&#x7ED1;&#x5B9A;&#x5230;&#x4EE3;&#x7801;&#x5F53;&#x4E2D;&#x7684;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x4FEE;&#x6539;&#x89D2;&#x8272;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x628A;&#x89D2;&#x8272;&#x5217;&#x8868;&#x5B9A;&#x4E49;&#x5230;&#x522B;&#x5904;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6DFB;&#x52A0;&#x6216;&#x4FEE;&#x6539;&#x89D2;&#x8272;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x5B58;&#x50A8;&#x5230;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x4E3B;&#x610F;&#x3002;</p>