<p>Gibt es bessere Wege die 200. Episode zu feiern als einen ersten Eindruck von Rails 3 zu vermitteln? Die erste Betaversion von Rails 3.0 ist gerade ver&ouml;ffentlicht worden und in dieser Episode zeigen wir die Installation und Konfiguration. In den n&auml;chsten Episoden werden wir einen detaillierten Blick auf neue Funktionen werfen. Auch wenn gar keine Upgrades der Applikationen in naher Zukunft geplant sind, mit den neuen Funktionen herumzuprobieren ist die Installation der Betaversion wert.</p>

<h3>Ruby aktualisieren</h3>

<p>Rails 3 braucht Ruby 1.8.7 oder neuer, als ersten Schritt schaue nach welche Version du gerade verwendest indem du <code>ruby -v</code> in einem Terminalfenster eingibst.</p>

<pre class="terminal">
$ ruby -v
ruby 1.8.6 (2008-08-11 patchlevel 287) [universal-darwin9.0]
</pre>

<p>Dieser Computer verwendet Ruby 1.8.6, wir m&uuml;ssen auf eine neuere Version aktualisieren bevor wir weiter machen k&ouml;nnen. Wir werden rvm verwenden, den <a href="http://rvm.beginrescueend.com">Ruby Version Manager</a>. Mit rvm k&ouml;nnen wir auf einfache Weise verschiedene Versionen von Ruby verwenden und mit einem einzelnenen Kommando zwischen ihnen hin- und herschalten.</p> 

<p>Solltest du Windows benutzen, dann musst du ruby manuell installieren, rvm ist dort nicht verf&uuml;gbar. Unter Linux, OS X und anderen
UNIX-basierenden Systemen k&ouml;nnen wir rvm mit den Anweisungen auf der rvm <a href="http://rvm.beginrescueend.com/install/">Installationsseite</a> (engl) einrichten und dann folgendes Kommando absetzen:</p>

<pre class="terminal">
mkdir -p ~/.rvm/src/ &amp;&amp; cd ~/.rvm/src &amp;&amp; rm -rf ./rvm/ &amp;&amp; git clone git://github.com/wayneeseguin/rvm.git &amp;&amp; cd rvm &amp;&amp; ./install
</pre>

<p>Nachdem die Kommandos ausgef&uuml;hrt wurden, werden Instruktionen angezeigt wie man die Installation abschliesst. Je nachdem, ob du bash oder zsh verwendest, gibt es verschiedene Hinweise. Nachdem wir die Instruktionen befolgt haben, m&uuml;ssen wir unser Terminalfenster schliessen und neu aufmachen, damit die &Auml;nderungen aktiv werden. Jetzt k&ouml;nnen wir <code>rvm</code> ausf&uuml;hren und die Ruby Version installieren, die wir wollen.</p> 
<p>Rails 3.0 ben&ouml;tigt Ruby 1.8.7, l&auml;uft aber auch mit Ruby 1.9.1. Wir sind abenteuerlustig und werden 1.9.1 installieren. Dazu geben wir folgendes ein:</p>
<pre class="terminal">
$ rvm install 1.9.1
</pre>
<p>Dieser Befehl l&auml;dt die Version aus dem Netz, konfiguriert und installiert Ruby 1.9.1. Dieser Prozess dauert einige Zeit. Nach Abschluss k&ouml;nnen wir mit <code>rvm list</code> feststellen, welche Ruby Versionen wir installiert haben.</p>

<pre class="terminal">
noonoo:~ eifion$ rvm list
   ruby-1.9.1-p378 [ x86_64 ]
   system [ x86_64 i386 ppc ]
</pre>
<p>Wir haben Ruby 1.9.1 installiert und k&ouml;nnen mit folgendem Befehl darauf umschalten.</p>
<pre class="terminal">
$ rvm 1.9.1
$ ruby -v
ruby 1.9.1p378 (2010-01-10 revision 26273) [i386-darwin10.2.0]
</pre>
<p>Die neue Ruby Version bleibt nur solange aktiv bis das Terminalfenster geschlossen wird. Um die neu installierte Version dauerhaft aktiv zu machen k&ouml;nnen wir den Parameter <code>--default</code> zu <code>rvm</code> dazuschreiben.</p>
<pre class="terminal">
$ rvm 1.9.1 --default
$ ruby -v
ruby 1.9.1p378 (2010-01-10 revision 26273) [i386-darwin10.2.0]
</pre>
<p>Jetzt k&ouml;nnen wir beliebig viele Terminalfenster auf- und wieder zumachen, Ruby 1.9.1 bleibt aktiv.</p>

<p>Falls wir irgendwann wieder zu der Ruby Version des Systems retour wollen, dann k&ouml;nnen wir <code>rvm system</code> absetzen, mit dem Parameter <code>--default</code> wird auch diese &Auml;nderung dauerhaft aktiviert.</p>

<h3>Installation von Rails Beta</h3>

<p>Jetzt haben wir eine Ruby Version mit der wir Rails 3 Beta verwenden k&ouml;nnen. Wir setzen die folgenden 2 Zeilen ab um Rails zu installieren.</p>
<pre class="terminal">
gem install tzinfo builder memcache-client rack rack-test rack-mount erubis mail text-format thor bundler i18n
gem install rails --pre
</pre>
<p>Weil wir eine noch nicht ver&ouml;ffentlichte Version von Rails verwenden wollen m&uuml;ssen wir die Abh&ouml;ngigkeiten selbst installieren, die erste Zeile erledigt das. Bitte beachte dass wir kein <code>sudo</code> vor den Befehl <code>gem</code> setzen. Der Grund daf&uuml;r ist die Verwendung von rvm. Die Seite <a href="http://rvm.beginrescueend.com/gems/">rvm gems page</a> gibt dazu weitere Informationen.</p>
<p>Nachdem beide Kommandos ausgef&uuml;hrt wurden haben wir Rails 3.0 installiert und k&ouml;nnen beginnen es auszuprobieren.</p>

<h3>Rails 3.0 benutzen</h3>
<p>Zuerst &uuml;berpr&uuml;fen wir ob Rails 3 wirklich installiert wurde mit <code>rails -v</code>.</p>
<pre class="terminal">
$ rails -v
Rails 3.0.0.beta
</pre>
<p>Wenn du eine Fehlermeldung siehst dann schlie&szlig;e dein Terminalfenster und mache es neu auf und probiere es erneut. Wir werden nun eine einfache Applikation bauen die Spielst&auml;nde abspeichert, wir nennen sie <code>topscore</code>. Wir erstellen eine Rails 3.0 Applikation auf die gleiche Weise wie bisher:</p>
<pre class="terminal">
rails topscore
</pre>
<p>Aber wenn wir in das Applikationsverzeichnis wechseln und versuchen den Server zu starten bemerken wir den ersten Unterschied.</p>
<pre class="terminal">&cedil;
$ script/server
-bash: script/server: No such file or directory
</pre>
<p>In dem Verzeichnis <code>script</code> gibt es keine der bisher benutzten Skripte mehr, wie starten wir den Server? Wir benutzen <code>rails</code> mit dem folgenden Parameter:</p>
<pre class="terminal">
rails server
</pre>
<p>Die nach dem Ausf&uuml;hren des Kommandos angezeigten Fehlermeldungen nehmen wir in Kauf, wir arbeiten mit einer Beta-Release. In den Fehlermeldungen kann man ein fehlendes gem <code>sqlite3-ruby</code> erkennen. Hier bitte beachten dass jede Ruby Version eigene Pakete von RubyGems verwendet. Deshalb m&uuml;ssen wir das <code>sqlite3-ruby</code> gem selbst installieren, auch hier wieder ohne <code>sudo</code>.</p> 

<pre class="terminal">
gem install sqlite3-ruby
</pre>

<p>Nach einem Start des Servers mit <code>rails server</code> sehen wir eine Menge an Ausgaben und Warnings, aber der Server startet. Auf der Seite <a href="http://localhost:3000/">http://localhost:3000</a> sehen wir die Rails Default Seite.</p>

<div class="imageWrapper">
  <img src="/system/photos/326/original/E200I01.png" width="785" height="515" alt="The welcome page for our first Rails 3.0 application."/>
</div>

<p>Jetzt k&ouml;nnen wir anfangen unsere Applikation zu entwickeln. Wir starten mit einem Scaffold f&uuml;r ein Spiel-Model <code>game</code> mit einem Attribut <code>name</code> vom Typ <code>string</code>.</p>

<pre class="terminal">
rails generate scaffold game name:string
</pre>

<p>Wir lassen uns von den vielen Meldungen nicht abhalten und werden als n&auml;chstes die Datenbank migrieren.</p>

<pre class="terminal">
rake db:migrate
</pre>

<p>Mit einem Browser auf die Applikationssseite zugegriffen, sehen wir die &uuml;blichen per Scaffold generierten Seiten, die du eventuell aus anderen Applikationen kennst.</p>

<div class="imageWrapper">
  <img src="/system/photos/327/original/E200I02.png" width="799" height="283" alt="The scaffold-generated new game page."/>
</div>
<p>Das war es mit unserer Applikation f&uuml;r heute, in sp&auml;teren Episoden werden wir auf neue Funktionen von Rails 3 detaillierter eingehen, in der Zwischenzeit kannst du hier <a href="http://guides.rails.info/3_0_release_notes.html">Rails 3.0 Release Notes</a> einen &Uuml;berblick &uuml;ber die &Auml;nderungen bekommen. Es gibt auch eine grosse Sammlung von Links &uuml;ber Rails 3 bei <a href="http://www.rubyinside.com/rails-3-0-beta-links-2966.html">Ruby Inside</a>.</p>

<p>Beim Arbeiten mit Beta-Software kann es vorkommen, dass Dinge nicht funktionieren und man Fehler und Probleme entdeckt. Falls dir das passiert, und du wei&szlig;t, dass es nichts mit deinem einen Programmcode zu tun hat, dann &uuml;berpr&uuml;fe als allererstes die verwendeten Gems oder Plugins, die deine Applikation verwendet. Die Chancen sind hoch, dass dort das Problem liegt weil das Gem/Plugin (noch) nicht mit Rails 3 oder Ruby 1.9 zusammenarbeitet. Falls du ein Problem einem bestimmten Gem/Plugin zuordnen kannst, dann erstelle bitte ein Ticket auf der Gem Projektseite, damit der Fehler behoben werden kann.</p>

<p>Falls das Problem bei Rails selbst liegt kannst du beim <a href="https://rails.lighthouseapp.com/projects/8994-ruby-on-rails/tickets?q=all">Rails Lighthouse</a> ein Ticket erstellen. Falls du einen Fehler meldest, beachte bitte die folgenden Tipps: Such in bestehenden Tickets, ob das Problem nicht bereits existent ist. Erstelle eine Anleitung zum reproduzieren des Fehlers, f&uuml;ge deine Fehlermeldungen und einen stack trace hinzu. Bitte notiere auch die Version von Ruby on Rails, die du zusammen mit den eingebundenen Gems verwendest, damit es leichter wird, das Problem nachzuvollziehen. Gut beschriebene Fehler in Tickets erleichtern die Behebung des Problems.</p>

<h3>Gib etwas an Freie Software zur&uuml;ck</h3>
<p>Wie du vielleicht schon bemerkt hast ist dies die 200. Episode. Um den 200. Screencast hervorzuheben startet Ryan Bates eine Kampagne namens <a href="http://railscasts.com/give_back">&ldquo;Give Back To Open Source&rdquo;</a>. Open Source Software entsteht durch viel Arbeit und ist frei erh&auml;ltlich, somit macht es Sinn f&uuml;r jedermann, sich daran zu beteiligen und etwas zur&uuml;ck zu geben. Ryan&rsquo;s Herausforderung an Dich ist es, Deine gr&ouml;sste Rails Applikation zu  &ouml;ffnen und die verschiedenen Plug-ins und Gems zu getrachten, die es benutzt. Viele Gems Projektseiten akzeptieren Spenden, und jeder auch noch so kleine Beitrag wird sehr gesch&auml;tzt, da er dabei hilft, die Entwicklung des Gems am Laufen zu halten.</p>

<p>Eine andere M&ouml;glichkeit ist es, sich die Liste der Probleme f&uuml;r das Projekt anzusehen, sich damit zu besch&auml;ftigen, einen Bug zu beheben oder bei der Dokumentation zu helfen. Es liegt an Dir, Dich f&uuml;r eine M&ouml;glichkeit zu entscheiden, um beizutragen, aber es ist sehr erw&uuml;nscht, da es der Rails Community hilft, voranzukommen.</p>