<p>&iquest;Qu&eacute; mejor manera de celebrar el episodio 200 que con una introducci&oacute;n a Rails 3?  La primera versi&oacute;n beta de Rails 3.0 acaba de ser liberada y en este episodio veremos c&oacute;mo instalarlo. A lo largo de los pr&oacute;ximos episodios cubriremos con m&aacute;s detalle algunas de sus nuevas funcionalidades. Merece la pena instalar esta beta para ir haci&eacute;ndonos una idea de los
cambios aunque no pensemos de momento actualizar nuestras aplicaciones e ir jugando con las nuevas funcionalidades.</p>

<h3>Actualizaci&oacute;n de Ruby</h3>
<p>Rails 3 necesita Ruby 1.8.7 (o posterior) para funcionar, por tanto lo primero que tenemos que hacer es averiguar qu&eacute; version tenemos ejecutando <code>ruby -v</code> en una ventana de terminal.</p>

<pre class="terminal">$ ruby -v
ruby 1.8.6 (2008-08-11 patchlevel 287) [universal-darwin9.0]
</pre>

<p>En esta m&aacute;quina tenemos Ruby 1.8.6, as&iacute; que tendremos que actualizar Ruby antes de seguir.  Podr&iacute;amos hacerlo manualmente pero en su lugar vamos a utilizar rvm (<a href="http://rvm.beginrescueend.com/">Ruby Version Manager</a>), que nos va a permitir instalar f&aacute;cilmente diferentes versiones de Ruby y conmutar entre ellas con un &uacute;nico comando.</p>

<p>En Windows rvm no est&aacute; disponible por lo que tendremos que instalar Ruby manualmente.  En Linux, OS X o cualquier otro sistema operativo basado en UNIX podemos instalar rvm siguiendo las instrucciones de la <a href="http://rvm.beginrescueend.com/install/">p&aacute;gina de instalaci&oacute;n</a> y ejecutando el siguiente comando:</p>

<pre class="terminal">
mkdir -p ~/.rvm/src/ &amp;&amp; cd ~/.rvm/src &amp;&amp; rm -rf ./rvm/ &amp;&amp; git clone git://github.com/wayneeseguin/rvm.git &amp;&amp; cd rvm &amp;&amp; ./install
</pre>

<p>Despu&eacute;s que este comando haya terminado su ejecuci&oacute;n se nos mostrar&aacute;n las instrucciones necesarias para finalizar la instalaci&oacute;n, que ser&aacute;n diferentes seg&uacute;n estemos usando bash o zsh.  Tras efectuar los cambios pertinentes que nos hayan sugerido tendremos que cerrar y volver a abrir el terminal. Despu&eacute;s ya podremos ejecutar el comando <code>rvm</code> para instalar instalar cualquier versi&oacute;n de Ruby que deseemos.</p>

<p>Rails 3.0 necesita Ruby 1.8.7 pero tambi&eacute;n funciona como la versi&oacute;n 1.9.1 y como hoy nos sentimos aventureros instalaremos esa
versi&oacute;n. Para ello, ejecutamos:</p>

<pre class="terminal">
$ rvm install 1.9.1
</pre>

<p>Este comando descagar&aacute;, configurar&aacute; e instalar&aacute; Ruby 1.9.1, lo que le llevar&aacute; unos cuantos minutos y nos calentar&aacute; el regazo si estamos en nuestro port&aacute;til.  Cuando termine podremos ejecutar <code>rvm list</code> para ver qu&eacute; versiones de Ruby tenemos instaladas.</p>

<pre class="terminal">
noonoo:~ eifion$ rvm list
 ruby-1.9.1-p378 [ x86_64 ]
 system [ x86_64 i386 ppc ]
</pre>

<p>Dado que ahora tenemos Ruby 1.9.1 como versi&oacute;n instalada podemos cambiar a ella haciendo que sea la versi&oacute;n activa.</p>

<pre class="terminal">$ rvm 1.9.1
$ ruby -v
ruby 1.9.1p378 (2010-01-10 revision 26273) [i386-darwin10.2.0]
</pre>

<p>Esta nueva versi&oacute;n de Ruby s&oacute;lo estar&aacute; activa durante el tiempo que tengamos abierta esta sesi&oacute;n de terminal, si la cerramos y volvemos a abrir estaremos otra vez con la versi&oacute;n de Ruby por defecto. Para que la nueva versi&oacute;n permanezca entre sesiones podemos pasar el par&aacute;metro <code>--default</code> a <code>rvm</code>.</p>

<pre class="terminal">
$ rvm 1.9.1 --default
$ ruby -v
ruby 1.9.1p378 (2010-01-10 revision 26273) [i386-darwin10.2.0]
</pre>

<p>Ahora podemos abrir tantas terminales como queramos y la 1.9.1 ser&aacute; siempre la versi&oacute;n por defecto.</p>

<p>Si en cualquier momento queremos volver a la versi&oacute;n del sistema por defecto podemos ejecutar <code>rvm system</code>, pas&aacute;ndole
<code>--default</code> si queremos que la vuelta a la versi&oacute;n por defecto de Ruby sea permanente.</p>

<h3>Instalaci&oacute;n de la versi&oacute;n Beta de Rails</h3>

<p>Una vez que tenemos una versi&oacute;n soportada de Ruby podemos pasar a instalar la beta de Rails 3.  Para ello tenemos que ejecutar estas dos l&iacute;neas en la consola.</p>

<pre class="terminal">
gem install tzinfo builder memcache-client rack rack-test rack-mount erubis mail text-format thor bundler i18n
gem install rails --pre
</pre>

<p>Tendremos que instalar por separado todos los prerequistos (eso es lo que hace la primera l&iacute;nea) porque estamos instalando una versi&oacute;n de pre-lanzamiento de Rails.  Obs&eacute;rvese que no estamos usando <code>sudo</code> con el comando <code>gem</code> porque con rvm no nos interesa. <a href="http://rvm.beginrescueend.com/gems/">La p&aacute;gina sobre gemas</a> en el sitio de rvm detalla m&aacute;s informaci&oacute;n al respecto.</p>

<p>Una vez que hayan terminado ambos comandos tendremos Rails 3.0 instalado y podemos empezar a hacer nuestras pruebas.</p>

<h3>Uso de Rails 3.0</h3>
<p>Primero tenemos que asegurarnos de que Rails 3 est&aacute; instalado correctamente ejecutando el comando <code>rails  -v</code>.</p>

<pre class="terminal">
$ rails -v
Rails 3.0.0.beta
</pre>

<p>Si vemos un error al ejecutar el comando anterior deber&iacute;amos cerrar y abrir nuestra ventana de terminal y probar el comando otra
vez.  Tras asegurarnos de que estamos utilizando Rails 3.0 podemos crear nuestra primera aplicaci&oacute;n.  Ser&aacute; una aplicaci&oacute;n muy sencilla que guardar&aacute; r&eacute;cords de puntuaciones en juegos, la bautizaremos <code>topscore</code>. En Rails 3 las aplicaciones se crean como de costumbre:</p>

<pre class="terminal">
rails topscore
</pre>

<p>Pero cuando nos cambiemos al directorio de la aplicaci&oacute;n e intentemos ejecutar el servidor ya notaremos la primera diferencia.</p>

<pre class="terminal">
$ script/server
-bash: script/server: No such file or directory
</pre>

<p>Ya no existe ninguno de los comandos del directorio <code>script</code> as&iacute; que, &iquest;c&oacute;mo arrancamos el servidor?  La respuesta es que accedemos a ellos a trav&eacute;s del comando <code>rails</code> de la siguiente manera:</p>

<pre class="terminal">
rails server
</pre>

<p>No obstante cuando ejecutemos esto nos encontraremos con un aparatoso mensaje de error (es este el tipo de piedrecitas en el camino que caben esperar con una versi&oacute;n beta)  Si miramos el mensaje de error veremos que hay uno que hace menci&oacute;n a que falta la gema <code>sqlite3-ruby</code>. Este error parece equ&iacute;vico, dado que ya tenemos esta gema instalada en nuestra m&aacute;quina, pero hay que tener en cuenta que cada versi&oacute;n de Ruby que instalemos a trav&eacute;s de rvm tiene su propio juego de gemas, as&iacute; que cualquier gema adicional tendr&aacute; que ser instalada nuevamente.  Por tanto tendremos que reinstalar la gema<code>sqlite3-ruby</code> para Ruby 1.9.1, nuevamente teniendo cuidadode no poner delante <code>sudo</code>.</p>

<pre class="terminal">
gem install sqlite3-ruby
</pre>

<p>Esta vez cuando ejecutemos <code>rails server</code> veremos una gran cantidad de texto y algunas advertencias, pero el servidor arrancar&aacute;. Si visitamos <a href="http://localhost:3000/">http://localhost:3000</a> con un navegador veremos la p&aacute;gina por defecto de Rails.</p>


<div class="imageWrapper">
<img src="/system/photos/326/original/E200I01.png" alt="La p&aacute;gina de bienvenida de nuestra apliaci&oacute;n Rails 3.0" height="515" width="785" />
</div>

<p>Ya podemos empezar a construir nuestra aplicaci&oacute;n. Comenzaremos generando el andamiaje de un modelo <code>Game</code> que tendr&aacute; un atributo llamado <code>name</code>  de tipo cadena.</p>

<pre class="terminal">
rails generate scaffold game name:string
</pre>

<p>Nuevamente veremos un mont&oacute;n de informaci&oacute;n cuando lo ejecutemos, pero el comando funcionar&aacute;.  A continuaci&oacute;n migraremos la base de datos.</p>

<pre class="terminal">
rake db:migrate
</pre>

<p>Si luego visitamos la p&aacute;gina de juegos veremos las familiares vistas autom&aacute;ticamente generadas por el generador de <em>scaffold</em> que tantas veces hemos visto.</p>

<div class="imageWrapper">
<img src="/system/photos/327/original/E200I02.png" alt="La p&aacute;gina de nuevo juego generada autom&aacute;ticamente." height="283" width="799" />
</div>

<p>No iremos m&aacute;s lejos con esta aplicaci&oacute;n: en pr&oacute;ximos episodios cubriremos las nuevas funcionalidades de Rails 3 pero mientras tanto merece la pena leer las <a href="http://guides.rails.info/3_0_release_notes.html">Notas de lanzamiento de Rails 3.0</a> para tener una visi&oacute;n general de lo que ha cambiado. Tambi&eacute;n hay una exhaustiva colecci&oacute;n de enlaces sobre Rails 3 en <a  href="http://www.rubyinside.com/rails-3-0-beta-links-2966.html">Ruby Inside</a>.</p>


<p>Existe la posibilidad, dado que trabajaremos con <em>software</em> beta, que las cosas no funcionen correctamente y nos topemos con <em>bugs</em> u otros problemas.  En tal caso si nos encontramos con un error que sabemos que no est&aacute; relacionado con nuestro c&oacute;digo lo primero que debemos hacer es comprobar qu&eacute; gemas o plugins est&aacute; usando nuestra aplicaci&oacute;n.  Existe
la posibilidad de que ah&iacute; est&eacute; el origen del problema porque a&uacute;n no hayan sido actualizadas para funcionar con Rails 3 o Ruby 1.9  Si rastreamos el origen del problema hasta una gema o <em>plugin</em> espec&iacute;fico deber&iacute;amos a&ntilde;adir una petici&oacute;n de soporte en la p&aacute;gina del proyecto correspondiente de forma que quede constancia para su resoluci&oacute;n.</p>

<p>Si sabemos que el problema se encuentra en Rails podemos enviar un informe de error en <a href="https://rails.lighthouseapp.com/projects/8994-ruby-on-rails/tickets?q=all">Rails Lighthouse</a>.  Si decidimos enviar dicho informe conviene teneren cuenta los siguientes consejos.  En primer lugar deber&iacute;amos buscar en los informes existentes para asegurarnos de que no estamos duplicando peticiones de soporte.  Cuando escribamos nuestro informe de error debemos incluir instrucciones sobre c&oacute;mo reproducir el error as&iacute; como todos los mensajes de error con su volcado de pila.  Finalmente, se debe incluir la versi&oacute;n exacta de Ruby on Rails que estemos usando as&iacute; como los <em>plugins</em> y gemas que estemos usando de forma que sea f&aacute;cil reproducir el problema.  Si enviamos informes de calidad los errores descritos ser&aacute;n m&aacute;s f&aacute;ciles de resolver.</p>

<h3>Devolver al c&oacute;digo abierto</h3>

<p>Como ya sabr&aacute;n este es el episodio 200 y para celebrar el Railscast bicentenario Ryan Bates ha lanzado una campa&ntilde;a llamada 
<a href="http://railscasts.com/give_back">&ldquo;Devuelve al C&oacute;digo Abierto&rdquo;</a>. Se dedica mucho esfuerzo en <em>software open source</em> que posteriormente se pone a disposic&oacute;n de cualquiera que lo quiera usar, por lo que tiene sentido devolver algo cuando nos sea posible.  El reto de Ryan es abrir la aplicaci&oacute;n Rails m&aacute;s grande que tengamos y examinar los diversos <em>plugins</em> y gemas que usemos.  Si vemos la p&aacute;gina de estos proyectos veremos que muchos de ellos aceptan donaciones, agradeci&eacute;ndose incluso peque&ntilde;as contribuciones para que dicho proyecto contin&uacute;e su desarrollo.</p>

<p>Alternativamente, podemos echar un vistazo a la lista de problemas del proyecto y ayudar a corregirlo o echar una mano con la documentaci&oacute;n. A nosotros nos corresponde decidir c&oacute;mo queremos contribuir, pero lo importante es que hagamos algo porque esto es lo que da pujanza a la comunidad Rails.</p>