<p>&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x95EE;&#x5230;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x5728;Rails&#x7A0B;&#x5E8F;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x540E;&#x7AEF;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x5355;&#x3002;&#x672C;&#x96C6;&#x5F53;&#x4E2D;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x544A;&#x8BC9;&#x4F60;&#x5982;&#x4F55;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6CBF;&#x7528;&#x524D;&#x51E0;&#x96C6;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/271/original/E193I01.png" width="815" height="400" alt="Our blog application."/>
</div>
 
<p>&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x7ED9;&#x6BCF;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x540E;&#x9762;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&ldquo;&#x5206;&#x4EAB;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&rdquo;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x4F1A;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x586B;&#x5165;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6765;&#x5206;&#x4EAB;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x60F3;&#x7528;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x53D1;&#x9001;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5728;&#x6CA1;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#x548C;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5462;&#xFF1F;</p>

<p>&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6709;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x628A;&#x6570;&#x636E;&#x5E93;&#x8868;&#x53BB;&#x6389;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x7528;Ryan Bates&#x7684;<a href="http://github.com/ryanb/nifty-generators">nifty scaffold</a> generator&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x3002;</p>

<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x63D0;&#x4EA4;&#x4E00;&#x4E2A;&#x8868;&#x5355;&#x3001;&#x5E76;&#x4E14;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5148;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x8981;&#x628A;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x7EC6;&#x8282;&#x901A;&#x8FC7;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x63A8;&#x8350;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x53EB;Recommendation&#x3002;Recommendation&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5305;&#x62EC;&#x7684;&#x5B57;&#x6BB5;&#x6709;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684;&#x53D1;&#x9001;&#x8005;&#x3001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684;&#x63A5;&#x6536;&#x8005;&#x3001;&#x8981;&#x63A8;&#x8350;&#x7684;&#x6587;&#x7AE0;&#x7684;id&#x53F7;&#xFF0C;&#x4EE5;&#x53CA;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x5185;&#x5BB9;&#x3002;&#x76F8;&#x5E94;&#x7684;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x9700;&#x8981;&#x6709;new&#x548C;create&#x4E24;&#x4E2A;&#x52A8;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</p>

<pre class="terminal">
script/generate nifty_scaffold recommendation from_email:string to_email:string article_id:integer message:text new create  
</pre>

<p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x6570;&#x636E;&#x5E93;&#x8868;&#xFF0C;&#x4F46;&#x662F;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x8981;&#x6267;&#x884C;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#x6765;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x8868;&#xFF08;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x56DE;&#x6EDA;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#xFF09;</p>

<pre class="terminal">
rake db:migrate  
</pre> 

<p>&#x6709;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#xFF0C;&#x4F7F;&#x5176;&#x8C03;&#x7528;<code>RecommendationController</code>&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684;<code>new</code>&#x52A8;&#x4F5C;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x63A8;&#x8350;&#x7684;&#x6587;&#x7AE0;&#x7684;id&#x3002;</p>

<pre class="terminal">
&lt;p&gt;  
  &lt;%= link_to &quot;Share this article&quot;, new_recommendation_path(:article_id =&gt; @article.id) %&gt;  
  &lt;%= link_to &quot;Back to Articles&quot;, articles_path %&gt;  
&lt;/p&gt;
</pre>
<p class="title">&#x5728;/app/views/articles/show.html.erb&#x4E2D;&#x52A0;&#x5165;&#x63A8;&#x8350;&#x94FE;&#x63A5;</p>

<p>&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x7ED9;&#x65B0;&#x521B;&#x5EFA;&#x7684;Recommendation&#x6570;&#x636E;&#x6A21;&#x578B;&#x4F20;&#x5165;&#x6587;&#x7AE0;&#x7684;id&#xFF0C;&#x4F7F;&#x5176;&#x80FD;&#x591F;&#x4E00;&#x76F4;&#x88AB;&#x5F15;&#x7528;&#x3002;</p>

<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x65B0;&#x5EFA;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x5220;&#x6389;&#x5176;&#x4E2D;&#x7684;<code>article_id</code>&#x4EE5;&#x53CA;&#x6807;&#x7B7E;&#x5B57;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5B57;&#x6BB5;&#x6765;&#x4FDD;&#x5B58;<code>article_id</code>&#x3002;</p>

<pre class="ruby">
&lt;% title &quot;New Recommendation&quot; %&gt;     
&lt;% form_for @recommendation do |f| %&gt;     
  &lt;%= f.error_messages %&gt;     
  &lt;%= f.hidden_field :article_id %&gt;     
  &lt;p&gt;     
    &lt;%= f.label :from_email %&gt;&lt;br /&gt;     
    &lt;%= f.text_field :from_email %&gt;     
  &lt;/p&gt;     
  &lt;p&gt;     
    &lt;%= f.label :to_email %&gt;&lt;br /&gt;     
    &lt;%= f.text_field :to_email %&gt;     
  &lt;/p&gt;     
  &lt;p&gt;     
    &lt;%= f.label :message %&gt;&lt;br /&gt;     
    &lt;%= f.text_area :message %&gt;     
  &lt;/p&gt;     
  &lt;p&gt;&lt;%= f.submit &quot;Submit&quot; %&gt;&lt;/p&gt;     
&lt;% end %&gt;     
&lt;p&gt;&lt;%= link_to &quot;Back to List&quot;, recommendations_path %&gt;&lt;/p&gt;
</pre>
<p class="title">&#x4FEE;&#x6539;/app/views/recommendations/new.html.erb</p>

<p>&#x73B0;&#x5728;&#x5237;&#x65B0;&#x6587;&#x7AE0;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&ldquo;&#x5206;&#x4EAB;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&rdquo;&#x7684;&#x94FE;&#x63A5;&#x4E86;&#xFF0C;&#x70B9;&#x51FB;&#x94FE;&#x63A5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x65B0;&#x5EFA;&#x8868;&#x5355;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/272/original/E193I02.png" width="800" height="478" alt="The new recommendation form."/>
</div>

<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x586B;&#x5199;&#x8FD9;&#x4E2A;&#x8868;&#x5355;&#x5E76;&#x4E14;&#x63D0;&#x4EA4;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x521B;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Recommendation&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x53D1;&#x9001;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x8868;&#x5355;&#x5B58;&#x5165;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;Rails&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;<code>create</code>&#x52A8;&#x4F5C;&#x901A;&#x5E38;&#x662F;&#x7528;&#x6765;&#x628A;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E0D;&#x8FC7;&#x90A3;&#x4E5F;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x60F3;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x65B0;&#x7684;<code>Recommendation</code>&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x4E0D;&#x662F;&#x5408;&#x6CD5;&#x3002;</p>

<pre class="ruby">
def create     
  @recommendation = Recommendation.new(params[:recommendation])     
  if @recommendation.valid?     
    flash[:notice] = &quot;Successfully created recommendation.&quot;    
    redirect_to @recommendation    
  else    
    render :action =&gt; &#x27;new&#x27;    
  end    
end
</pre>
 
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x56DE;&#x6EDA;&#x6700;&#x540E;&#x7684;&#x90A3;&#x4E2A;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x4EFB;&#x52A1;&#xFF0C;&#x628A;Recommendation&#x6570;&#x636E;&#x8868;&#x5220;&#x6389;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x8868;&#x5355;&#x662F;&#x4E0D;&#x662F;&#x8FD8;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x4E5F;&#x8981;&#x5220;&#x9664;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x6587;&#x4EF6;&#x3002;</p>

<pre class="terminal">
rm db/migrate/*_recommendations.rb  
</pre> 
 
<p>&#x5220;&#x9664;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x5237;&#x65B0;&#x8868;&#x5355;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x770B;&#x5230;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x80AF;&#x5B9A;&#x4F1A;&#x62A5;&#x9519;&#x8BF4;&#x627E;&#x4E0D;&#x5230;Recommendation&#x6570;&#x636E;&#x8868;&#x3002;&#x56E0;&#x4E3A;ActiveRecord&#x4F9D;&#x8D56;&#x4E8E;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5173;&#x8054;&#x7684;&#x6570;&#x636E;&#x8868;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/273/original/E193I03.png" width="800" height="478" alt="The exception raised when we remove the table."/>
</div>

<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x7684;&#x662F;&#x5728;&#x6587;&#x7AE0;<a href="http://codetunes.com/2008/07/20/tableless-models-in-rails/">an entry on the Code Tunes blog</a>&#x4E2D;&#x8BB2;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x6587;&#x7AE0;&#x4E2D;&#x8BB2;&#x7684;&#x6280;&#x5DE7;&#x5305;&#x62EC;&#x5982;&#x4F55;&#x91CD;&#x8F7D;ActiveRecord&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x624B;&#x5DE5;&#x6765;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x4F7F;&#x7528;&#x540E;&#x53F0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;Recommendation&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x52A0;&#x5165;&#x4E24;&#x4E2A;&#x91CD;&#x8F7D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x7528;column&#x7C7B;&#x65B9;&#x6CD5;&#x6765;&#x50CF;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x6587;&#x4EF6;&#x4E2D;&#x90A3;&#x6837;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x3002;</p>

<pre class="ruby">
class Recommendation &lt; ActiveRecord::Base     
  def self.columns() @columns ||= []; end    
      
  def self.column(name, sql_type = nil, default = nil, null = true)     
    columns &lt;&lt; ActiveRecord::ConnectionAdapters::Column.new(name.to_s, default, sql_type.to_s, null)     
  end    
       
  column :from_email, :string    
  column :to_email, :string    
  column :article_id, :string    
  column :message, :text       
end   
</pre>
<p class="title">&#x5728;/app/models/recommendation.rb&#x4E2D;&#x5B9A;&#x4E49;&#x5B57;&#x6BB5;</p>

<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x518D;&#x5237;&#x65B0;&#x63A8;&#x8350;&#x6587;&#x7AE0;&#x7684;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6B63;&#x786E;&#x7684;&#x8868;&#x5355;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x73B0;&#x5728;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7C7B;&#x4E2D;&#x4E86;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x8BFB;&#x53D6;&#x6765;&#x7684;&#x3002;</p>

<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E0D;&#x7528;&#x6570;&#x636E;&#x5E93;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x95EE;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x8BA9;Recommendation&#x7C7B;&#x7EE7;&#x627F;&#x81EA;ActiveRecord::Base&#x3002;Rails&#x4E2D;&#x5BF9;&#x4E8E;ActiveRecord&#x7684;&#x8026;&#x5408;&#x5EA6;&#x5F88;&#x4F4E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x57FA;&#x4E8E;ActiveRecord&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7C7B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7C7B;&#x7EE7;&#x627F;&#x81EA;ActiveRecord&#x80FD;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x597D;&#x5904;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x7684;&#x5F88;&#x591A;&#x5176;&#x5B83;&#x529F;&#x80FD;&#xFF0C; &#x6BD4;&#x5982;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x673A;&#x5236;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7528;ActiveRecord&#x7684;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x673A;&#x5236;&#x6765;&#x68C0;&#x67E5;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x7684;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;&#x6D88;&#x606F;&#x7684;&#x957F;&#x5EA6;&#x662F;&#x5426;&#x5408;&#x9002;&#x3002;</p>

<pre class="ruby">
validates_format_of :from_email, :to_email, :with =&gt; /^[-a-z0-9_+\.]+\@([-a-z0-9]+\.)+[a-z0-9]{2,4}$/i     
validates_length_of :message, :maximum =&gt; 500  
</pre>
<p class="title">&#x5728;<code>/app/models/recommendation.rb</code>&#x4E2D;&#x52A0;&#x5165;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x673A;&#x5236;</p>

<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x68C0;&#x67E5;&#x673A;&#x5236;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x63D0;&#x4EA4;&#x7684;&#x8868;&#x5355;&#x4E2D;&#x6709;&#x975E;&#x6CD5;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;Rails&#x62A5;&#x544A;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x4E2A;&#x548C;&#x6709;&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>

<div class="imageWrapper">
  <img src="/system/photos/274/original/E193I04.png" width="797" height="364" alt="The validation errors are shown when the email addresses are invalid."/>
</div>

<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7EE7;&#x627F;&#x81EA;ActiveRecord&#x7684;&#x539F;&#x56E0;&#x662F;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x3002;&#x5728;<code>Recommendation</code>&#x4E2D;&#xFF0C;&#x65E2;&#x7136;<code>article_id</code>&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4ECD;&#x65E7;&#x53EF;&#x4EE5;&#x5728;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x5B9A;&#x4E49;&#x4E0B;&#x9762;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x83B7;&#x53D6;&#x5230;&#x5173;&#x8054;&#x7684;Article&#x5BF9;&#x8C61;&#x4E86;&#x3002;</p>

<pre class="ruby">
belongs_to :article    
</pre>

<p>&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x57FA;&#x4E8E;ActiveRecord&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#x51E0;&#x4E4E;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x662F;&#x5B83;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x540E;&#x53F0;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B83;&#x7684;&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#x662F;&#x901A;&#x8FC7;Ruby&#x8BED;&#x8A00;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x78B0;&#x5DE7;&#x8C03;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x521A;&#x624D;&#x62A5;&#x51FA;&#x7684;&#x540C;&#x6837;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x8BF4;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x662F;&#x6709;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x3002;</p>

<p>&#x7A0B;&#x5E8F;&#x4E2D;&#x5269;&#x4E0B;&#x7684;&#x90E8;&#x5206;&#x662F;&#x5728;&#x6B63;&#x786E;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x4EE5;&#x540E;&#x53D1;&#x9001;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x5199;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x96C6;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x53D1;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x770B;<a href="http://railscasts.com/episodes/61-sending-email">&#x7B2C;61&#x96C6;</a>&#xFF0C;&#x90A3;&#x91CC;&#x9762;&#x6709;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>

<p>&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x975E;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x60F3;&#x60F3;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x628A;&#x7528;&#x6237;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x662F;&#x518D;&#x7B80;&#x5355;&#x4E0D;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x4F60;&#x4E0D;&#x4F1A;&#x9A6C;&#x4E0A;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x770B;&#x662F;&#x5426;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7406;&#x7531;&#x6765;&#x51B3;&#x5B9A;&#x4E0D;&#x628A;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x90AE;&#x4EF6;&#x7CFB;&#x7EDF;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x63AA;&#x65BD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x5907;&#x4EFD;&#x3002;</p>