<p>Vamos a dedicar este episodio a  <a href="http://activeadmin.info">Active Admin</a>, que es una gema con la que podemos a&ntilde;adir f&aacute;cilmente una interfaz de administraci&oacute;n a nuestras aplicaciones Rails.  La interfaz que se genera tiene un aspecto cuidado y muy personalizable.  Se puede ver en acci&oacute;n entrando en la  <a href="http://demo.activeadmin.info/admin">demo en vivo</a>.</p> 

<p>En este episodio vamos a integrar Active Admin sobre una aplicaci&oacute;n Rails ya existente.  La aplicaci&oacute;n con la que trabajaremos  es una aplicaci&oacute;n muy sencilla de comercio electr&oacute;nico que tiene varios productos, cada uno de ellos con su precio y categor&iacute;a.  Utilizaremos ActiveAdmin para crear una interfaz de administraci&oacute;n que permita gestionar nuestros productos.</p>


<div class="imageWrapper">
  <img src="/system/photos/735/original/E284I01.png" width="799" height="460" alt="La aplicación."/>
</div>

<h3>Instalaci&oacute;n de Active Admin</h3>

<p>Active Admin es una gema que se instala, como es habitual, a&ntilde;adiendo una referencia en el <code>Gemfile</code> y ejecutando a continuaci&oacute;n <code>bundle</code>.  La aplicaci&oacute;n es una aplicaci&oacute;n Rails 3.1 por lo que debemos asegurarnos de incluir la gema <code>sass-rails</code> porque Active Admin depende de ella.  En Rails 3.0 no nos har&iacute;a falta incluirla.</p>


<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &#x27;activeadmin&#x27;</pre>

<p>Una vez que Bundler ha terminado, para a&ntilde;adir Active Admin  tenemos que ejecutar un generador en nuestra aplicaci&oacute;n.  Este generador adem&aacute;s nos dar&aacute; instrucciones adicionales que podremos configurar despu&eacute;s.  Tenemos que a&ntilde;adir la opci&oacute;n <code>host</code> a la configuraci&oacute;n del correo en el entorno de desarrollo y asegurarnos de que tenemos una URL ra&iacute;z y mostramos los mensajes <code>notice</code> y <code>alert</code> en el <em>layout</em> de la aplicaci&oacute;n.</p>

<pre class="terminal">$ rails g active_admin:install
      invoke  devise
    generate    devise:install
      create    config/initializers/devise.rb
      create    config/locales/devise.en.yml
  
==================================================================

Some setup you must do manually if you haven&#x27;t yet:

  1. Setup default url options for your specific environment. Here is an example of development environment:

       config.action_mailer.default_url_options = { :host =&gt; &#x27;localhost:3000&#x27; }

     This is a required Rails configuration. In production it must be the actual host of your application

  2. Ensure you have defined root_url to *something* in your config/routes.rb.
     For example:

       root :to =&gt; &quot;home#index&quot;

  3. Ensure you have flash messages in app/views/layouts/application.html.erb. For example:

       &lt;p class=&quot;notice&quot;&gt;&lt;%= notice %&gt;&lt;/p&gt;
       &lt;p class=&quot;alert&quot;&gt;&lt;%= alert %&gt;&lt;/p&gt;</pre>

<p>Nosotros ya tenemos todo esto en nuestra aplicaci&oacute;n por lo que podemos continuar.</p>

<p>La orden tambi&eacute;n crea alguna migraciones que tenemos que ejecutar.</p>

<pre class="terminal">$ rake db:migrate</pre>

<h3>Uso de Active Admin</h3>


<p>En  la <a href="http://activeadmin.info/documentation.html">documentaci&oacute;n de Active Admin</a> se indica que durante la migraci&oacute;n inicial se crear&aacute; un usuario con el nombre  <code>admin@example.com</code> y la clave <code>password</code>. Podemos iniciar la sesi&oacute;n con estos credenciales (por supuesto estos valores se pueden modificar editando el fichero de migraci&oacute;n <code>devise_create_admin_users.rb</code> antes de lanzar las migraciones)  Visitando  <a href="http://localhost:3000/admin">http://localhost:3000/admin</a> con el servidor Rails en marcha veremos un formulario de inicio de sesi&oacute;n donde podemos introducir dichas credenciales.</p>

<div class="imageWrapper">
  <img src="/system/photos/736/original/E284I02.png" width="799" height="458" alt="Inicio de sesión de Active Admin"
</div>

<p>Tras el inicio de sesi&oacute;n seremos llevados al cuadro de mandos de Active Admin, donde no encontraremos mucho que ver.</p>

<div class="imageWrapper">
  <img src="/system/photos/737/original/E284I03.png" width="799" height="458" alt="El cuadro de mandos de Active Admin."/>
</div>

<p>Como queremos gestionar nuestros productos a&ntilde;adiremos el recurso <code>Product</code> a Active Admin ejecutando la orden:</p>

<pre class="terminal">$ rails g active_admin:resource product
      create  app/admin/products.rb</pre>

<p>Este generador crea un fichero llamado <code>products.rb</code> bajo el directorio <code>app/admin</code> de la aplicaci&oacute;n.  Si refrescamos el cuadro de mandos de la aplicaci&oacute;n ahora veremos un enlace con el texto  &ldquo;Products&rdquo; y si hacemos clic iremos a una p&aacute;gina que tiene todo lo necesario para gestionar los productos.</p>

<div class="imageWrapper">
  <img src="/system/photos/738/original/E284I04.png" width="802" height="474" alt="El índice de la administración de productos."/>
</div>

<p>En la p&aacute;gina hay opciones para ordenar o filtrar el listado de productos por cualquier atributo.  Active Admin detectar&aacute; incluso las relaciones <code>belongs_to</code> con <code>Category</code> e implementar&aacute; un men&uacute; desplegable para poder filtrar los productos por dicha categor&iacute;a.  Esto tambi&eacute;n ocurre cuando creamos un nuevo producto y se muestra un desplegable para escoger la categor&iacute;a. El resto de atributos tendr&aacute;n campos de entrada acordes con su tipo de datos.</p>
 
<div class="imageWrapper">
  <img src="/system/photos/739/original/E284I05.png" width="802" height="474" alt="La página de nuevo producto."/>
</div>

<p>Esta funcionalidad es f&aacute;cil de modificar.  Empecemos personalizando el &iacute;ndice de productos quitando columnas.  Para ello modificaremos el fichero  <code>/app/admin/products.rb</code> anteriormente generado.  Podemos cambiar el listado principal redefiniendo el m&eacute;todo <code>index</code>.  Este m&eacute;todo recibe un bloque dentro del cual podemos especificar las columnas que deseamos ver en la p&aacute;gina invocando a <code>column</code>.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column :released_at
    column :price
  end
end</pre>

<p>Si recargamos la p&aacute;gina de productos veremos que ahora muestra s&oacute;lo las columnas que queremos.</p>

<div class="imageWrapper">
  <img src="/system/photos/740/original/E284I06.png" width="802" height="474" alt="En la página de productos ahora aparece las columnas escogidas por nosotros."/>
</div>


<p>Obs&eacute;rvese que la asociaci&oacute;n con <code>Category</code> ha sido detectada autom&aacute;ticamente  y junto a cada producto se muestra la categor&iacute;a correcta.</p>

<p>Podemos ir m&aacute;s lejos y cambiar el t&iacute;tulo de la columna pasando el t&iacute;tulo como primer argumento.  Cambiaremos de esta forma el campo <code>released_at</code>.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price
  end
end</pre>

<p>Si queremos cambiar los valores de una columna podemos hacerlo pasando un bloque a <code>column</code>.  El campo de precio no muestra un s&iacute;mbolo monetario, pero podemos cambiarlo para que lo haga.  El m&eacute;todo <code>column</code> puede recibir un bloque, en cuyo caso se le pasar&iacute;a la instancia (en este caso un <code>Product</code>) y se mostrar&iacute;a en la columna lo que devuelva el bloque.  Aqu&iacute; tenemos acceso a los m&eacute;todos <em>helper</em> por lo que podemos utilizar <code>number_to_currency</code> para mostrar correctamente el precio.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price do |product|
      number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
    end
  end
end</pre>

<p>Si recargamos la p&aacute;gina veremos el t&iacute;tulo modificado y el precio correcto para cada producto.</p>


<div class="imageWrapper">
  <img src="/system/photos/741/original/E284I07.png" width="802" height="474" alt="En la columna de precio ya aparecen los precios correctamente."/>
</div>

<p>Pero si personalizamos el valor devuelto para el campo <code>price</code> entonces ya no podemos ordenar por dicho campo, y tampoco tenemos enlaces de edici&oacute;n y borrado para cada elemento.  Esto lo tenemos que corregir, siempre que usemos un bloque para personalizar un valor tambi&eacute;n debemos usar la opci&oacute;n <code>:sortable</code> para que Active Admin sepa c&oacute;mo ordenar la columna.  A&ntilde;adiremos tambi&eacute;n <code>default_actions</code> para que vuelvan a aparecer los enlaces de edici&oacute;n y borrado.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
    end
    default_actions
  end
end</pre>

<p>En el campo de precio ahora se muestra el s&iacute;mbolo monetario pero ser&iacute;a mejor poder alinear los valores a la derecha.  Esto lo podemos hacer con CSS, pero para eso tenemos que poder identificar la columna.  Active Admin proporciona una manera de generar HTML muy similar a  <a href="http://markaby.github.com/">Markaby</a>, tan s&oacute;lo tenemos que llamar un m&eacute;todo con el nombre de la etiqueta que deseamos generar.  Podemos pasar la opci&oacute;n <code>:class</code> para que la etiqueta tenga algo que podamos controlar desde CSS.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      div :class =&gt; &quot;price&quot; do
        number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
      end
    end
    default_actions
  end
end</pre>

<p>Ya podemos dar estilos a esta columna modificando el fichero <code>active_admin.css.scss</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/active_admin.css.scss</p>
<pre class="css">// Active Admin CSS Styles
@import &quot;active_admin/mixins&quot;;
@import &quot;active_admin/base&quot;;

// To customize the Active Admin interfaces, add your
// styles here:
.price {
  text-align :right;
}</pre>

<p>Y la columna con precios se alinear&aacute; correctamente.</p>

<div class="imageWrapper">
  <img src="/system/photos/742/original/E284I08.png" width="802" height="472" alt="La columna de precios justificada a la derecha."/>
</div>

<h3>&Aacute;mbitos</h3>

<p>Otra interesante funcionalidad de Active Admin son los &aacute;mbitos, que se comportan como filtros predefinidos.  Para crear estos &aacute;mbitos hay que seguir dos pasos. Primero a&ntilde;adimos una llamada a <code>scope</code> en el fichero de configuraci&oacute;n de nuestros productos, pas&aacute;ndoles el nombre de un &aacute;mbito.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  scope :unreleased
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      div :class =&gt; &quot;price&quot; do
        number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
      end
    end
    default_actions
  end
end</pre>

<p>Y luego necesitamos escribir dicho &aacute;mbito en el modelo correspondiente:</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">class Product &lt; ActiveRecord::Base
  belongs_to :category
  scope :unreleased, where(:released_at =&gt; nil)
end</pre>

<p>Si ahora volvemos a cargar la p&aacute;gina de administraci&oacute;n de productos veremos listado el &aacute;mbito.  Si hacemos clic en &eacute;l veremos un listado de productos filtrado por dicho &aacute;mbito.</p>

<div class="imageWrapper">
  <img src="/system/photos/743/original/E284I09.png" width="802" height="472" alt="Listado de productos filtrado por el ámbito correspondiente."/>
</div>

<h3>Personalizaci&oacute;n del cuadro de mandos</h3>

<p>A continuaci&oacute;n veremos c&oacute;mo personalizar el cuadro de mandos.  Por defecto aparece vac&iacute;o, as&iacute; que mostraremos un listado de los productos m&aacute;s recientes, lo que haremos modificando el fichero <code>/app/admin/dashboards.rb</code>.  En los comentarios del archivo se documentan las posibilidades de las que disponemos.</p>


<p>Para a&ntilde;adir una secci&oacute;n al cuadro de mandos se utiliza el m&eacute;todo <code>section</code>.  Queremos enumerar los productos m&aacute;s recientes en una tabla, lo que podemos hacer con <code>table_for</code>.  En el bloque podemos definir qu&eacute; columnas queremos mostrar con <code>column</code> de la misma forma que hicimos cuando personalizamos el &iacute;ndice de productos.  Tambi&eacute;n a&ntilde;adiremos un enlace a la p&aacute;gina que muestra todos los productos.</p>
<p class="codeFilePath">/app/admin/dashboards.rb</p>
<pre class="ruby">ActiveAdmin::Dashboards.build do
  section &quot;Recent Products&quot; do
    table_for Product.order(&quot;released_at desc&quot;).limit(5) do
      column :name
      column :released_at
    end
    strong { link_to &quot;View All Products&quot;, admin_products_path }
  end
end</pre>

<p>Si ahora recargamos el panel de control veremos los cinco productos m&aacute;s recientes, as&iacute; como el enlace.</p>

<div class="imageWrapper">
  <img src="/system/photos/744/original/E284I10.png" width="802" height="472" alt="El listado de productos más recientes en el cuadro de mandos."/>
</div>

<p>La p&aacute;gina ser&iacute;a m&aacute;s &uacute;til si cada producto del listado enlazase a la p&aacute;gina de administraci&oacute;n de dicho producto.  Esto lo podemos hacer pas&aacute;ndole un bloque al m&eacute;todo <code>column</code>, igual que hicimos con la columna <code>price</code> anteriormente.</p>

<p class="codeFilePath">/app/admin/dashboards.rb</p>
<pre class="ruby">ActiveAdmin::Dashboards.build do
  section &quot;Recent Products&quot; do
    table_for Product.order(&quot;released_at desc&quot;).limit(5) do
      column :name do |product|
        link_to product.title, admin_product_path(product)
      end
      column :released_at
    end
    strong { link_to &quot;View All Products&quot;, admin_products_path }
  end
end</pre>

<p>Hay una forma m&aacute;s breve de definir una ruta en <code>link_to</code>.  En lugar de utilizar <code>admin_product_path(product)</code> podemos pasar un <em>array</em> con un s&iacute;mbolo como primer elemento y el producto como el segundo:</p>
  
<pre class="ruby">link_to product.title, [:admin, product]</pre>

<p>Si recargamos el cuadro de mandos veremos el t&iacute;tulo de cada producto como un enlace que nos llevar&aacute; a la p&aacute;gina correspondiente de administraci&oacute;n de dicho producto.</p>

<h3>Ajustes en las hojas de estilo</h3>

<p>Hay un problema que debemos tener en cuenta cuando utilizamos Active Admin en Rails 3.1, que podemos ver volviendo al sitio principal.</p>

 <div class="imageWrapper">
  <img src="/system/photos/745/original/E284I11.png" width="801" height="435" alt="The home page now has incorrect styling."/>
</div>

<p>La p&aacute;gina no tiene el aspecto que ten&iacute;a antes porque ahora se incluye en todas las p&aacute;ginas la hoja de estilos de Active Admin.  Rails 3.1 incluye todas las hojas de estilos por defecto, debido a la presencia de la l&iacute;nea con <code>require_tree .</code> en el fichero de manifiesto de <code>application.css</code>.  Como esto no es lo que queremos (y adem&aacute;s siempre es buena idea hacerlo para tener m&aacute;s control sobre los estilos de nuestras aplicaci&oacute;n) vamos a cambiar <code>require_tree .</code> por <code>require products</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css</p>
<pre class="css">/*
 * This is a manifest file that&#x27;ll automatically include all the stylesheets available in this directory
 * and any sub-directories. You&#x27;re free to add application-wide styles to this file and they&#x27;ll appear at
 * the top of the compiled file, but it&#x27;s generally better to create a new file per style scope.
 *= require_self
 *= require products 
*/

/* Se omite el resto del archivo */</pre>

<p>Una soluci&oacute;n todav&iacute;a mejor es pasarnos a la orden <code>import</code> de SASS.  Podemos hacer que el fichero CSS de nuestra aplicaci&oacute;n sea SASS a&ntilde;adiendo la extensi&oacute;n <code>.scss</code> a su nombre.  Luego podemos quitar el manifiesto de la parte superior y a&ntilde;adir al final la orden <code>import</code>:</p>
<p class="codeFilePath">/app/assets/stylesheets/application.css.scss</p>
<pre class="css">/* (Se omiten los estilos)*/

@import &quot;products&quot;;</pre>

<p>Si recargamos la p&aacute;gina principal s&oacute;lo se incluyen las p&aacute;ginas de estilos correspondientes y la p&aacute;gina tiene el aspecto correcto.</p>

<h3>Configuraci&oacute;n global</h3>

<p>Hay otro archivo para configurar Active Admin en el directorio <code>/config/initializers</code> donde hay bastantes opciones de configuraci&oacute;n que aparecen comentadas.  Una que no lo est&aacute; es el fichero con el t&iacute;tulo del sitio, que cambiaremos.</p>

<p class="codeFilePath">/config/initializers/active_admin.rb</p>
<pre class="ruby">ActiveAdmin.setup do |config|

  # == Site Title
  #
  # Set the title that is displayed on the main layout
  # for each of the active admin pages.
  #
  config.site_title = &quot;Eifion&#x27;s Store&quot;

  # (Se omiten otras opciones de configuraci&oacute;n)
end</pre>

<p>Para que estos cambios surtan efecto debemos reiniciar el servidor, tras hacerlo aparecer&aacute; el t&iacute;tulo correcto.</p>


<div class="imageWrapper">
  <img src="/system/photos/746/original/E284I12.png" width="801" height="435" alt="Se muestra el nuevo título."/>
</div>

<p>Con esto terminamos este episodio.  Hay muchas m&aacute;s cosas que se pueden adaptar en Active Admin y que no hemos repasado hoy, merece la pena ver la documentaci&oacute;n para ver qu&eacute; m&aacute;s cosas podemos hacer.  Podemos modificar el aspecto y la funcionalidad de todas las p&aacute;ginas de Active Admin para adaptarlas a nuestras necesidades, por lo que es una soluci&oacute;n muy poderosa para a&ntilde;adir la funcionalidad de administraci&oacute;n en nuestras aplicaciones Rails.</p>
