<p>Dans cet &eacute;pisode, nous allons voir <a href="http://activeadmin.info">Active&nbsp;Admin</a>. Cette gem vous permet d&#x27;ajouter facilement une interface d&#x27;administration &agrave; vos applications Rails. Elle cr&eacute;e de jolies pages d&#x27;administration et est tr&egrave;s param&eacute;trable. Vous pouvez jeter un &oelig;il &agrave; la <a href="http://demo.activeadmin.info/admin">d&eacute;mo live</a> pour vous faire une id&eacute;e.</p>

<p>Nous allons ajouter Active&nbsp;Admin &agrave; une application Rails existante. L&#x27;application que nous utiliserons est un simple syst&egrave;me d&#x27;e-commerce contenant un certain nombre de produits, chacun ayant un prix et appartenant &agrave; une cat&eacute;gorie. Nous allons utiliser Active&nbsp;Admin pour cr&eacute;er un interface d&#x27;administration pour g&eacute;rer nos produits.</p>

<div class="imageWrapper">
  <img src="/system/photos/735/original/E284I01.png" width="799" height="460" alt="Notre application."/>
</div>

<h3>Installer Active Admin</h3>

<p>Active&nbsp;Admin est distribu&eacute;e sous forme de gem et s&#x27;installe, comme d&#x27;habitude, gr&acirc;ce &agrave; une r&eacute;f&eacute;rence dans le <code>Gemfile</code> et &agrave; un appel &agrave; <code>bundle</code>. Notre application a &eacute;t&eacute; d&eacute;velopp&eacute;e avec Rails&nbsp;3.1, nous devons donc nous assurer qu&#x27;elle inclut bien <code>sass-rails</code> car Active&nbsp;Admin en d&eacute;pend. Sous Rails&nbsp;3.0, ce n&#x27;est pas un probl&egrave;me et nous n&#x27;avons pas besoin de l&#x27;inclure.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &#x27;activeadmin&#x27;</pre>

<p>Une fois que Bundler a termin&eacute;, nous devons lancer un g&eacute;n&eacute;rateur pour ajouter les fichiers d&#x27;Active&nbsp;Admin &agrave; notre application. Ce g&eacute;n&eacute;rateur va nous fournir les instructions sur les r&eacute;glages que nous allons devoir effectuer apr&egrave;s son lancement. Nous devons ajouter l&#x27;option <code>host</code> &agrave; la configuration du Mailer dans l&#x27;environnement de d&eacute;veloppement, nous assurer que nous avons une URL root et que les messages flash <code>notice</code> et <code>alert</code> sont bien affich&eacute;s dans le layout de l&#x27;application.</p>

<pre class="terminal">$ rails g active_admin:install
      invoke  devise
    generate    devise:install
      create    config/initializers/devise.rb
      create    config/locales/devise.en.yml

==================================================================

Some setup you must do manually if you haven&#x27;t yet:

  1. Setup default url options for your specific environment. Here is an example of development environment:

       config.action_mailer.default_url_options = { :host =&gt; &#x27;localhost:3000&#x27; }

     This is a required Rails configuration. In production it must be the actual host of your application

  2. Ensure you have defined root_url to *something* in your config/routes.rb.
     For example:

       root :to =&gt; &quot;home#index&quot;

  3. Ensure you have flash messages in app/views/layouts/application.html.erb. For example:

       &lt;p class=&quot;notice&quot;&gt;&lt;%= notice %&gt;&lt;/p&gt;
       &lt;p class=&quot;alert&quot;&gt;&lt;%= alert %&gt;&lt;/p&gt;</pre>

<p>Nous avons d&eacute;j&agrave; fait tout cela pour notre application, nous sommes donc pr&ecirc;ts &agrave; continuer.</p>

<p>La commande cr&eacute;e &eacute;galement quelques migrations, nous allons donc les lancer maintenant.</p>

<pre class="terminal">$ rake db:migrate</pre>

<h3>Utiliser Active Admin</h3>

<p>Si nous regardons la <a href="http://activeadmin.info/documentation.html">documentation d&#x27;Active Admin</a>, nous allons voir que lorsque nous l&#x27;installons, elle cr&eacute;e un utilisateur ayant <code>admin@example.com</code> comme nom d&#x27;utilisateur et <code>password</code> comme mot de passe. Nous pouvons utiliser ces identifiants pour nous connecter (vous pouvez les configurer en &eacute;ditant <code>devise_create_admin_users.rb</code> avant de lancer les migrations). Si nous visitons <a href="http://localhost:3000/admin">http://localhost:3000/admin</a>, une fois le serveur Rails lanc&eacute;, nous allons voir un formulaire de connexion via lequel nous pouvons nous connecter avec les identifiants vus pr&eacute;c&eacute;demment.</p>

<div class="imageWrapper">
  <img src="/system/photos/736/original/E284I02.png" width="799" height="458" alt="La page de connexion d&#x27;Active Admin."/>
</div>

<p>Une fois que nous nous sommes connect&eacute;s, nous allons &ecirc;tre redirig&eacute;s vers le tableau de bord d&#x27;Active&nbsp;Admin. Il n&#x27;y aura, cependant, pas grand chose &agrave; voir pour le moment.</p>

<div class="imageWrapper">
  <img src="/system/photos/737/original/E284I03.png" width="799" height="458" alt="Tableau de bord d&#x27;Active Admin."/>
</div>

<p>Nous voulons g&eacute;rer nos produits. Nous allons donc ajouter notre ressource <code>Product</code> dans Active&nbsp;Admin en lan&ccedil;ant cette commande&nbsp;:</p>

<pre class="terminal">$ rails g active_admin:resource product
      create  app/admin/products.rb</pre>

<p>Ce g&eacute;n&eacute;rateur va cr&eacute;er un fichier <code>products.rb</code> dans le dossier <code>app/admin</code> de notre application. Lorsque nous rafraichissons le tableau de bord, nous allons voir un lien &ldquo;Products&rdquo;&nbsp;; si nous cliquons sur ce lien, nous allons &ecirc;tre dirig&eacute;s vers une page contenant tout ce dont nous avons besoin pour g&eacute;rer nos produits.</p>

<div class="imageWrapper">
  <img src="/system/photos/738/original/E284I04.png" width="802" height="474" alt="La page d&#x27;administration des produits."/>
</div>

<p>Cette page a des options de tri et de filtrage des produits sur chaque attributs. Active&nbsp;Admin va m&ecirc;me d&eacute;tecter la relation <code>belongs_to</code> avec <code>Category</code> et nous fournir un menu d&eacute;roulant pour filtrer nos produits par cat&eacute;gorie. Cela fonctionne &eacute;galement lorsque nous cr&eacute;ons un nouveau produit. Les cat&eacute;gories sont montr&eacute;es sous forme de menu d&eacute;roulant et les autres attributs seront saisis dans des champs correspondant &agrave; leur type.</p>
 
<div class="imageWrapper">
  <img src="/system/photos/739/original/E284I05.png" width="802" height="474" alt="La page de cr&eacute;ation d&#x27;un produit."/>
</div>

<p>Personnaliser ce comportement est tr&egrave;s facile. Nous allons commencer par personnaliser la page d&#x27;index des produits et en r&eacute;duire le nombre de colonnes affich&eacute;es. Pour cela, nous allons modifier le fichier <code>/app/admin/products.rb</code> g&eacute;n&eacute;r&eacute; pr&eacute;c&eacute;demment. Nous modifions la page d&#x27;index en surchargeant la m&eacute;thode <code>index</code>. Cette m&eacute;thode prend en param&egrave;tre un bloc. Dans ce dernier, nous sp&eacute;cifions les colonnes que nous voulons voir sur la page en appelant <code>column</code>.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column :released_at
    column :price
  end
end</pre>

<p>Lorsque nous rechargeons la page des produits, nous allons voir les colonnes que nous avons choisies.</p>

<div class="imageWrapper">
  <img src="/system/photos/740/original/E284I06.png" width="802" height="474" alt="La page des procuits montre notre choix de colonnes."/>
</div>

<p>Notez que l&#x27;association <code>Category</code> a &eacute;t&eacute; d&eacute;tect&eacute;e et que la bonne cat&eacute;gorie est affich&eacute;e pour chaque produit.</p>

<p>Nous pouvons pousser plus loin cette personnalisation et changer le titre d&#x27;une colonne en passant un titre en premier argument de l&#x27;appel &agrave; <code>column</code>. Nous allons nous en servir pour modifier le titre de la colonne <code>released_at</code>.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price
  end
end</pre>

<p>Si nous voulons changer les valeurs d&#x27;une colonne, nous pouvons le faire en passant un bloc &agrave; <code>column</code>. Le champ <code>price</code> ne montre pas le symbole de monnaie mais nous pouvons changer cela pour que &ccedil;a soit le cas. La m&eacute;thode <code>column</code> peut prendre un bloc et, lorsqu&#x27;elle en re&ccedil;oit un, lui passe la ressource courante, dans notre cas un <code>Product</code>. Ce que le bloc retourne est affich&eacute; comme valeur dans la colonne concern&eacute;e. Nous avons acc&egrave;s aux helpers, nous pouvons donc utiliser <code>number_to_currency</code> pour afficher le prix correctement.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price do |product|
      number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
    end
  end
end</pre>

<p>Si nous rechargeons la page, nous allons voir le titre &ldquo;Release Date&rdquo; et chaque prix de produit sera affich&eacute; sous forme de valeur mon&eacute;taire.</p>

<div class="imageWrapper">
  <img src="/system/photos/741/original/E284I07.png" width="802" height="474" alt="La colonne des prix affiche maintenant des valeurs mon&eacute;taires."/>
</div>

<p>Personnaliser la valeur retourn&eacute;e par le champ <code>price</code> signifie que le champ n&#x27;est plus triable. Il nous manque &eacute;galement les liens de modification et de suppression de chaque produit. Nous allons donc corriger cela. Lorsque nous utilisons un bloc pour personnaliser une valeur, nous devons utiliser l&#x27;option <code>:sortable</code> pour pr&eacute;ciser &agrave; Active&nbsp;Admin comment trier ce champ. Nous allons donc faire cela et ajouter un appel &agrave; <code>default_actions</code> pour retrouver les liens d&#x27;&eacute;dition et de suppression.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
    end
    default_actions
  end
end</pre>

<p>Le champ <code>price</code> est bien affich&eacute; sous forme mon&eacute;taire mais il serait pr&eacute;f&eacute;rable que la valeur soit &eacute;galement align&eacute;e &agrave; droite. Nous pouvons changer cela dans les CSS mais pour que tout fonctionne, il nous faut un moyen de r&eacute;f&eacute;rencer une colonne en particulier. Active&nbsp;Admin fournit un moyen similaire &agrave; <a href="http://markaby.github.com/">Markaby</a> pour g&eacute;n&eacute;rer du HTML. Tout ce que nous avons &agrave; faire, c&#x27;est de passer une option <code>:class</code> pour donner &agrave; la balise une r&eacute;f&eacute;rence utilisable dans nos CSS.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      div :class =&gt; &quot;price&quot; do
        number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
      end
    end
    default_actions
  end
end</pre>

<p>Nous pouvons maintenant styliser cette colonne en modifiant le fichier <code>active_admin.css.scss</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/active_admin.css.scss</p>
<pre class="css">// Active Admin CSS Styles
@import &quot;active_admin/mixins&quot;;
@import &quot;active_admin/base&quot;;

// To customize the Active Admin interfaces, add your
// styles here:
.price {
  text-align :right;
}</pre>

<p>La colonne <code>price</code> est maintenant align&eacute;e correctement.</p>

<div class="imageWrapper">
  <img src="/system/photos/742/original/E284I08.png" width="802" height="472" alt="La colonne des prix est maintenant align&eacute;e &agrave; droite."/>
</div>

<h3>Les Scopes</h3>

<p>Les scopes sont une autre fonctionnalit&eacute; int&eacute;ressante d&#x27;Active&nbsp;Admin. Ils agissent comme des filtres pr&eacute;-existants et leur cr&eacute;ation consiste en deux &eacute;tapes. Tout d&#x27;abord, nous ajoutons un appel &agrave; <code>scope</code>, dans le fichier de configuration Active&nbsp;Admin pour nos produits, en lui passant en param&egrave;tre le nom d&#x27;un scope.</p>

<p class="codeFilePath">/app/admin/products.rb</p>
<pre class="ruby">ActiveAdmin.register Product do
  scope :unreleased
  index do
    column :name
    column :category
    column &quot;Release Date&quot;, :released_at
    column :price, :sortable =&gt; :price do |product|
      div :class =&gt; &quot;price&quot; do
        number_to_currency product.price, :unit =&gt; &quot;&amp;pound;&quot;
      end
    end
    default_actions
  end
end</pre>

<p>Nous devons ensuite &eacute;crire ce scope dans le mod&egrave;le <code>Product</code>.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">class Product &lt; ActiveRecord::Base
  belongs_to :category
  scope :unreleased, where(:released_at =&gt; nil)
end</pre>

<p>Si nous rechargeons la page des produits, nous voyons le scope list&eacute;. Lorsque nous cliquons sur celui-ci, la liste des produits est filtr&eacute;e &agrave; partir de ce scope.</p>

<div class="imageWrapper">
  <img src="/system/photos/743/original/E284I09.png" width="802" height="472" alt="Les produits filtr&eacute;s par le scope unreleased."/>
</div>

<h3>Personnaliser le Tableau de Bord</h3>

<p>Nous allons maintenant voir la personnalisation du Tableau de Bord. Il est vide par d&eacute;faut. Nous allons donc le modifier pour faire en sorte qu&#x27;il affiche une liste des produits les plus r&eacute;cents. Cela se fait dans le fichier <code>/app/admin/dashboards.rb</code>. Les commentaires de ce fichier sont une documentation utile, ils expliquent les diff&eacute;rentes mani&egrave;res de personnaliser le tableau de bord.</p>

<p>Pour ajouter une section au tableau de bord, nous utilisons la m&eacute;thode <code>section</code>. Nous voulons lister les produits les plus r&eacute;cents dans un tableau et nous pouvons le faire en utilisant la m&eacute;thode <code>table_for</code>. Dans son bloc, nous pr&eacute;cisons les colonnes que nous voulons afficher gr&acirc;ce &agrave; <code>column</code>, comme nous l&#x27;avons fait pour la page des produits.</p>

<p class="codeFilePath">/app/admin/dashboards.rb</p>
<pre class="ruby">ActiveAdmin::Dashboards.build do
  section &quot;Recent Products&quot; do
    table_for Product.order(&quot;released_at desc&quot;).limit(5) do
      column :name
      column :released_at
    end
    strong { link_to &quot;View All Products&quot;, admin_products_path }
  end
end</pre>

<p>Lorsque nous rechargeons la page, nous voyons maintenant les cinq derniers produits ainsi qu&#x27;un lien pointant vers la page de tous les produits.</p>

<div class="imageWrapper">
  <img src="/system/photos/744/original/E284I10.png" width="802" height="472" alt="Les produits les plus r&eacute;cents pr&eacute;sent&eacute;s dans le tableau de bord."/>
</div>

<p>La page serait plus pratique si chaque produit de la liste &eacute;tait un lien vers la page d&#x27;administration de ce produit. Nous pouvons faire cela en passant &agrave; nouveau un bloc &agrave; l&#x27;appel de <code>column</code>, comme nous l&#x27;avons pr&eacute;c&eacute;demment fait pour la colonne <code>price</code>.</p>

<p class="codeFilePath">/app/admin/dashboards.rb</p>
<pre class="ruby">ActiveAdmin::Dashboards.build do
  section &quot;Recent Products&quot; do
    table_for Product.order(&quot;released_at desc&quot;).limit(5) do
      column :name do |product|
        link_to product.title, admin_product_path(product)
      end
      column :released_at
    end
    strong { link_to &quot;View All Products&quot;, admin_products_path }
  end
end</pre>

<p>Il existe un moyen plus court de d&eacute;finir le chemin dans <code>link_to</code>. Au lieu d&#x27;utiliser <code>admin_product_path(product)</code>, nous pouvons passer un tableau ayant un symbole comme premi&egrave;re valeur et le produit comme seconde, comme ceci&nbsp;:</p>

<pre class="ruby">link_to product.title, [:admin, product]</pre>

<p>Si nous rechargeons le tableau de bord, nous allons voir que chaque titre de produit est un lien. Lorsque nous cliquons sur l&#x27;un d&#x27;eux, nous somme dirig&eacute;s vers la page d&#x27;administration du produit concern&eacute;.</p>

<h3>Corriger les CSS</h3>

<p>Un probl&egrave;me existe lorsque nous utilisons Active&nbsp;Admin avec Rails&nbsp;3.1. Nous pouvons le voir en allant sur une page de notre application autre que l&#x27;administration.</p>

 <div class="imageWrapper">
  <img src="/system/photos/745/original/E284I11.png" width="801" height="435" alt="La page d'accueil a un style incorrect."/>
</div>

<p>La page ne ressemble plus vraiment &agrave; ce qu&#x27;elle &eacute;tait avant car les CSS d&#x27;Active&nbsp;Admin sont incluses sur toutes les pages. Par d&eacute;faut, Rails&nbsp;3.1 inclut toutes les CSS en raison de la ligne <code>require_tree .</code> dans le manifest <code>application.css</code>. Ce n&#x27;est pas ce que nous voulons et il est de toute mani&egrave;re de bon ton de supprimer cette ligne pour nous donner plus de contr&ocirc;le sur les CSS de notre application. Nous n&#x27;avons qu&#x27;une seule autre CSS dans l&#x27;application principale, nous allons donc remplacer <code>require_tree .</code> par <code>require products</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css</p>
<pre class="css">/*
 * This is a manifest file that&#x27;ll automatically include all the stylesheets available in this directory
 * and any sub-directories. You&#x27;re free to add application-wide styles to this file and they&#x27;ll appear at
 * the top of the compiled file, but it&#x27;s generally better to create a new file per style scope.
 *= require_self
 *= require products
*/

/* Rest of file omitted */</pre>

<p>Une solution encore meilleure est de passer &agrave; la commande <code>import</code> de SASS. Nous pouvons transformer le principal fichier CSS de notre application en lui ajoutant une extension <code>.scss</code>. Nous pouvons ensuite supprimer le manifest au d&eacute;but du fichier (la partie du fichier que vous pouvez voir ci-dessus) et ajouter la commande <code>import</code> en fin de fichier.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css.scss</p>
<pre class="css">/* Styles omitted */

@import &quot;products&quot;;</pre>

<p>Lorsque nous rechargeons la page d&#x27;accueil, seules les CSS ad&eacute;quates sont incluses et la page a un rendu correct.</p>

<h3>Configuration Globale</h3>

<p>Active&nbsp;Admin a un autre fichier de configuration dans le dossier <code>/config/initializers</code> et nous terminerons cet &eacute;pisode par un coup d&#x27;&oelig;il sur celui-ci. Le fichier contient un grand nombre d&#x27;options de configuration, la plupart &eacute;tant comment&eacute;e. Une qui ne l&#x27;est pas est le titre de l&#x27;interface d&#x27;administration et nous allons le changer.</p>

<p class="codeFilePath">/config/initializers/active_admin.rb</p>
<pre class="ruby">ActiveAdmin.setup do |config|

  # == Site Title
  #
  # Set the title that is displayed on the main layout
  # for each of the active admin pages.
  #
  config.site_title = &quot;Eifion&#x27;s Store&quot;

  # Other configuration options omitted.
end</pre>

<p>Nous devons red&eacute;marrer le serveur pour voir le changement pris en compte.</p>

<div class="imageWrapper">
  <img src="/system/photos/746/original/E284I12.png" width="801" height="435" alt="Le nouveau titre est affich&eacute;."/>
</div>

<p>C&#x27;est tout pour cet &eacute;pisode. Active&nbsp;Admin regorge de fonctionnalit&eacute;s que nous n&#x27;avons pas vues ici, nous vous encourageons donc &agrave; consulter la documentation pour voir tout ce dont elle est capable. Nous pouvons personnaliser le rendu et les fonctionnalit&eacute;s de chaque page d&#x27;administration pour les adapter &agrave; nos besoins et cela en fait une puissante solution d&#x27;administration pour Rails.</p>
