<p>Vamos a dedicar este episodio a repasar algunas de las nuevas funcionalidades que incorpora Rails 3.1 en lo relativo a la autenticaci&oacute;n.  Como demostraci&oacute;n, tenemos una aplicaci&oacute;n sencilla con una p&aacute;gina que se puede acceder por cualquiera que conozca la URL.</p>

<div class="imageWrapper">
  <img src="/system/photos/678/original/E270I01.png" width="813" height="533" alt="La página que queremos asegurar."/>
</div>

<h3>Autenticaci&oacute;n b&aacute;sica HTTP</h3>

<p>Queremos a&ntilde;adir autorizaci&oacute;n a esta p&aacute;gina de forma que s&oacute;lo determinados usuarios puedan acceder a ella.  Para esto tenemos que a&ntilde;adir autenticaci&oacute;n, y la forma m&aacute;s r&aacute;pida de hacerlo es con la autenticaci&oacute;n b&aacute;sica de HTTP.  Rails 3.1 nos permite implementarla de una nueva forma; tan s&oacute;lo tenemos que modificar el controlador de la p&aacute;gina y a&ntilde;adir una llamada a un nuevo m&eacute;todo  llamado <code>http_basic_authenticate_with</code> que recibe las opciones <code>:name</code> y <code>:password</code>.</p>

<p class="codeFilePath">/app/controllers/secret_controller.rb</p>
<pre class="ruby">class SecretController &lt; ApplicationController
  http_basic_authenticate_with :name =&gt; &quot;frodo&quot;, :password =&gt; &quot;thering&quot;
  def index
  end
end</pre>

<p>Si queremos restringir la autenticaci&oacute;n s&oacute;lo a ciertas acciones podemos a&ntilde;adir las opciones  <code>:only</code> o <code>:except</code>.  Por supuesto en una aplicaci&oacute;n real mover&iacute;amos el usuario y la clave a un fichero de configuraci&oacute;n en lugar de tenerlo a plena vista en el c&oacute;digo, pero para nuestra aplicaci&oacute;n de ejemplo ser&aacute; m&aacute;s que suficiente.</p>

<p>Si ahora cargamos la p&aacute;gina veremos un di&aacute;logo de contrase&ntilde;a y s&oacute;lo podremos ver el contenido de la p&aacute;gina si introducimos el usuario y clave correctos que especificamos en  <code>http_basic_authenticate_with</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/679/original/E270I02.png" width="816" height="537" alt="La página exige autenticarse."/>
</div>

<p>La verdad es que esta autenticaci&oacute;n b&aacute;sica de HTTP se usa demasiado poco y es una forma r&aacute;pida y f&aacute;cil de hacer privada una parte de un sitio.  Como se ha visto en Rails 3.1 es incluso m&aacute;s f&aacute;cil de implementar.</p>

<h3>Uso de <code>secure_password</code></h3>

<p>A veces nos hace falta  un sistema de autorizaci&oacute;n un poco m&aacute;s robusto que pueda gestionar diferentes usuarios, y para ayudarnos con esto Rails 3.1 incorpora <code>secure_password</code>.</p>

<p>En el episodio 250  [<a href="http://railscasts.com/episodes/250-authentication-from-scratch">verlo</a>, <a href="http://es.asciicasts.com/episodes/250-autenticacion-desde-cero">leerlo</a>] creamos un sistema de autenticaci&oacute;n partiendo desde cero y con Rails 3.1 es todav&iacute;a m&aacute;s f&aacute;cil hacerlo.  Cambiemos la autenticaci&oacute;n b&aacute;sica de HTTP por la nuestra.</p>

<p>Lo primero que debemos hacer es generar un modelo <code>User</code> con campos para la direcci&oacute;n de correo y la clave.</p>

<pre class="terminal">$ rails g model user email:string password_digest:string</pre>

<p>Con esto podemos crear la tabla de la base de datos ejecutando la migraci&oacute;n.</p>

<pre class="terminal">$ rake db:migrate</pre>

<p>Lo importante aqu&iacute; es que el campo que almacenar&aacute; la clave tiene el nombre <code>password_digest</code>.  A continuaci&oacute;n tenemos que a&ntilde;adir una llamada a <code>has_secure_password</code> en el modelo <code>User</code>.</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">class User &lt; ActiveRecord::Base
  has_secure_password
end</pre>

<p>Esto a&ntilde;ade m&eacute;todos que establecen y validan la clave introducida, a&ntilde;ade validaciones para los campo de clave y confirmaci&oacute;n y tambi&eacute;n a&ntilde;ade la funcionalidad de autenticaci&oacute;n.  Por debajo se usa el campo <code>password_digest</code> que creamos antes para almacenar la clave cifrada.</p>

<p>No existe por defecto una validaci&oacute;n de presencia con <code>validates_presence_of</code> para la clave, por lo que la a&ntilde;adiremos para comprobarlo cuando se crea un nuevo usuario.</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">class User &lt; ActiveRecord::Base
  has_secure_password
  validates_presence_of :password, :on =&gt; :create
end</pre>

<p>Por lo general  querremos validar la direcci&oacute;n de de correo pero este paso nos lo saltaremos por ahora.</p>

<p>Para que los usuarios puedan crear cuentas tenemos que escribir el controlador <code>UsersController</code>.</p>

<pre class="terminal">$ rails g controller users</pre>

<p>El c&oacute;digo del controlador es muy sencillo y tiene este aspecto:</p>

<p class="codeFilePath">/app/controllers/users_controller.rb</p>
<pre class="ruby">class UsersController &lt; ApplicationController
  def new
    @user = User.new
  end

  def create
    @user = User.new(params[:user])
    if @user.save
      redirect_to root_url, :notice =&gt; &quot;Signed up!&quot;
    else
      render &quot;new&quot;
    end
  end
end</pre>

<p>La vista contiene un formulario de registro.</p>

<p class="codeFilePath">/app/views/users/new.html.erb</p>
<pre class="ruby">&lt;h1&gt;Sign Up&lt;/h1&gt;

&lt;%= form_for @user do |f| %&gt;
  &lt;% if @user.errors.any? %&gt;
    &lt;div class=&quot;error_messages&quot;&gt;
      &lt;h2&gt;Form is invalid&lt;/h2&gt;
      &lt;ul&gt;
        &lt;% for message in @user.errors.full_messages %&gt;
          &lt;li&gt;&lt;%= message %&gt;&lt;/li&gt;
        &lt;% end %&gt;
      &lt;/ul&gt;
    &lt;/div&gt;
  &lt;% end %&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :email %&gt;
    &lt;%= f.text_field :email %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :password %&gt;
    &lt;%= f.password_field :password %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= f.label :password_confirmation %&gt;
    &lt;%= f.password_field :password_confirmation %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;actions&quot;&gt;&lt;%= f.submit %&gt;&lt;/div&gt;
&lt;% end %&gt;</pre>

<p>Si ahora intentamos registrarnos e introducimos una clave y confirmaci&oacute;n que no coinciden veremos el error de la validaci&oacute;n que nos proporciona <code>has_secure_password</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/680/original/E270I03.png" width="800" height="501" alt="has_secure_password proporciona automáticamente la validación de confirmación."/>
</div>

<p>Si la clave y su confirmaci&oacute;n coinciden nos habremos registrado correctamente.</p>

<p>Los usuarios se pueden dar de alta pero todav&iacute;a no pueden iniciar la sesi&oacute;n, as&iacute; que crearemos un formulario de entrada con los campos de correo y clave.</p>


<p class="codeFilePath">/app/views/sessions/new.html.erb</p>
<pre class="ruby">&lt;h1&gt;Log in&lt;/h1&gt;

&lt;%= form_tag sessions_path do %&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= label_tag :email %&gt;
    &lt;%= text_field_tag :email, params[:email] %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;field&quot;&gt;
    &lt;%= label_tag :password %&gt;
    &lt;%= password_field_tag :password %&gt;
  &lt;/div&gt;
  &lt;div class=&quot;actions&quot;&gt;&lt;%= submit_tag &quot;Log in&quot; %&gt;&lt;/div&gt;
&lt;% end %&gt;</pre>

<p>N&oacute;tese que como no estamos editando un recurso tenemos que usar <code>form_tag</code> en lugar de <code>form_for</code>.  El formulario se env&iacute;a a <code>sessions_path</code>, as&iacute; que crearemos el controlador <code>SessionsController</code>.</p>

<pre class="terminal">$ rails g controller sessions</pre>

<p>Este controlador dispondr&aacute;  de las acciones <code>new</code>, <code>create</code> y <code>destroy</code> para que los usuarios puedan iniciar y terminar su sesi&oacute;n.</p>

<p class="codeFilePath">/app/controllers/sessions_controller.rb</p>
<pre class="ruby">class SessionsController &lt; ApplicationController
  def new
  end

  def create
    if # authenticated?
      session[:user_id] = user.id
      redirect_to root_url, :notice =&gt; &quot;Logged in!&quot;
    else
      flash.now.alert = &quot;Invalid email or password&quot;
      render &quot;new&quot;
    end
  end

  def destroy
    session[:user_id] = nil
    redirect_to root_url, :notice =&gt; &quot;Logged out!&quot;
  end
end</pre>

<p>Todav&iacute;a no hemos terminado con la acci&oacute;n <code>create</code> porque todav&iacute;a tenemos que escribir el c&oacute;digo que determina si la clave introducida por el usuario es correcta o no.  Aqu&iacute; es donde podemos aprovechar  la funcionalidad <code>secure_password</code> de Rails 3.1.</p>

<p>Lo primero que tenemos que hacer es recuperar el usuario por la direcci&oacute;n de correo introducida en el formulario.  Luego podemos invocar <code>authenticate</code> sobre el usuario, que es un m&eacute;todo que nos proporciona <code>has_secure_password</code>, y le pasamos la clave que el usuario ha introducido en el formulario para que el m&eacute;todo la compruebe contra la clave cifrada que hay en la base de datos.  <code>find_by_email</code> devolver&aacute; <code>nil</code> si el usuario no se encuentra en la base de datos, as&iacute; que comprobaremos si el usuario existe o no antes de comprobar la clave.</p>

<p class="codeFilePath">/app/controllers/sessions_controller.rb</p>
<pre class="ruby">def create
  user = User.find_by_email(params[:email])
  if user &amp;&amp; user.authenticate(params[:password])
    session[:user_id] = user.id
    redirect_to root_url, :notice =&gt; &quot;Logged in!&quot;
  else
    flash.now.alert = &quot;Invalid email or password&quot;
    render &quot;new&quot;
  end
end</pre>

<p>Esto es todo lo que hace falta hacer si queremos autenticarnos con <code>secure_password</code>.  Podemos probar este c&oacute;digo intentando iniciar la sesi&oacute;n.  Si introducimos una clave incorrecta veremos que la sesi&oacute;n no se inicia.</p>

<div class="imageWrapper">
  <img src="/system/photos/681/original/E270I04.png" width="800" height="390" alt="Si el usuario o la clave son incorrectos se devuelve un error."/>
</div>

<p>Si introducimos las credenciales adecuadas la autenticaci&oacute;n nos redirigir&aacute; a la p&aacute;gina principal.</p>

<p>Pero en la aplicaci&oacute;n todav&iacute;a tenemos que poder recuperar qu&eacute; usuario es el que tiene la sesi&oacute;n iniciada, por lo que tenemos que crear un m&eacute;todo llamado <code>current_user</code> en <code>ApplicationController</code> y hacer que sea un m&eacute;todo <em>helper</em> para que podamos usarlo en las vistas.   El m&eacute;todo simplemente recupera el usuario guardado en la sesi&oacute;n.</p>

<pre class="codeFilePath">/app/controllers/application_controller.rb</pre>
<pre class="ruby">class ApplicationController &lt; ActionController::Base
  protect_from_forgery
  
  private
  
  def current_user
    @current_user ||= User.find(session[:user_id]) if session[:user_id]
  end
  
  helper_method :current_user
end</pre>

<p>Lo mejor de este m&eacute;todo de autenticaci&oacute;n es la simplicidad del modelo <code>User</code>, que s&oacute;lo tiene dos l&iacute;neas de c&oacute;digo.</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">class User &lt; ActiveRecord::Base
  has_secure_password
  validates_presence_of :password, :on =&gt; :create
end</pre>

<p>En comparaci&oacute;n, la soluci&oacute;n del episodio 250 ten&iacute;a un modelo de usuario <a href="https://github.com/ryanb/railscasts-episodes/blob/master/episode-250/auth/app/models/user.rb">mucho m&aacute;s complejo</a>.  Dicho esto, ser&iacute;a prudente a&ntilde;adir la l&iacute;nea  <code>attr_accessible</code> al modelo para que por el formulario de registro s&oacute;lo se puedan establecer correo, clave y confirmaci&oacute;n.</p>

<p class="codeFilePath">/app/models/user.rb</p>
<pre class="ruby">class User &lt; ActiveRecord::Base
  attr_accessible :email, :password, :password_confirmation
  has_secure_password
  validates_presence_of :password, :on =&gt; :create
end</pre>

<h3>C&oacute;mo incluir HTTPS</h3>

<p>En las aplicaciones en las que gestionemos autenticaci&oacute;n no nos  interesa enviar las credenciales en claro, por lo que es muy buena idea usar SSL sobre HTTPS.  Antes de Rails 3.1 esto se ten&iacute;a que hacer manualmente o con alguna extensi&oacute;n pero ahora tenemos la posibilidad de hacer esto de una forma mucho m&aacute;s f&aacute;cil.</p>

<p>Para restringir el uso de un controlador a HTTPS tan s&oacute;lo tenemos que a&ntilde;adir una llamada al m&eacute;todo de clase <code>force_ssl</code>. Si s&oacute;lo queremos ejercer esta restricci&oacute;n sobre ciertas acciones de un controlador podemos utilizar las opciones   <code>:only</code> o <code>:except</code> que funcionan igual que con  <code>before_filter</code>.</p> 

<p class="codeFilePath">/app/controllers/application_controller.rb</p>
<pre class="ruby">class ApplicationController &lt; ActionController::Base
  protect_from_forgery
  force_ssl
  private
  
  def current_user
    @current_user ||= User.find(session[:user_id]) if session[:user_id]
  end
  
  helper_method :current_user
end</pre>

<p>El m&eacute;todo <code>force_ssl</code> s&oacute;lo fuerza HTTPS en los modos de pruebas y producci&oacute;n.  Si reiniciamos la aplicaci&oacute;n en modo de producci&oacute;n y recargamos la p&aacute;gina de registro intentar&aacute; redirigirnos a la versi&oacute;n SSL.</p>

<div class="imageWrapper">
  <img src="/system/photos/682/original/E270I05.png" width="795" height="280" alt="La página fuerza SSL."/>
</div>

<p>En nuestro servidor de desarrollo recibimos un fallo porque no soporta HTTPS pero si lo hicieramos con el de producci&oacute;n  ver&iacute;amos la versi&oacute;n segura de esta p&aacute;gina.</p>

<p>Con esto cerramos este episodio sobre la autenticaci&oacute;n en Rails 3.1, que con sus novedades hace que sea mucho m&aacute;s f&aacute;cil de implementar en nuestras aplicaciones.</p>
