<p>Este episodio es una continuaci&oacute;n <a href="http://es.asciicasts.com/episodes/231-las-rutas-paso-a-paso">del de la semana pasada</a> y en &eacute;l seguiremos examinando la implementaci&oacute;n del c&oacute;digo de rutas en Rails 3.  Al final del episodio anterior el fichero de rutas de nuestra aplicaci&oacute;n ten&iacute;a el siguiente aspecto:</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  match &#x27;products&#x27;, :to =&gt; ProductsController.action(&quot;index&quot;)
  match &#x27;products/recent&#x27;
end
</pre>

<p>En el episodio anterior estudiamos la implementaci&oacute;n del m&eacute;todo <code>match</code> y vimos lo que ocurre cuando se invoca <code>match</code> en el fichero de rutas.   En este episodio estudiaremos el resto de m&eacute;todos disponibles para su uso en el fichero de rutas.</p>

<p>Si miramos el c&oacute;digo fuente de Rails 3.0 veremos que la l&oacute;gica de las rutas est&aacute; en la carpeta <code>actionpack/lib/actiondispatch/routing</code> y de todos los archivos nos centraremos en el de la clase <code>Mapper</code> porque, como ya vimos en el episodio anterior, el bloque dentro del fichero de rutas se ejecuta en el &aacute;mbito de esta clase.  Esto quiere decir que cualquier m&eacute;todo que sea llamado en dicho bloque se ejecuta en una instancia de <code>Mapper</code> y por tanto en nuestros ficheros de rutas podemos invocar cualquier m&eacute;todo de dicha clase.</p>

<p>El c&oacute;digo de la clase <code>Mapper</code> puede resultar abrumador.  Son casi 1000 l&iacute;neas de c&oacute;digo complejo, pero la buena noticia es que se trata del fichero m&aacute;s grande de todo el sistema de rutas de Rails por lo que si somos capaces de entender el funcionamiento de esta clase habremos conseguido entender bastante bien c&oacute;mo funcionan las rutas en Rails.</p>

<p>Para ver el c&oacute;digo a vista de p&aacute;jaro lo colapsaremos con la funcionalidad de plegado de c&oacute;digo de TextMate.  Si pulsamos <code>Command-Option-0</code> el fichero se plegar&aacute; al m&aacute;ximo.  A continuaci&oacute;n expandiremos el m&oacute;dulo ra&iacute;z <code>ActionDispatch</code>, su subm&oacute;dulo <code>Routing</code> y por &uacute;ltimo la clase <code>Mapping</code> propiamente dicha.</p>


<div class="imageWrapper">
  <img src="/system/photos/474/original/E232I01.png" width="732" height="798" alt="Estrucutra de la clase Mapper."/>
</div>

<p>Los primeros dos elementos de la clase <code>Mapper</code> son las definiciones de clase de <code>Constraints</code> y <code>Mapping</code>.   Ya las vimos en el episodio anterior pero lo que merece la pena ver ahora es que estas clases est&aacute;n anidadas dentro de la clase <code>Mapper</code>.  &iquest;Por qu&eacute; anidar las clases de esta manera?  No hay nada m&aacute;gico aqu&iacute;: la clase <code>Constraints</code> est&aacute; totalmente desacoplada de la clase <code>Mapper</code>.  El motivo del anidamiento es porque as&iacute; los nombres delas clases <code>Constraints</code> y <code>Mapping</code> quedan definidos dentro del &aacute;mbito del espacio de nombres de <code>Mapper</code>.  En Ruby no hay ning&uacute;n tipo de herencia ni relaci&oacute;n entre las clases anidadas de esta forma.</p>

<p>Si bajamos hasta la clase tenemos dos m&eacute;todos, <code>self.normalize_path</code> y <code>self.normalize_name</code>, que son m&eacute;todos de utilidad que se invocan dentro de la clase.  Debajo hay un grupo de m&oacute;dulos:</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
module Base...

module HttpHelpers...

module Scoping...

module Resources...

module Shorthand...

include Base
include HttpHelpers
include Scoping
include Resources
include Shorthand
</pre>

<p>Estos cinco m&oacute;dulos est&aacute;n incluidos dentro de la clase <code>Mapper</code>.  Su c&oacute;digo est&aacute; en m&oacute;dulos simplemente para organizar mejor el c&oacute;digo de la clase.</p>

<h3>Base</h3>

<p>Ya vimos el primer m&oacute;dulo, <code>Base</code>, en el episodio anterior.  Contiene los m&eacute;todos <code>match</code> y <code>root</code> (que utiliza a <code>match</code>), as&iacute; como el m&eacute;todo <code>mount</code> que nos da una manera alternativa de mapear una aplicaci&oacute;n Rack sobre una URL.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
module Base
  def initialize(set) #:nodoc:

  def root(options = {})
    match &#x27;/&#x27;, options.reverse_merge(:as =&gt; :root)
  end

  def match(path, options=nil)...

  def mount(app, options = nil)...

  def default_url_options=(options)...
  alias_method :default_url_options, :default_url_options=
end
</pre>

<h3>HttpHelpers</h3>

<p>El siguiente m&oacute;dulo es <code>HttpHelpers</code>, que es donde se definen los m&eacute;todos  <code>get</code>, <code>post</code>, <code>put</code> y <code>delete</code>.  Estos m&eacute;todos se utilizan para mapear las rutas a ciertos tipos de petici&oacute;n.</p> 

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
module HttpHelpers
  def get(*args, &amp;block)
    map_method(:get, *args, &amp;block)
  end

  def post(*args, &amp;block)
    map_method(:post, *args, &amp;block)
  end

  def put(*args, &amp;block)
    map_method(:put, *args, &amp;block)
  end

  def delete(*args, &amp;block)
    map_method(:delete, *args, &amp;block)
  end

  def redirect(*args, &amp;block)...

  private
  def map_method(method, *args, &amp;block)
     options = args.extract_options!
     options[:via] = method
     args.push(options)
     match(*args, &amp;block)
     self
   end
end
</pre>

<p>Todos los m&eacute;todos invocan al m&eacute;todo privado <code>map_method</code>, que se encarga de establecer la opci&oacute;n <code>:via</code> de acuerdo al m&eacute;todo recibido como argumento y a continuaci&oacute;n invoca a <code>match</code>. N&oacute;tese que en el c&oacute;digo de rutas gran parte de los m&eacute;todos delegan sobre el m&eacute;todo <code>match</code> manipulando sus diferentes opciones.  Por tanto si queremos que una ruta s&oacute;lo responda a una petici&oacute;n GET podr&iacute;amos hacerlo de esta manera, con la opci&oacute;n <code>via</code>.</p>

<pre class="ruby">
match &#x27;products/recent&#x27;, :via =&gt; :get
</pre>

<p>En la pr&aacute;ctica har&iacute;amos esto utilizando la opci&oacute;n <code>get</code>, que crear&aacute; una ruta con dicha opci&oacute;n.</p>

<pre class="ruby">
get &#x27;products/recent&#x27;
</pre>

<p>Los m&eacute;todos <code>post</code>, <code>put</code> y <code>delete</code> funcionan de la misma manera que el m&eacute;todo <code>get</code> para los otros tipos de petici&oacute;n.  Sin embargo el m&eacute;todo <code>redirect</code> se distingue de los otros porque devuelve una aplicaci&oacute;n Rack, lo que es m&aacute;s interesante.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def redirect(*args, &amp;block)
  options = args.last.is_a?(Hash) ? args.pop : {}

  path      = args.shift || block
  path_proc = path.is_a?(Proc) ? path : proc { |params| path % params }
  status    = options[:status] || 301

  lambda do |env|
    req = Request.new(env)

    params = [req.symbolized_path_parameters]
    params &lt;&lt; req if path_proc.arity &gt; 1

    uri = URI.parse(path_proc.call(*params))
    uri.scheme ||= req.scheme
    uri.host   ||= req.host
    uri.port   ||= req.port unless req.standard_port?

    body = %(&lt;html&gt;&lt;body&gt;You are being &lt;a href=&quot;#{ERB::Util.h(uri.to_s)}&quot;&gt;redirected&lt;/a&gt;.&lt;/body&gt;&lt;/html&gt;)

    headers = {
      &#x27;Location&#x27; =&gt; uri.to_s,
      &#x27;Content-Type&#x27; =&gt; &#x27;text/html&#x27;,
      &#x27;Content-Length&#x27; =&gt; body.length.to_s
    }

    [ status, headers, [body] ]
  end
end
</pre>

<p>El m&eacute;todo construye la aplicaci&oacute;n Rack devuelta con un <em>array</em> formado por un valor de estado, algunas cabeceras y el cuerpo.  El c&oacute;digo de estado por defecto vale <code>301</code>, que har&aacute; que el navegador efect&uacute;e una redirecci&oacute;n <code>301 Moved Permanently</code>.  Podemos utilizar el m&eacute;todo <code>redirect</code> directamente en nuestro archivo de rutas si queremos que una URL redirija a otra.  En nuestra fichero de rutas ya existe una ruta que utiliza el par&aacute;metro <code>:to</code>, y dicho par&aacute;metro recibe una aplicaci&oacute;n Rack</p>

<pre class="ruby">
match &#x27;products&#x27;, :to =&gt; ProductsController.action(&quot;index&quot;)
</pre>

<p>Dado que la opci&oacute;n <code>redirect</code> devuelve una aplicaci&oacute;n Rack la podemos utilizar para redirigir a una nueva URL de esta forma:</p>

<pre class="ruby">
match &#x27;products&#x27;, :to =&gt; redirect(&quot;/items&quot;)
</pre>

<p>Esta funcionalidad resulta bastante &uacute;til cuando estamos cambiando las URLs de nuestra aplicaci&oacute;n pero queremos seguir soportando las URLs anteriores.  Se puede usar <code>redirect</code> para dirigir estas URLs antiguas a las nuevas.</p>

<h3>Abreviaturas</h3>

<p>Los siguientes m&oacute;dulos que aparecen son <code>Scoping</code> y <code>Resources</code>, que veremos en breve.  Pero de momento nos fijaremos en el m&oacute;dulo <code>Shorthand</code>.  Se trata de un m&oacute;dulo de inter&eacute;s porque enriquece al m&eacute;todo <code>match</code>, que ven&iacute;a definido en el m&oacute;dulo <code>Base</code>.  Este m&eacute;todo <code>match</code> soporta una sintaxis diferente para las opciones que puede recibir.  El m&eacute;todo abreviado es una forma alternativa de escribir la opci&oacute;n <code>:to</code> en una ruta, como hicimos en la ruta <code>redirect</code> que escribimos anteriormente.</p>

<pre class="ruby">
match &#x27;products&#x27;, :to =&gt; redirect(&#x27;/items&#x27;)
</pre>

<p>Se trata de algo habitual en los ficheros de ruta, y la sintaxis abreviada nos permite escribir la ruta con un <em>hash</em> sencillo construido a partir de la ruta y a d&oacute;nde deber&iacute;a apuntar.  Al igual que con la sintaxis de ruta completa podemos a&ntilde;adir par&aacute;metros al final de la ruta</p>

<pre class="ruby">
match &#x27;products&#x27; =&gt; redirect(&#x27;/items&#x27;)
</pre>

<p>El m&eacute;todo <code>match</code> de <code>Shorthand</code> establece el valor del p&aacute;r&aacute;metro <code>:to</code> si no ha sido establecido a&uacute;n.  A continuaci&oacute;n invoca a <code>super</code> pero... si <code>Mapper</code> no hereda de ninguna otra clase, &iquest;qu&eacute; se supone que tiene que hacer la llamada a <code>super</code> en este caso?</p>

<p class="ruby">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
module Shorthand
  def match(*args)
    if args.size == 1 &amp;&amp; args.last.is_a?(Hash)
      options  = args.pop
      path, to = options.find { |name, value| name.is_a?(String) }
      options.merge!(:to =&gt; to).delete(path)
      super(path, options)
    else
      super
    end
  end
end
</pre>

<p>Cuando en Ruby se usa el m&eacute;todo <code>super</code> de esta manera, el int&eacute;rprete buscar&aacute; un m&eacute;todo con el mismo nombre que haya sido definido en un m&oacute;dulo anterior.  El m&oacute;dulo <code>Shorthand</code> es el &uacute;ltimo que se define en la lista de m&oacute;dulos incluidos en <code>Mapper</code> por lo que Ruby buscar&aacute; un m&eacute;todo <code>match</code> definido en los m&oacute;dulos anteriores para delegar la llamada.  En este caso, invocar&aacute; a <code>match</code> en el m&oacute;dulo <code>Base</code>.</p>

<p>Esta t&eacute;cnica se utiliza con frecuencia en el c&oacute;digo fuente de Rails 3.  Las versiones anteriores de Rails utilizaban <code>alias_method_chain</code> para redefinir comportamientos espec&iacute;ficos pero ahora con Rails 3 se puede utilizar simplemente <code>super</code>.</p>

<h3>Recursos</h3>

<p>A continuaci&oacute;n veremos el m&oacute;dulo <code>Resources</code> Como ser&iacute;a de esperar este m&oacute;dulo contiene el m&eacute;todo <code>resources</code> y todos los m&eacute;todos asociados.  Este m&eacute;todo se usa en los ficheros de rutas para establecer rutas de tipo REST.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>

<pre class="ruby">
def resources(*resources, &amp;block)
  options = resources.extract_options!

  if apply_common_behavior_for(:resources, resources, options, &amp;block)
    return self
  end

  resource_scope(Resource.new(resources.pop, options)) do
    yield if block_given?

    collection_scope do
      get  :index if parent_resource.actions.include?(:index)
      post :create if parent_resource.actions.include?(:create)
    end

    new_scope do
      get :new
    end if parent_resource.actions.include?(:new)

    member_scope  do
      get    :edit if parent_resource.actions.include?(:edit)
      get    :show if parent_resource.actions.include?(:show)
      put    :update if parent_resource.actions.include?(:update)
      delete :destroy if parent_resource.actions.include?(:destroy)
    end
  end

  self
end
</pre>

<p>Se trata de un m&eacute;todo ciertamente complejo pero se puede enteder su funcionamiento a trav&eacute;s de su estructura general.  Hay un par de m&eacute;todos de colecci&oacute;n, <code>get :index</code> y <code>post :create</code>, hay un m&eacute;todo <code>get :new</code> y finalmente <code>get :edit</code>, <code>get :show</code>, <code>put :update</code> y por &uacute;ltimo <code>delete :destroy</code>.  Deber&iacute;an resultar familiares porque son las famosas siete acciones REST que se crean para un controlador cuando se invoca el m&eacute;todo <code>resources</code> en el fichero de rutas.</p>
	
<p>Obs&eacute;rvese la primera l&iacute;nea en el bloque <code>resource_scope</code> del m&eacute;todo.   Si se pasa un bloque a este m&eacute;todo lo primero que har&aacute; ser&aacute; un <code>yield</code> sobre dicho bloque antes de crear las acciones REST.  Esto nos permite crear nuestras propias acciones en el fichero de rutas.  Por ejemplo podr&iacute;amos a&ntilde;adir una nueva ruta de colecci&oacute;n que devuelva los productos con descuento.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  match &#x27;products&#x27;, :to =&gt; redirect(&#x27;/items&#x27;)
  get &#x27;products/recent&#x27;
  resources :products do
    collection do:
      get :discounted
    end
  end
end
</pre>

<p>El c&oacute;digo dentro del bloque que se pasa a <code>resources</code> ser&aacute; ejecutado por la llamada <code>yield</code> en <code>resource_scope</code>, tras lo cual se definen las siete rutas REST.</p>

<p>Si vemos los bloques del fichero de rutas de arriba podr&iacute;amos pensar que cada vez que creamos un nuevo bloque el objeto <code>Mapper</code> cambia pero no es este el caso por lo que llamar a <code>get</code> en el bloque de mayor anidamiento es lo mismo que hacerlo fuera.  Lo que se maneja es un &aacute;mbito diferente.</p>

<p>Si se le echa otro vistazo al m&eacute;todo  <code>resources</code> en el c&oacute;digo fuente de Rails veremos que hace una llamada a <code>collection_scope</code> cuando define las acciones <code>index</code> y <code>create</code> pero en nuestro fichero de rutas tan s&oacute;lo usamos <code>collection</code>.  &iquest;Cu&aacute;l es la diferencia?  No mucha.  Si miramos el m&eacute;todo <code>collection</code> de la clase <code>Mapper</code> veremos que delega en <code>collection_scope</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def collection
  unless @scope[:scope_level] == :resources
    raise ArgumentError, &quot;can&#x27;t use collection outside resources scope&quot;
  end

  collection_scope do
    yield
  end
end
</pre>

<p>Echemos otro vistazo a nuestro fichero de rutas.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  match &#x27;products&#x27;, :to =&gt; redirect(&#x27;/items&#x27;)
  get &#x27;products/recent&#x27;
  resources :products do
    collection do:
      get :discounted
    end
  end
end
</pre>

<p>Ambas llamadas invocan al mismo m&eacute;todo pero la que est&aacute; dentro del bloque <code>collection</code> asumir&aacute; un comportamiento adicional seg&uacute;n su &aacute;mbito dentro de los bloques <code>resources</code> y <code>collection</code>.</p>

<p>Si regresamos al m&oacute;dulo <code>Resources</code> nos encontraremos con viejo conocido, el m&eacute;todo <code>match</code>, en cuya redefinici&oacute;n se a&ntilde;ade el comportamiento adicional basado en recursos:</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def match(*args)
  options = args.extract_options!.dup
  options[:anchor] = true unless options.key?(:anchor)

  if args.length &gt; 1
    args.each { |path| match(path, options.dup) }
    return self
  end

  on = options.delete(:on)
  if VALID_ON_OPTIONS.include?(on)
    args.push(options)
    return send(on){ match(*args) }
  elsif on
    raise ArgumentError, &quot;Unknown scope #{on.inspect} given to :on&quot;
  end

  if @scope[:scope_level] == :resources
    args.push(options)
    return nested { match(*args) }
  elsif @scope[:scope_level] == :resource
    args.push(options)
    return member { match(*args) }
  end

  action = args.first
  path = path_for_action(action, options.delete(:path))

  if action.to_s =~ /^[\w\/]+$/
    options[:action] ||= action unless action.to_s.include?(&quot;/&quot;)
    options[:as] = name_for_action(action, options[:as])
  else
    options[:as] = name_for_action(options[:as])
  end

  super(path, options)
end
</pre>

<p>La l&iacute;nea que comprueba el &aacute;mbito actual para ver si es <code>resources</code> aparece m&aacute;s o menos a la mitad del bloque.  En tal caso, a&ntilde;ade un comportamiento diferente.  La l&oacute;gica es bastante compleja pero lo &uacute;nico que nos hace falta saber es que el m&oacute;dulo <code>Resources</code> redefine el m&eacute;todo <code>match</code>.  Obs&eacute;rvese que al final vuelve a invocar al m&eacute;todo <code>super</code> para invocar al m&eacute;todo <code>match</code> en <code>Base</code>.  Recordemos que <code>get</code> invoca a <code>match</code> y es aqu&iacute; donde se ubica la funcionalidad adicional para <code>get</code> y los otros m&eacute;todos que est&aacute;n definidos en <code>resources</code>.</p>

<h3>&Aacute;mbitos</h3>

<p>Ya hemos llegado al &uacute;ltimo m&eacute;todo de la clase <code>Mapping</code>: <code>Scoping</code>.  Siempre que hay un bloque dentro de nuestro archivo de rutas hay una llamada impl&iacute;cita al m&eacute;todo <code>scope</code> de <code>Scoping</code>. Esto quiere decir que definir&aacute; cierto comportamiento adicional para el c&oacute;digo que est&aacute; incluido dentro de ese bloque.</p>

<p>Junto al m&eacute;todo <code>scope</code> hay otros m&eacute;todos, que delegan todos sobre <code>scope</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def initialize(*args) #:nodoc:
  @scope = {}
  super
end

def controller(controller, options={})
  options[:controller] = controller
  scope(options) { yield }
end

def namespace(path, options = {})
  path = path.to_s
  options = { :path =&gt; path, :as =&gt; path, :module =&gt; path,
              :shallow_path =&gt; path, :shallow_prefix =&gt; 			path }.merge!(options)
  scope(options) { yield }
end

def constraints(constraints = {})
  scope(:constraints =&gt; constraints) { yield }
end

def defaults(defaults = {})
  scope(:defaults =&gt; defaults) { yield }
end
</pre>

<p>Todos estos m&eacute;todos son bastante sencillos y delegan sobre un m&eacute;todo m&aacute;s gen&eacute;rico estableciendo primero algunas opciones.  Por ejemplo <code>defaults</code> invoca a <code>scope</code> despu&eacute;s de establecer opciones por defecto, e igualmente <code>constraints</code> invoca a <code>scope</code> con ciertas opciones de restricci&oacute;n.  El m&eacute;todo <code>namespace</code> es un poco m&aacute;s complicado pero en esencia hace lo mismo.  El m&oacute;dulo tambi&eacute;n incorpora un m&eacute;todo <code>initialize</code> que s&oacute;lo crea una variable de instancia (<code>@scope</code>) y le asigna un <em>hash</em> vac&iacute;o.  Cabe preguntarse el motivo de un m&eacute;todo <code>initialize</code> en un m&oacute;dulo, ya que los m&oacute;dulos no se instancian. Esto es cierto, pero en este caso estamos redefiniendo el comportamiento de un m&eacute;todo.  Cuando el m&oacute;dulo <code>Scoping</code> se incluye en la clase <code>Mapper</code> este m&eacute;todo <code>initialize</code> reemplazar&aacute; al ya existente a&ntilde;adiendo la variable <code>@scope</code> y luego invocando a <code>super</code>.</p>

<p>Por &uacute;ltimo tenemos el m&eacute;todo <code>scope</code> propiamente dicho que es donde tiene lugar todo esto.  Se trata por tanto de un m&eacute;todo bastante complejo pero en esencia lo que hace es rellenar la variable <code>@scope</code> con la informaci&oacute;n del &aacute;mbito en el que se encuentra para que pueda ser usada dentro de cualquier invocaci&oacute;n a <code>match</code> que tengamos.</p>

<p>Con esto tenemos el funcionamiento b&aacute;sico de los bloques en el fichero de rutas.  Si definimos nuestras rutas as&iacute;:</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  controller :products do
    match #...
  end  
end
</pre>

<p>Cada vez que se llame a <code>match</code> en el bloque <code>controller</code> (y recordemos que delega a <code>scope</code>) la opci&oacute;n <code>controller</code> se propagar&aacute; autom&aacute;ticamente.</p>

<p>Eso es todo por este episodio.  Esperamos que sirva para tener una idea de lo que hacen los distintos m&eacute;todos disponbibles en el fichero de rutas.  Aunque hay muchos m&eacute;todos disponibles la mayor&iacute;a de ellos simplemente delegan en <code>match</code> o <code>scope</code> pas&aacute;ndoles ciertas opciones adicionales.</p>