<p>H&aacute; alguns meses, dois epis&oacute;dios falaram sobre a gem Formtastic [<a href="http://railscasts.com/episodes/184-formtastic-part-1">assistir</a>, <a href="http://asciicasts.com/episodes/184-formtastic-part-1">ler</a>]. Ela oferece uma maneira pr&aacute;tica de gerar o c&oacute;digo para exibir formul&aacute;rios em Rails. Nesse epis&oacute;dio vamos dar uma olhada em uma outra gem chamada <a href="http://github.com/plataformatec/simple_form">SimpleForm</a>. Assim como Formtastic, SimpleForm fornece uma maneira simples de gerar o c&oacute;digo dos formul&aacute;rios nas views, se comparado com a maneira padr&atilde;o do Rails. Se voc&ecirc; conhece o Formtastic, ent&atilde;o o SimpleForm vai parecer bem familiar, pois eles s&atilde;o realmente muito semelhantes.</p> 

<p>A grande pergunta aqui &eacute;: dado que as gems s&atilde;o similares, porque voc&ecirc; deveria escolher usar SimpleForm em vez de Formtastic? Um motivo &eacute; que o SimpleForm &eacute; mais leve. Ela &eacute; tamb&eacute;m mais customiz&aacute;vel e extens&iacute;vel que o Formtastic. Se voc&ecirc; usou o Formtastic e sente que ele se mete no seu caminho, ent&atilde;o &eacute; bom dar uma olhada no SimpleForm.</p>

<h3>Integrando SimpleForm em uma Aplica&ccedil;&atilde;o</h3>

<p>Para demonstrar o SimpleForm, vamos atualizar um formul&aacute;rio escrito usando o c&oacute;digo padr&atilde;o de views do Rails para usar o SimpleForm. A aplica&ccedil;&atilde;o &eacute; um simples com&eacute;rcio eletr&ocirc;nico com um n&uacute;mero de produtos, cada qual pertence a uma categora e o formul&aacute;rio que vamos modificar &eacute; o formul&aacute;rio de cria&ccedil;&atilde;o de um novo produto. Esse formul&aacute;rio tem diferentes tipos de campos e ser&aacute; um bom exemplo para usar o SimpleForm.</p>

<div class="imageWrapper">
  <img src="/system/photos/481/original/E234I01.png" width="800" height="570" alt="The New Product form."/>
</div>

<p>Para usar o SimpleForm, temos primeiro que adicionar a gem no <code>Gemfile</code> da aplica&ccedil;&atilde;o.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">
gem &quot;simple_form&quot;
</pre>

<p>E para termos certeza de que est&aacute; instalada, precisamos executar:</p>
<pre class="terminal">
$ bundle install
</pre>

<p>Agora que a gem est&aacute; instalada, precisamos executar um <code>generator</code> que adicionar&aacute; uns poucos arquivos que o SimpleForm precisa dentro da nossa aplica&ccedil;&atilde;o.</p>

<pre class="terminal">
$ rails g simple_form:install
    <span class="passed">create</span>  config/initializers/simple_form.rb
    <span class="passed">create</span>  config/locales/simple_form.en.yml
    <span class="passed">create</span>  lib/templates/erb/scaffold/_form.html.erb
</pre>    

<p>Esses arquivos gerados s&atilde;o usados principalmente para customiza&ccedil;&atilde;o e iremos dar uma olhada neles rapidamente. Antes, vamos atualizar o c&oacute;digo do nosso formul&aacute;rio de cadastro de produtos que est&aacute; assim:</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= form_for @product do |f| %&gt;
  &lt;%= f.error_messages %&gt;
  &lt;p&gt;
    &lt;%= f.label :name %&gt;
    &lt;%= f.text_field :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :price %&gt;
    &lt;%= f.text_field :price %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :released_on %&gt;
    &lt;%= f.date_select :released_on %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :category_id %&gt;
    &lt;%= f.collection_select :category_id, Category.all, :id, :name %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :rating %&gt;
    &lt;%= f.select :rating, 1..5 %&gt;
  &lt;/p&gt;
  &lt;p&gt;
    &lt;%= f.label :discontinued %&gt;
    &lt;%= f.check_box :discontinued %&gt;
  &lt;/p&gt;
  &lt;p&gt;&lt;%= f.submit %&gt;&lt;/p&gt;
&lt;% end %&gt;
</pre>

<p>As duas principais mudan&ccedil;as que precisamos fazer s&atilde;o substituir o <code>form_for</code> pelo <code>simple_form_for</code> e substituir cada par de labels e inputs com um dos m&eacute;todos do SimpleForm.</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= simple_form_for @product do |f| %&gt;
  &lt;%= f.error_messages %&gt;
  &lt;%= f.input :name %&gt;
  &lt;%= f.input :price %&gt;
  &lt;%= f.input :released_on %&gt;
  &lt;%= f.association :category %&gt;
  &lt;%= f.input :rating %&gt;
  &lt;%= f.input :discontinued %&gt;
  &lt;%= f.button :submit %&gt;
&lt;% end %&gt;
</pre>

<p>Para a maior parte dos controles no formul&aacute;rio, podemos usar o m&eacute;todo<code>f.input</code>. Um campo onde precisamos usar algo diferente &eacute; o <code>category</code>. No formul&aacute;rio original, esse campo usava <code>collection_select</code> para renderizar um menu drop down contendo todas as categorias.</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= f.collection_select :category_id, Category.all, :id, :name %&gt;
</pre>

<p>Com o SimpleForm, podemos substituir por <code>f.association</code>, que faz a mesma coisa.</p>

<p>Podemos recarregar o formul&aacute;rio e ver como ele est&aacute; sendo renderizado pelo SimpleForm.</p>

<div class="imageWrapper">
  <img src="/system/photos/482/original/E234I02.png" width="800" height="490" alt="The form rendered with SimpleForm."/>
</div>

<p>O formul&aacute;rio parece um pouco diferente agora pois n&atilde;o tem mais o estilo que tinha anteriormente. Mas &eacute; f&aacute;cil alterar nosso css para adicionar alguns estilos e classes que o SimpleForm usa em seus formul&aacute;rios.</p>

<p class="codeFilePath">/public/stylesheets/application.css</p>
<pre class="css">
.simple_form label {
  float: left;
  width: 100px;
  text-align: right;
  margin: 2px 10px;
}

.simple_form div.input {
  margin-bottom: 10px;
}

.simple_form div.boolean, .simple_form input[type=&#x27;submit&#x27;] {
  margin-left: 120px;
}

.simple_form div.boolean label {
  float: none;
  margin: 0;
}
</pre>

<p>Quando voc&ecirc; usar o SimpleForm em sua pr&oacute;pria aplica&ccedil;&atilde;o, vai querer customizar o estilo de acordo com o design da sua aplica&ccedil;&atilde;o. O CSS acima vai te dar uma ideia de quais os nomes das classes usados nos elementos HTML que o SimpleForm gera. Com o estilo acima aplicado, nosso formul&aacute;rio parece um pouco melhor.</p>

<div class="imageWrapper">
  <img src="/system/photos/483/original/E234I03.png" width="800" height="469" alt="The form now has CSS added."/>
</div>

<h3>Personalizando Campos</h3>

<p>Para os campos que usamos <code>f.input</code>, o SimpleForm automaticamente detectou cada tipo de coluna, de modo que o campo &quot;Released on&quot; est&aacute; renderizado como data e &quot;Discontinued&quot; est&aacute; renderizado com um checkbox, pois ele representa uma coluna <code>boolean</code>. Sendo uma associa&ccedil;&atilde;o, o campo &quot;Category&quot; foi renderizado como um menu drop down com uma op&ccedil;&atilde;o em branco. Se voc&ecirc; quiser customizar esse campo, pode fazer isso adicionando algumas op&ccedil;&otilde;es. Por exemplo, podemos remover a op&ccedil;&atilde;o em branco do &quot;Category&quot; adicionando a op&ccedil;&atilde;o <code>:include_blank</code>.</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= f.association :category, :include_blank =&gt; false %&gt;
</pre>

<p>O formul&aacute;rio original tem uma lista drop down para o campo rating, mas isso agora foi substitu&iacute;do por um campo texto. Podemos restaurar esse drop down usando a op&ccedil;&atilde;o <code>:collection</code> passando um range pra ela.</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= f.input :rating, :collection =&gt; 1..5 %&gt;
</pre>

<p>Se queremos a lista renderizada como radio buttons, podemos usar a op&ccedil;&atilde;o <code>:as</code>.</p>

<p class="codeFilePath">/app/view/products/new.html.erb</p>
<pre class="ruby">
&lt;%= f.input :rating, :collection =&gt; 1..5, :as =&gt; :radio %&gt;
</pre>

<p>Quando recarregamos o formul&aacute;rio, vemos que a op&ccedil;&atilde;o em branco n&atilde;o existe mais no menu drop down e que o campo rating foi renderizado como radio buttons.</p>

<div class="imageWrapper">
  <img src="/system/photos/484/original/E234I04.png" width="800" height="423" alt="The rating field is now rendered as a series of radio buttons."/>
</div>

<p>Outra grande caracter&iacute;stica do SimpleForm &eacute; detectar automaticamente os campos obrigat&oacute;rios. Podemos demonstrar isso fazendo os campos <code>name</code> e <code>price</code> obrigat&oacute;rios no modelo <code>Product</code>.</p>

<p class="codeFilePath">/app/models/product.rb</p>
<pre class="ruby">
class Product &lt; ActiveRecord::Base
  attr_accessible :name, :price, :released_on, :category_id, 
  :rating, :discontinued
  belongs_to :category  
  validates_presence_of :name, :price
end
</pre>

<p>Isso &eacute; tudo que precisamos fazer. Quando recarregarmos o formul&aacute;rio, vamos ver esses campos marcados com aster&iacute;scos e se tentarmos submeter o formul&aacute;rio sem preencher esses campos, vamos ver uma mensagem de erro.</p>

<div class="imageWrapper">
  <img src="/system/photos/485/original/E234I05.png" width="800" height="586" alt="The form showing the required field errors."/>
</div>

<p>Podemos tamb&eacute;m adicionar um aviso para cada campo. Vamos supor que queremos informar que o pre&ccedil;o deve ser dado em libras esterlinas. S&oacute; precisamos adicionar uma op&ccedil;&atilde;o <code>:hint</code> a esse campo.</p>

<p class="codeFilePath">/apps/views/products/_form.html.erb</p>
<pre class="ruby">
&lt;%= f.input :price, :hint =&gt; &quot;prices should be in UKP.&quot; %&gt;
</pre>

<p>Isso adicionar&aacute; uma mensagem informativa depois do campo no formul&aacute;rio.</p>

<div class="imageWrapper">
  <img src="/system/photos/486/original/E234I06.png" width="800" height="442" alt="The Price field now has a hint."/>
</div>

<p>H&aacute; mais informa&ccedil;&otilde;es sobre as op&ccedil;&otilde;es que podem ser usadas no <a href="http://github.com/plataformatec/simple_form#readme">README</a> do SimpleForm. Vale a pena dar uma olhada no <a href="http://github.com/justinfrench/formtastic#readme">README do Formtastic</a> tamb&eacute;m, pois muitas op&ccedil;&otilde;es que ele usa tamb&eacute;m podem ser usadas pelo SimpleForm.</p>

<h3>Personalizando o SimpleForm</h3>

<p>Quando executamos o gerador do SimpleForm, ele criou tr&ecirc;s arquivos.</p>

<pre class="terminal">
$ rails g simple_form:install
    <span class="passed">create</span>  config/initializers/simple_form.rb
    <span class="passed">create</span>  config/locales/simple_form.en.yml
    <span class="passed">create</span>  lib/templates/erb/scaffold/_form.html.erb
</pre>

<p>Se quisermos customizar o SimpleForm em toda a aplica&ccedil;&atilde;o, podemos modificar esses arquivos. O primeiro cont&eacute;m algumas op&ccedil;&otilde;es comentadas e muitas configura&ccedil;&otilde;es podem ser feitas aqui. Por exemplo, podemos alterar a ordem que cada campo &eacute; renderizado; podemos alterar a tag html que envolve cada campo e podemos alterar o tamanho padr&atilde;o de cada campo de texto. Queremos campos de texto mais estreitos na nossa aplica&ccedil;&atilde;o, ent&atilde;o vamos alterar o valor padr&atilde;o de <code>50</code> para <code>30</code>.</p>

<p class="codeFilePath">/config/initializers/simple_form.rb</p>
<pre class="ruby">
# Use this setup block to configure all options available in SimpleForm.
SimpleForm.setup do |config|

  # Other options removed...

  # Default size for text inputs.
  config.default_input_size = 30
end
</pre>

<p>Outro arquivo que foi gerado, foi de idiomas e &eacute; onde podemos internacionalizar os formul&aacute;rios.</p>

<p class="codeFilePath">/config/locales/simple_form.en.yml</p>
<pre class="ruby">
en:
  simple_form:
    &quot;yes&quot;: &#x27;Yes&#x27;
    &quot;no&quot;: &#x27;No&#x27;
    required:
      text: &#x27;required&#x27;
      mark: &#x27;*&#x27;
      # You can uncomment the line below if you need to overwrite the whole required html.
      # When using html, text and mark won&#x27;t be used.
      # html: &#x27;<abbr title="required">*</abbr>&#x27;
    error_notification:
      default_message: &quot;Some errors were found, please take a look:&quot;
    # Labels and hints examples
    # labels:
    #   password: &#x27;Password&#x27;
    #   user:
    #     new:
    #       email: &#x27;E-mail para efetuar o sign in.&#x27;
    #     edit:
    #       email: &#x27;E-mail.&#x27;
    # hints:
    #   username: &#x27;User name to sign in.&#x27;
    #   password: &#x27;No special characters, please.&#x27;
</pre>

<p>Mesmo se a aplica&ccedil;&atilde;o n&atilde;o precisa mostrar m&uacute;ltiplos idiomas esse arquivo ainda &eacute; &uacute;til para alterar alguns textos do SimpleForm, como o texto que &eacute; apresentado nos campos obrigat&oacute;rios.</p>

<p>O &uacute;ltimo arquivo gerado sobrescreve o partial de formul&aacute;rios do gerador do scaffold.</p>

<p class="codeFilePath">/lib/templates/erb/scaffold/_form.html.erb</p>
<pre class="ruby">
&lt;%%= simple_form_for(@&lt;%= singular_name %&gt;) do |f| %&gt;
  &lt;%% if @&lt;%= singular_name %&gt;.errors.any? %&gt;
    &lt;div id=&quot;error_explanation&quot;&gt;
      &lt;h2&gt;&lt;%%= pluralize(@&lt;%= singular_name %&gt;.errors.count, &quot;error&quot;) %&gt; prohibited this &lt;%= singular_name %&gt; from being saved:&lt;/h2&gt;

      &lt;ul&gt;
      &lt;%% @&lt;%= singular_name %&gt;.errors.full_messages.each do |msg| %&gt;
        &lt;li&gt;&lt;%%= msg %&gt;&lt;/li&gt;
      &lt;%% end %&gt;
      &lt;/ul&gt;
    &lt;/div&gt;
  &lt;%% end %&gt;

  &lt;div class=&quot;inputs&quot;&gt;
  &lt;%- attributes.each do |attribute| -%&gt;
    &lt;%%= f.&lt;%= attribute.reference? ? :association : :input %&gt; :&lt;%= attribute.name %&gt; %&gt;
  &lt;%- end -%&gt;
  &lt;/div&gt;

  &lt;div class=&quot;actions&quot;&gt;
    &lt;%%= f.button :submit %&gt;
  &lt;/div&gt;
&lt;%% end %&gt;
</pre>

<p>No Rails 3, podemos sobrescrever qualquer arquivo template de um <code>generator</code> adicionando em nossa aplica&ccedil;&atilde;o. Ent&atilde;o se quisermos customizar o jeito que um generator funciona, para atender a nossa forma de trabalho, podemos simplesmente criar um novo arquivo template.</p>

<p>Por esse epis&oacute;dio &eacute; s&oacute;. O SimpleForm torna f&aacute;cil criar formul&aacute;rios em suas aplica&ccedil;&otilde;es Rails e vale muito a pena dar uma olhada nele.</p>