<h2>
  201:&nbsp;Bundler&nbsp;
  <span>
    <a href="http://railscasts.com/episodes/201-bundler">(view original Railscast)</a>
  </span>
</h2>

<p>In dieser Episode f&uuml;hren wir unsere Vorschau auf die neuen Features von Rails 3 fort. Dieses Mal werfen wir einen Blick auf <a href="http://github.com/carlhuda/bundler">Bundler</a>, die neue Art, Gem-Abh&auml;ngigkeiten von Rails-Applikationen zu verwalten.</p>

<p>Bundler wird momentan stetig weiterentwickelt, also geht man am Besten sicher, die aktuellste Version installiert zu haben, indem man</p>
    
<pre class="terminal">
gem install bundler
</pre>

<p>ausf&uuml;hrt. Hierbei bitte beachten, dass nicht <code>sudo</code> eingesetzt wird, da hier eine mit <code>rvm</code> installierte Version von Ruby verwendet wird.</p>

<h3>Wie man Bundler benutzt, um Gems zu installieren</h3>

<p>In der letzten Episode hatten wir das Problem, dass uns der <code>sqlite3-ruby</code> Gem gefehlt hatte. Wir haben dieses Problem von Hand gel&ouml;st, indem wir den Gem per <code>gem install</code> nachinstalliert haben.</p>

<pre class="terminal">
gem install sqlite3-ruby
</pre>

<p>Wir h&auml;tten Dies alternativ auch mit Bundler machen k&ouml;nnen, da in den Abh&auml;ngigkeiten unserer Applikation <code>sqlite3-ruby</code> aufgef&uuml;hrt ist, also im <code>Gemfile</code> unserer Applikation aufgelistet ist. Um die Abh&auml;ngigkeiten aufzul&ouml;sen, f&uuml;hren wir <code>bundle install</code> aus, was alle Eintr&auml;ge durchgeht und sie bei Bedarf nachinstalliert.</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
Installing abstract (1.0.0) from system gems 
Installing actionmailer (3.0.0.beta) from system gems 
Installing actionpack (3.0.0.beta) from system gems 
Installing activemodel (3.0.0.beta) from system gems 
Installing activerecord (3.0.0.beta) from system gems 
Installing activeresource (3.0.0.beta) from system gems 
Installing activesupport (3.0.0.beta) from system gems 
Installing arel (0.2.1) from rubygems repository at http://gemcutter.org 
Installing builder (2.1.2) from system gems 
Installing bundler (0.9.5) from system gems 
Installing erubis (2.6.5) from system gems 
Installing i18n (0.3.3) from system gems 
Installing mail (2.1.2) from system gems 
Installing memcache-client (1.7.8) from system gems 
Installing mime-types (1.16) from system gems 
Installing rack (1.1.0) from system gems 
Installing rack-mount (0.4.7) from rubygems repository at http://gemcutter.org 
Installing rack-test (0.5.3) from system gems 
Installing rails (3.0.0.beta) from system gems 
Installing railties (3.0.0.beta) from system gems 
Installing rake (0.8.7) from system gems 
Installing sqlite3-ruby (1.2.5) from system gems 
Installing text-format (1.0.0) from system gems 
Installing text-hyphen (1.0.0) from system gems 
Installing thor (0.13.1) from rubygems repository at http://gemcutter.org 
Installing tzinfo (0.3.16) from system gems 
Your bundle is complete!
</pre>

<p>Anhand der Ausgabe kann man erkennen, dass Bundler alle Gems, die von der Applikation ben&ouml;tigt werden, einschlie&szlig;lich <code>sqlite3-ruby</code> installiert hat. W&auml;re ein Gem noch nicht installiert gewesen, h&auml;tte Bundler ihn von Gemcutter heruntergeladen und nachinstalliert.</p>

<p>Im Zweifelsfall kann man also einfach immer <code>bundle install</code> ausf&uuml;hren, um alle Abh&auml;ngigkeiten aufl&ouml;sen zu lassen. Immer, wenn man eine neue Applikation erzeugt oder wenn man auf fremden Code zur&uuml;ckgreift, sollte man dieses Kommando laufen lassen, um sicherzugehen, dass man die richtigen Gems installiert hat. Auch beim Ausliefern einer Applikation sollte diese &Uuml;berpr&uuml;fung auf dem Produktivsystem stattfinden. Man kann das Kommando auch einfach zu seinen <code>deployment recipes</code> hinzuf&uuml;gen, damit es immer beim Ausliefern automatisch ausgef&uuml;hrt wird.</p>

<p>Es ist jedoch wichtig, zu beachten, dass man niemals <code>sudo</code> verwenden sollte, wenn man <code>bundle install</code> ausf&uuml;hrt, auch wenn es sonst man beim Installieren von Gems normalerweise tut.</p>

<h3>Gem-Abh&auml;ngigkeiten in einer Applikation registrieren</h3>

<p>Wie f&uuml;gen wir also solche Abh&auml;ngigkeiten zu unserer Applikation hinzu? In fr&uuml;heren Rails-Versionen wurden diese in der <code>/config/environment.rb</code>-Datei vermerkt, was sich mit Rails 3 jedoch ge&auml;ndert hat. Die ben&ouml;tigten Gems werden jetzt in einer <code>Gemfile</code> genannten Datei im Rootverzeichnis der Applikation notiert. Das <code>Gemfile</code> einer neuen Rails-Applikation sieht so aus:</p>

<pre class="ruby">
# Edit this Gemfile to bundle your application&#x27;s dependencies.
source &#x27;http://gemcutter.org&#x27;


gem &quot;rails&quot;, &quot;3.0.0.beta&quot;

## Bundle edge rails:
# gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;

# ActiveRecord requires a database adapter. By default,
# Rails has selected sqlite3.
gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;

## Bundle the gems you use:
# gem &quot;bj&quot;
# gem &quot;hpricot&quot;, &quot;0.6&quot;
# gem &quot;sqlite3-ruby&quot;, :require =&gt; &quot;sqlite3&quot;
# gem &quot;aws-s3&quot;, :require =&gt; &quot;aws/s3&quot;

## Bundle gems used only in certain environments:
# gem &quot;rspec&quot;, :group =&gt; :test
# group :test do
#   gem &quot;webrat&quot;
# end
</pre>

<p>Einige Gems sind in dieser Datei schon vermerkt, einschlie&szlig;lich <code>rails</code> und <code>sqlite3-ruby</code>. Besonders beachten sollte man die Versionsnummer in der Zeile, die auf den <code>rails</code> Gem verweist. Zu jeder Referenz in dieser Datei kann man eine bestimmte Version spezifizieren, um eine ganz bestimmte Version eines Gems verwenden zu lassen. Um zu einem bestimmten Zeitpunkt auf eine neue Rails-Version umzusteigen, muss man die Version einfach in dieser Datei vermerken, anstatt wie fr&uuml;her in der <code>environment.rb</code>.</p>

<p>Um zus&auml;tzliche Gems in unserer Applikation zu verwenden, muss man sie einfach nur in dieser Datei vermerken. Beispielsweise kann man <code>will_paginate</code> so einbinden:</p>

<pre class="ruby">
gem &quot;will_paginate&quot;, &quot;&gt;=2.3.12&quot;
</pre>

<p>Der zweite Parameter gibt an, dass die Version 2.3.12 oder neuer des Gems verwendet werden soll. Sobald dieser Verweis in dem <code>Gemfile</code> steht, kann man den Gem per <code>bundle install</code> automatisch installieren lassen, doch vorher kann man mithilfe von <code>bundle check</code> die Abh&auml;ngigkeiten pr&uuml;fen lassen:</p>

<pre class="terminal">
$ bundle check
The following dependencies are missing
  * will_paginate (&gt;= 2.3.12, runtime)We can install the missing gems by running bundle install again. 
</pre>

<p>Um eine Auflistung aller verf&uuml;gbaren Bundle Kommandos zu sehen, gibt man <code>bundle help</code> ein:</p>

<pre class="terminal">
$ bundle help
Tasks:
  bundle check        # Checks if the dependencies listed in Gemfile are satisfied by currently installed gems
  bundle exec         # Run the command in context of the bundle
  bundle help [TASK]  # Describe available tasks or one specific task
  bundle init         # Generates a Gemfile into the current working directory
  bundle install      # Install the current environment to the system
  bundle lock         # Locks the bundle to the current set of dependencies, including all child dependencies.
  bundle pack         # Packs all the gems to vendor/cache
  bundle show         # Shows all gems that are part of the bundle.
  bundle unlock       # Unlock the bundle. This allows gem versions to be changed
</pre>

<h3>Andere M&ouml;glichkeiten des Gemfiles</h3>

<p>Betrachten wir weiterhin das <code>Gemfile</code> und was wir noch damit machen k&ouml;nnen. Ein sehr n&uuml;tzliches neues Feature ist die M&ouml;glichkeit, Gems direkt aus einem <code>git</code> repository zu bekommen. Um beispielsweise immer auf dem aktuellsten Stand der Entwicklung zu sein, kann man den <code>rails</code> Gem auf das zentrale Entwicklungs-repository verweisen lassen:</p>

<pre class="ruby">
# Bundle edge rails:
gem &quot;rails&quot;, :git =&gt; &quot;git://github.com/rails/rails.git&quot;
</pre>

<p>Dieses Feature er&ouml;ffnet m&auml;chtige neue M&ouml;glichkeiten! Wenn ein Gem nicht ganz so funktioniert, wie wir uns vorstellen, k&ouml;nnen wir das Projekt auf github forken, den Code nach eigenem Ermessen ver&auml;ndern und die Gem-Abh&auml;ngigkeit auf unser github repository verweisen lassen.</p>

<p>Man kann Gems allerdings auch auf eine bestimmte Umgebung beschr&auml;nken. Um <code>RSpec</code> f&uuml;r Testzwecke zu laden, kann man Folgendes notieren:</p>

<pre class="ruby">
gem &quot;rspec&quot;, :group =&gt; :test
</pre>

<p>Wenn man gleich mehrere Gems in einer bestimmten Umgebung laden m&ouml;chte, kann man <code>group</code> auch einen Block &uuml;bergeben:</p>

<pre class="ruby">
group :test do
  gem &quot;webrat&quot;
  get &quot;rspec&quot;
end
</pre>

<p>L&auml;sst man <code>bundle install</code> jetzt laufen, werden alle Gems f&uuml;r alle Umgebungen installiert:</p>

<pre class="terminal">
$ bundle install
Fetching source index from http://gemcutter.org
Resolving dependencies
...
Installing rspec (1.3.0) from rubygems repository at http://gemcutter.org 
...
Installing webrat (0.7.0) from rubygems repository at http://gemcutter.org 
Installing will_paginate (2.3.12) from system gems 
Your bundle is complete!
</pre>

<p>Wie man der (verk&uuml;rzten) Ausgabe entnehmen kann, wurden die Gems aus unserem <code>Gemfile</code> installiert.</p>

<p>Wenn man Gems aus einer bestimmten Umgebung nicht installieren will, verwendet man die Option<code>--without</code>. Um also alle Gems ohne die aus der <code>test</code>-Umgebung zu installieren, f&uuml;hrt man Folgendes aus:</p>

<pre class="terminal">
bundle install --without=test
</pre>

<p>Dies ist besonders hilfreich, wenn man seine Applikation auf dem Produktivsystem installieren will, ohne die ganzen Gems, die f&uuml;rs Testen ben&ouml;tigt werden, mitzuinstallieren.</p>

<h3>Gems sperren</h3>

<p>Ein weiteres sehr n&uuml;tzliches Kommando ist <code>bundle lock</code>. Es sperrt die exakten Versionen der Gems, die unsere Applikation nutzt. Nachdem dieses Kommando ausgef&uuml;hrt wurde, existiert eine neue Datei mit dem Namen <code>Gemfile.lock</code>. Diese Datei listet alle Gems zusammen mit ihrer jeweiligen Version auf, die f&uuml;r unsere Applikation installiert wurden. Nach der Ausf&uuml;hrung von <code>bundle lock</code> werden durch <code>bundle install</code> nur noch genau die Gems in den Versionen installiert, die im <code>Gemfile.lock</code> vermerkt sind, selbst wenn neuere Versionen verf&uuml;gbar sein sollten.</p>

<p>Wenn man mit anderen Rails-Entwicklern zusammen an einem Projekt arbeitet, kann man <code>bundle lock</code> verwenden, um sicherzugehen, dass Jeder die gleichen Versionen aller ben&ouml;tigten Gems verwendet. Das Gleiche gilt beim Deployment einer Applikation auf das Produktivsystem. Falls eine Applikation auf einen anderen Server umziehen muss, will man sichergehen, dass exakt die gleichen Voraussetzungen vorherrschen wie auf unserem Entwicklungssystem.</p>

<p>Muss man zu einem sp&auml;teren Zeitpunkt &Auml;nderungen an den Abh&auml;ngigkeiten vornehmen, sollte man allerdings nicht einfach das <code>Gemfile.lock</code> ver&auml;ndern. Stattdessen bringt man das <code>Gemfile</code> auf den gew&uuml;nschten Stand und f&uuml;hrt das <code>bundle install</code>-Kommando mit der zus&auml;tzlichen Option <code>--relock</code> aus:</p>

<pre class="terminal">
bundle install --relock
</pre>

<p>Dadurch werden die Gems entsperrt, auf die gew&uuml;nschte Version gebracht und wieder gesperrt.</p>

<h3>Gems in der Applikation installieren</h3>

<p>Das letzte zu betrachtende Feature ist <code>bundle pack</code>. Normalerweise installiert Bundler alle Gems im <code>.bundle</code>-Verzeichnis im Hauptverzeichnis des aktuellen Benutzers:</p>

<pre class="terminal">
$ ls ~/.bundle
cache		doc		gems		ruby		specifications
</pre>

<p>Daraus folgt nat&uuml;rlich, dass die Gems nicht im Verzeichnis der jeweiligen Applikation liegen und damit auch nicht im verwendeten Versionskontrollsystem landen. M&ouml;chten wir allerdings die Gems mit unserer Anwendung ausliefern, k&ouml;nnen wir <code>bundle pack</code> verwenden:</p>

<pre class="terminal">
bundle pack
Copying .gem files into vendor/cache
  * memcache-client-1.7.8.gem
  * rspec-1.3.0.gem
  * thor-0.13.3.gem
  * tzinfo-0.3.16.gem
  * builder-2.1.2.gem
  * nokogiri-1.4.1.gem
  * mime-types-1.16.gem
  * sqlite3-ruby-1.2.5.gem
  * i18n-0.3.3.gem
  * abstract-1.0.0.gem
  * erubis-2.6.5.gem
  * text-hyphen-1.0.0.gem
  * bundler-0.9.6.gem
  * rake-0.8.7.gem
  * will_paginate-2.3.12.gem
  * text-format-1.0.0.gem
  * rack-1.1.0.gem
  * rack-test-0.5.3.gem
  * webrat-0.7.0.gem
  * rack-mount-0.4.7.gem
  * activesupport-3.0.0.beta.gem
  * mail-2.1.2.gem
  * arel-0.2.1.gem
  * activemodel-3.0.0.beta.gem
  * actionpack-3.0.0.beta.gem
  * actionmailer-3.0.0.beta.gem
  * activerecord-3.0.0.beta.gem
  * activeresource-3.0.0.beta.gem
  * railties-3.0.0.beta.gem
  * rails-3.0.0.beta.gem
</pre>

<p>Damit werden die <code>.gem</code>-Dateien, die unsere Applikation verwendet, ins Verzeichnis <code>/vendor/cache</code> der Applikation kopiert (wobei das Verzeichnis bei Bedarf erzeugt wird, wenn es noch nicht existiert). Alle so gespeicherten Gems werden danach aus diesen <code>.gem</code>-Dateien installiert, anstatt sie beispielsweise von Gemcutter zu laden. Normalerweise sollte man dieses Feature nicht all zu oft ben&ouml;tigen, doch wenn man in die Situation kommt, dass das Produktivsystem keine M&ouml;glichkeit hat, Gems von Gemcuttoer oder anderen Quellen herunterzuladen, leistet einem <code>bundle pack</code> gute Dienste.</p>

<p>Damit beenden wir die aktuelle Episode. Wir hoffen, sie hat Ihnen einen guten &Uuml;berblick vermittelt, wie man Bundler einsetzen kann, um Gems und Abh&auml;ngigkeiten zu verwalten. Nach einer kurzen Einarbeitungszeit kann Bundler die Probleme, die oft mit diesen Abh&auml;ngigkeiten bestanden haben, endg&uuml;ltig zur Vergangenheit geh&ouml;ren lassen.</p>

<p>Zu guter letzt m&ouml;chten wir Sie noch auf <a href="http://railsplugins.org/">railsplugins.org</a> hinweisen, falls Sie sich gefragt haben, welche Gems und Plugins mit Rails 3 funktionieren. Auf dieser Seite k&ouml;nnen Sie Plugins und Gems durchsuchen, ob sie mit Rails 3 und Ruby 1.9 funktionieren.</p>

<div class="imageWrapper">
  <img src="/system/photos/328/original/E201I01.png" width="767" height="634" alt="The RailsPlugins website." />
</div>

<p>Falls ein Gem als "not working" aufgelistet ist, ist dies eine grossartige M&ouml;glichkeit, einfach mitzuarbeiten! Auf diese Weise k&ouml;nnen Sie mithelfen, so viele Gems und Plugins wie m&ouml;glich f&uuml;r Rails 3 zu portieren.</p>