<p>Uno dei maggiori cambiamenti con il nuovo Rails 3.1 &egrave; il supporto per <a href="http://sass-lang.com/">SASS</a>, il quale rappresenta la soluzione di default per generare CSS. Grazie a concetti come annidamento, variabili e molto altro ancora, gestire lo stile della vostra applicazione diventa molto pi&ugrave; semplice. Per dimostrare i vantaggi che comporta usare SASS, in questo episodio mostreremo come tradurre il CSS di una applicazione esistente in SASS.</p>

<p>Il sito su cui lavoreremo si presenta cos&igrave;:</p>

<div class="imageWrapper">
  <img src="/system/photos/665/original/E268I01.png" width="801" height="381" alt="La nostra applicazione."/>
</div>

<p>Tutto lo stile &egrave; realizzato utilizzando CSS, il nostro obiettivo &egrave; mantenere lo stesso stile una volta finita la migrazione. Questo &egrave; il file su cui lavoreremo:</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css</p>
<pre class="css">body {
  margin: 0;
  padding: 0;
  background-color: #FFF;
  font-family: verdana;
  font-size: 14px;
}

#header {
  background-color: #03507B;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px #00395A;
}

#header h1 {
  font-size: 30px;
}

a {
  color: #03507B;
  text-decoration: none;
}

a:hover {
  text-decoration: underline;
}

.new_project {
  background-color: #03507B;
  color: #FFF;
  padding: 5px 12px;
  margin: 10px 0;
  font-size: 16px;
  border-radius: 5px;
  -moz-border-radius: 5px;
  -webkit-border-radius: 5px;
}
#container { 
  margin: 0 100px; 
}

.project {
  border: solid 1px #777;
  margin: 20px 0;
  padding: 7px 12px;
  border-radius: 10px;
  -moz-border-radius: 10px;
  -webkit-border-radius: 10px;
}

.project h2 { 
  margin: 0; 
}</pre>

<p>Questo file &egrave; abbastanza semplice quindi il nostro compito non dovrebbe essere molto difficile.Per prima cosa bisogna rinominare il file aggiungendo l'estensione <code>.scss</code>. Standard CSS &egrave; completamente compatibile con SASS quindi ricaricando il browser tutto dovrebbe essere rimasto invariato.</p>

<p>Il nostro sito usa gi&agrave; SASS, ma ovviamente non &egrave; tutto qui. &Egrave; comunque ottimo il fatto che CSS &egrave; completamente supportato poich&egrave; questo ci permette di scegliere solo le funzionalit&agrave; che ci interessano. Se abbiamo un sito con un gran numero di CSS gi&agrave; esistenti possiamo rinominarli e modificarli quando e come vogliamo. Ma considerando quello che vi stiamo per mostrare probabilmente vorrette usare tutto immediatemente.</p>

<h3>Annidamento</h3>

<p>La prima funzionalit&agrave; che useremo &egrave; annidiamento. Guarda questo codice CSS:</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">#header {
  background-color: #03507B;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px #00395A;
}

#header h1 { 
  font-size: 30px; 
}</pre>

<p>Questo codice definisce lo stile per un element con <code>id</code> uguale a header e per ogni elemento <code>h1</code> in esso contenuto. Con SASS possiamo annidare lo stile per <code>h1</code> dentro quello per <code>#header</code> cos&igrave;:</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">#header {
  background-color: #03507B;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px #00395A;

	h1 { 
		font-size: 30px; 
	}
}</pre>

<p>Quindi non abbiamo pi&ugrave; bisogno di specificare il prefisso per elementi interni e siamo anche incoraggiati a mantenere compatto lo stile per elementi annidati. Pu&ograve; risultare semplice abusare di questa funzionalit&agrave; introducento annidamenti lunghi e complessi ma &egrave; meglio invece mantenere il nostro annidamento semplice. In questa maniera baster&agrave; un'occhiata per capire cosa &egrave; dentro cosa. Questa non &egrave; comunque una regola e puoi trovare e usare il livello di annidamento che si adatta meglio ai tuoi gusti.</p>

<p>Possiamo anche usare annidimento auto-referenziale. Nel CSS abbiamo un selector per <code>a</code> ed uno per <code>a:hover</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">a {
  color: #03507B;
  text-decoration: none;
}

a:hover { 
  text-decoration: underline;
}</pre>

<p>Poich&egrave; <code>a:hover</code> non &egrave; un vero e proprio elemento annidato dobbiamo aggiungere una &amp; al padre.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">a {
  color: #03507B;
  text-decoration: none;

  &amp;:hover { 
   text-decoration: underline;
  }
}</pre>

<p>La &amp; &egrave; necessaria perch&egrave; stiamo applicando stile a un attributo e non ad un vero e proprio elemento.</p>

<h3>Variabili</h3>

<p>Un' altra funzionalit&agrave; veramente utile &egrave; data dalla possibilit&agrave; di definire variabili. Nel nostro file CSS usiamo lo stesso colore in posti diversi. Se volessimo cambiarlo dovremmo modificare tutte le sue occorrenze.</p> 

<p>SASS rende questo facile permettendoci di definire variabili. Il nome di una variabile deve cominciare con il simbolo dollaro. Definiremo quindi la nostra variabile cos&igrave;:</p>

<pre class="css">$main-color: #03507B;</pre>

<p>Possiamo adesso sostituire tutte le occorrenze del colore con la variabile:</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">$main-color: #03507B;

#header {
  background-color: $main-color;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px #00395A;

	h1 { 
		font-size: 30px; 
	}
}

a {
  color: $main-color;
  text-decoration: none;

  &amp;:hover { 
   text-decoration: underline;
  }
}</pre>

<p> Se ricarichiamo la nostra pagina tutto &egrave; rimasto lo stesso. Se adesso volessimo cambiare il colore, basta modificare il valore della variabile per passare da blu a verde.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">$main-color: #1E7B12;</pre>

<p>Quando ricarichiamo la pagina tutti gli stili che usano quel colore sono adesso cambiati: lo sfondo dell'header, i link ed il bottone &ldquo;New Project&rdquo; sono adesso verdi.Tutto questo &egrave; stato possibile con un singolo cambiamento nel foglio di stile.</p>

<div class="imageWrapper">
  <img src="/system/photos/666/original/E268I02.png" width="801" height="381" alt="Abbiamo sostituito il blu con il verde."/>
</div>

<p>Il bordo in basso all'header &egrave; ancora blu scuro ma vogliamo che abbia una tonalit&agrave; pi&ugrave; scura dell'header stesso. SASS ci permette di definire colori relativi usando delle funzioni. Sul sito di SASS possiamo trovare la <a href="http://sass-lang.com/docs/yardoc/Sass/Script/Functions.html">completa lista delle funzioni disponibili</a>, la quale include <a href="http://sass-lang.com/docs/yardoc/Sass/Script/Functions.html#darken-instance_method">una funzione darken</a> che fa esattamente quello di cui abbiamo bisogno. Passando un colore e una percentuale come parametri otterremo un colore pi&ugrave; scuro come risultato.</p>

<p>Il colore del bordo in basso &egrave; definito nella dichiarazione per <code>#header</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">#header {
  background-color: $main-color;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px #00395A;

	h1 { 
		font-size: 30px; 
	}
}</pre>

<p>Possiamo sostituirlo con una chiamata a <code>darken</code> in maniera tale che il bordo abbia lo stesso colore dell'header ma pi&ugrave; scuro del 10%.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">#header {
  background-color: $main-color;
  color: #FFF;
  padding: 4px 100px;
  border-bottom: solid 5px darken($main-color, 10%);

	h1 { 
		font-size: 30px; 
	}
}</pre>

<p>Ricaricando la pagina il colore del bordo &egrave; adesso un verde scuro.</p>

<div class="imageWrapper">
  <img src="/system/photos/667/original/E268I03.png" width="801" height="381" alt="Adesso anche il colore del bordo &egrave; cambiato."/>
</div>

<h3>Mix-ins</h3>

<p>Mix-ins sono un'altra feature di SASS che ci aiuta a ridurre la duplicazione. Nel nostro CCS ci sono due elementi che hanno il bordo arrotondato. Poiche' ogni vendor ha delle specifiche diverse, risulta essere pi&ugrave; difficile del previsto ottenere dei bordi arrotondati che funzionino su tutti i browser.</p>

<pre class="css">border-radius: 5px;
-moz-border-radius: 5px;
-webkit-border-radius: 5px;
</pre>

<p>Spostando questo codice in un mix-in, risulter&agrave; molto pi&ugrave; semplice aggiungere la dichiarazione per dei bordi arrotondati. Un mix-in viene definito usando la parola chiave <code>@mixin</code> e il nome che verr&agrave; poi usato per referenziarlo.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">@mixin rounded-corners {
  border-radius: 5px;
  -moz-border-radius: 5px;
  -webkit-border-radius: 5px;
}</pre>

<p>Possiamo adesso applicare il bordo arrotondato ovunque vogliamo chiamando <code>@include</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">.new_project {
  background-color: $main-color;
  color: #FFF;
  padding: 5px 12px;
  margin: 10px 0;
  font-size: 16px;
  @include rounded-corners;
}</pre>

<p>Per ottenere un <code>border-radius</code> contenente un valore diverso potremmo definire un altro mix-in. Ma fortunatamente &egrave; anche possibile passare argomenti ai mix-ins in maniera tale da modificare il nostro rounded-corners mix-in nella seguente maniera:</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">@mixin rounded-corners($radius) {
  border-radius: $radius;
  -moz-border-radius: $radius;
  -webkit-border-radius: $radius;
}</pre>

<p>Possiamo adesso passare qualunque valore ogni volta che vogliamo avere un bordo arrotondato.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">.project {
  border: solid 1px #777;
  margin: 20px 0;
  padding: 7px 12px;
  @include rounded-corners(10px);
}</pre>

<p>Inoltre &egrave; anche possibile specificare un valore di default.</p>

<p class="codeFilePath">/app/assets/stylesheets/layout.css.sass</p>
<pre class="css">@mixin rounded-corners($radius: 5px) {
  border-radius: $radius;
  -moz-border-radius: $radius;
  -webkit-border-radius: $radius;
}</pre>

<h3>Utilizzare SASS in file differenti</h3>

<p>Anche usando SASS i nostri fogli di stile possono diventare lunghi e difficili da mantenere, adesso vedremo come &egrave; possibile organizzare il nostro stile separandolo in file differenti. Abbiamo gi&agrave; un file <code>projects.css.scss</code> nella nostra applicazione, il quale venne generato al momento della generazione dello scaffold per <code>Projects</code>. Questo file contiene al momento soltanto un commento, ma possiamo inserire del codice che sar&agrave; compilato e incluso da Rails 3.1 in un singolo file chiamato application.css.</p>

<p>Vogliamo quindi spostare qualunque codice SASS specifico per project dentro il file <code>projects.css.scss</code>. Facciamolo e vediamo cosa succede.</p>

<p class="codeFilePath">/app/assets/stylesheets/projects.css.scss</p>
<pre class="css">.new_project {
  background-color: $main-color;
  color: #FFF;
  padding: 5px 12px;
  margin: 10px 0;
  font-size: 16px;
  @include rounded-corners(5px);
}

.project {
  border: solid 1px #777;
  margin: 20px 0;
  padding: 7px 12px;
  @include rounded-corners(10px);
}

.project h2 { 
  margin: 0; 
}</pre>

<p>Ricaricando la pagina vedremo che adesso lo stile non &egrave; pi&ugrave; presente.</p>

<div class="imageWrapper">
  <img src="/system/photos/668/original/E268I04.png" width="801" height="381" alt="Lo stile non &egrave; pi&ugrave; presente."/>
</div>

<p>Per controllare se SASS ha lanciato un errore possiamo guardare il file di log o il foglio di stile nel browser.</p>

<div class="imageWrapper">
  <img src="/system/photos/669/original/E268I05.png" width="801" height="381" alt="Possiamo vedere l'errore nel foglio di stile."/>
</div>

<p>Vediamo che un errore di sintassi ha impedito la generazione del foglio di stile. In questo caso l'errore &egrave; dovuto ad una variabile non definita:</p>

<pre>Undefined variable: &quot;$main-color&quot;.</pre>

<p>Sembrerebbe che la variabile definita nel file principale non sia stata propagata negli file rimanenti.</p>

<p>Questo errore &egrave; dovuto al modo in cui Sprockets funziona in Rails 3.1. La variabili non vengono condivise fra i file SASS e possiamo vederne il perch&egrave; nel file <code>application.css</code>.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css</p>
<pre class="css">/*
 * This is a manifest file that&#x27;ll automatically include all the stylesheets available in this directory
 * and any sub-directories. You&#x27;re free to add application-wide styles to this file and they&#x27;ll appear at
 * the top of the compiled file, but it&#x27;s generally better to create a new file per style scope.
 *= require_self
 *= require_tree . 
*/</pre>

<p>La linea <code>require_tree .</code> dice a Sprockets di includere qualunque file che si trovi dentro la cartella <code>stylesheets</code>. Il problema &egrave; che ogni file SASS viene compilato separatamente in un singolo CSS e soltanto dopo questi files vengono combinati in uno unico, il che significa che le variabili non vengono condivise tra i files. Per risolvere questo problema dobbiamo rimuovere <code>require_tree .</code> ed usare SASS per importare ciascun file. Il vantaggio di questo approccio &egrave; che ci permette di definire l'ordine con cui i file vengono caricati. Questo non &egrave; possibile usando <code>require_tree</code>. Dobbiamo quindi rinominare <code>application.css</code> in <code>application.css.scss</code>, rimuovere <code>require_tree</code> ed importare i nostri stili.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css.scss</p>
<pre class="css">/*
 * This is a manifest file that&#x27;ll automatically include all the stylesheets available in this directory
 * and any sub-directories. You&#x27;re free to add application-wide styles to this file and they&#x27;ll appear at
 * the top of the compiled file, but it&#x27;s generally better to create a new file per style scope.
 *= require_self
*/
@import &quot;layout.css.scss&quot;;
@import &quot;projects.css.scss&quot;;</pre>

<p>Questo preserva tutte le nostre variabili, mix-ins e qualunque cosa abbiamo definito. Quando ricarichiamo la pagina il nostro stile funziona ora correttamente e la varibili definite nel foglio di layout sono disponibili per tutti gli altri.</p>

<h3>SCSS vs SASS</h3>

<p>Ti potresti chiedere perch&egrave; i file hanno una estensione <code>.scss</code> se il linguaggio si chiama SASS. Questo &egrave; perch&egrave; SASS supporta due sintassi differenti. SCSS &egrave; la nuova sintassi a partire da SASS 3 ma <a href="http://nex-3.com/posts/102-the-indented-sass-syntax-is-here-to-stay">quella vecchia &egrave; ancora disponibile</a> e continuer&agrave; ad essere supportata. Per utilizzarla il file di stile dovr&agrave; avere l'estensione <code>.sass</code>. La vecchia sintassi &egrave; simile a quella nuova ma non usa parentesi graffe o punti e virgola alla fine di ogni linea, il livello del blocco viene determinato in base al numero di spazi. La sintassi SCSS, essendo in super insieme di CSS, &egrave; pi&ugrave; facile da usare specialmente se bisogna migrare da fogli di stile esistenti.</p>

<h3>Fogli di stile condizionali</h3>

<p>Finiamo questo episodio con un piccolo suggerimento. Come possiamo cambiare i file che vengono inclusi in base all'attuale controller? Dato un file <code>projects.css.scss</code> potremmo che pensare che questo venga incluso solo per le azioni incluse in <code>ProjectsController</code>, ma non &egrave; cos&igrave;. Tutti i CSS vengono compilati in un singolo file che viene applicato a tutte le pagine dell'applicazione. In genere questo non &egrave; un problema se utilizziamo gli scope correttamente ma certe volte potrebbe non essere abbastanza.</p> 

<p>Una soluzione &egrave; quella di modificare il tag di apertura del body nel file di layout ed aggiungere un attributo <code>id</code> avente il nome dell'attuale controller come valore.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;body id=&quot;&lt;%= params[:controller].parameterize %&gt;_controller&quot;&gt;</pre>

<p>Chiamiamo <code>parameterize</code> sul nome del controller per rimuovere qualunque carattere speciale. Avendo adesso un unico <code>id</code> per ciascun controller, possiamo usare questo per introdurre degli scope nei nostri fogli di stile:</p>

<p class="codeFilePath">/app/assets/stylesheets/projects.css.scss</p>
<pre class="css">#projects_controller
{
  .new_project {
    background-color: $main-color;
    color: #FFF;
    padding: 5px 12px;
    margin: 10px 0;
    font-size: 16px;
    @include rounded-corners(5px);
  }

  .project {
    border: solid 1px #777;
    margin: 20px 0;
    padding: 7px 12px;
    @include rounded-corners(10px);
  }

  .project h2 { 
    margin: 0; 
  }
}</pre>

<p>Questi stili verranno adesso applicati solo alle azioni del <code>ProjectsController</code>. Questo significa minori possibilit&agrave; di avere conflitti tra <code>id</code> o <code>class</code> in controller diversi.</p>

<p>Questo &egrave; tutto per questo episodio su SASS. Non abbiamo parlato di tutto quello che SASS pu&ograve; fare, quindi suggeriamo di dare un'occhiata alla documentazione sul <a href="http://sass-lang.com/docs.html">sito ufficiale</a> per ottenere maggiori informazioni.</p>