<p>Ya ha salido por fin Rails 3.1.  Podemos leer un repaso de sus nuevas funcionalidades en las   <a href="http://guides.rubyonrails.org/3_1_release_notes.html">Notas de Lanzamiento en el sitio RailsGuides</a>, algunas de las cuales ya han sido estudiadas en <a href="http://railscasts.com/?tag_id=31">Railscasts</a> y <a href="http://es.asciicasts.com/tags/rails-31">aqu&iacute; mismo</a>. En este episodio nos centraremos en el proceso de actualizaci&oacute;n de una aplicaci&oacute;n Rails 3.0 a la versi&oacute;n 3.1, y a modo de ejemplo veremos c&oacute;mo se ha migrado el sitio Railscasts.</p>

<h3>Preparativos</h3>

<p>Antes de acometer la actualizaci&oacute;n a Rails 3.1 tenemos que dar algunos pasos previos.  Si el sitio no est&aacute; funcionando en la &uacute;ltima versi&oacute;n de Rails 3.0 (a d&iacute;a de hoy es la 3.0.10) tendremos que actualizarlo.  Esto lo podemos hacer escribiendo la versi&oacute;n en el Gemfile y luego ejecutando <code>bundle</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &quot;rails&quot;, &quot;3.0.10&quot;</pre>

<p>Lo siguiente que haremos es pasar la bater&iacute;a de tests de la aplicaci&oacute;n para comprobar que todos siguen pasando y que no aparecen mensajes de aviso de fin de soporte.  Si los hubiera tendremos que corregirlos antes de continuar.  En el caso del c&oacute;digo de Railscasts no hay estos problemas as&iacute; que continuaremos con la actualizaci&oacute;n.</p>

<h3>Actualizaci&oacute;n</h3>

<p>Ya estamos listos para empezar con la actualizaci&oacute;n, que haremos dentro de una nueva rama Git llamada <code>rails31</code>.</p>

<pre class="terminal">$ git checkout -b rails31</pre>

<p>La actualizaci&oacute;n a Rails 3.1 es muy sencilla, s&oacute;lo tenemos que ir al <code>Gemfile</code> de nuestra aplicaci&oacute;n y cambiar la versi&oacute;n a la &uacute;ltima versi&oacute;n de 3.1 (que ahora mismo es la <code>3.1.0.</code>).</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &quot;rails&quot;, &quot;3.1.0&quot;</pre>

<p>Ahora ya podemos ejecutar <code>bundle update</code> para instalar la nueva versi&oacute;n.  El pr&oacute;ximo cambio que tenemos que hacer es en el fichero de configuraci&oacute;n <code>development.rb</code> donde tenemos que quitar o comentar la siguiente l&iacute;nea:</p>

<p class="codeFilePath">/config/development.rb</p>
<pre class="ruby"># config.action_view.debug_rjs = true</pre>

<p>Si lanzamos ahora los tests veremos que siguen pasando.  Podemos incluso arrancar el servidor Rails y cargar la aplicaci&oacute;n en el navegador.</p>

<div class="imageWrapper">
  <img src="/system/photos/728/original/E282I01.png" width="802" height="567" alt="La aplicación funciona bajo Rails 3.1"/>
</div>

<h3>Cambios en la aplicaci&oacute;n para usar el conducto de est&aacute;ticos</h3>

<p>El conducto de est&aacute;ticos es una de las funcionalidades m&aacute;s importantes en Rails 3.1 pero por ahora nuestra aplicaci&oacute;n no lo tiene en cuenta y aloja sus im&aacute;genes en el directorio <code>/public</code>. Esta funcionalidad es totalmente opcional y no tiene ning&uacute;n efecto hasta que la activemos por lo que si no podemos o queremos usar el conducto de est&aacute;ticos no tenemos por qu&eacute; quedarnos sin migrar a Rails 3.1.</p>

<p>Si nos interesa usar el conducto de est&aacute;ticos debemos a&ntilde;adir las siguientes l&iacute;neas al <code>Gemfile</code> (son las que se generar&iacute;an autom&aacute;ticamente si empez&aacute;semos con una aplicaci&oacute;n Rails 3.1 desde cero).</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby"># Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem &#x27;sass-rails&#x27;, &quot; ~&gt; 3.1.0&quot;
  gem &#x27;coffee-rails&#x27;, &quot; ~&gt; 3.1.0&quot;
  gem &#x27;uglifier&#x27;
end

gem &#x27;jquery-rails&#x27;</pre>

<p>Este c&oacute;digo crea un grupo <code>assets</code> e instala varias gemas relacionadas con los est&aacute;ticos. Tambi&eacute;n incluye la gema <code>jquery-rails</code> para que podamos usar jQuery (los que prefieran usar Prototype pueden usar  <a href="https://github.com/rails/prototype-rails"><code>prototype-rails</code></a>). Tambi&eacute;n tenemos que modificar  <code>/config/application.rb</code>, quitando este c&oacute;digo:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># If you have a Gemfile, require the gems listed there, including any gems
# you&#x27;ve limited to :test, :development, or :production.
Bundler.require(:default, Rails.env) if defined?(Bundler)</pre>

<p>Y escribiendo este otro:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">if defined?(Bundler)
  # If you precompile assets before deploying to production, 
    use this line
  Bundler.require *Rails.groups(:assets =&gt; %w(development test))
  # If you want your assets lazily compiled in production, 
    use this line
  # Bundler.require(:default, :assets, Rails.env)
end</pre>

<p>El c&oacute;digo a&ntilde;ade el grupo <code>assets</code> a los grupos sobre los que Bundler har&aacute; un <code>require</code>.  Aqu&iacute; se efect&uacute;a tambi&eacute;n la activaci&oacute;n propiamente dicha del conducto de est&aacute;ticos, dentro de la clase <code>Application</code>:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># Enable the asset pipeline
config.assets.enabled = true

# Version of your assets, change this if you want to expire all your assets
config.assets.version = &#x27;1.0&#x27;</pre>

<p>Este c&oacute;digo activa el conducto de est&aacute;ticos y genera un n&uacute;mero de versi&oacute;n, que podremos cambiar para expirar los recursos est&aacute;ticos.</p>


<p>Debemos cambiar tambi&eacute;n los valores de configuraci&oacute;n en el fichero de configuraci&oacute;n de cada entorno.  Empecemos por <code>development.rb</code>.  Tenemos que hacer aqu&iacute; un par de cambios para permitir la depuraci&oacute;n:</p>

<p class="codeFilePath">/config/environments/development.rb</p>
<pre class="ruby">  # Do not compress assets
  config.assets.compress = false
  
  # Expands the lines which load the assets
  config.assets.debug = true</pre>

<p>El siguiente es  <code>production.rb</code>.</p>  

<p class="codeFilePath">/config/environments/production.rb</p>
<pre class="ruby"># Compress JavaScript and CSS
config.assets.compress = true
   
# Don&#x27;t fallback to assets pipeline
config.assets.compile = false
   
# Generate digests for assets URLs
config.assets.digest = true</pre>

<p>En producci&oacute;n nos interesa comprimir los est&aacute;ticos, pero como &eacute;stos ir&aacute;n precompilados pondremos <code>compile</code> a <code>false</code>.  Tambi&eacute;n estableceremos <code>digest</code> a <code>true</code> para que las URLs  <a href="http://guides.rubyonrails.org/asset_pipeline.html#what-is-fingerprinting-and-why-should-i-care">lleven su propia huella</a>.  Estas opciones se pueden configurar de forma diferente para adaptarse al funcionamiento de nuestra aplicaci&oacute;n en producci&oacute;n.</p>

<p>Por &uacute;ltimo modificaremos el entorno de pruebas.  Aqu&iacute; a&ntilde;adiremos opciones de forma que los recursos est&aacute;ticos se sirvan y guarden en cach&eacute;:</p>

<p class="codeFilePath">/config/environments/test.rb</p>
<pre class="ruby"># Configure static asset server for tests with Cache-Control for performance
config.serve_static_assets = true
config.static_cache_control = &quot;public, max-age=3600&quot;

# Allow pass debug_assets=true as a query parameter to load pages with unpackaged assets
config.assets.allow_debugging = true</pre> 

<p>Si utilizamos Git para llevar el control de versiones en nuestra aplicaci&oacute;n deber&iacute;amos modificar el fichero <code>.gitignore</code> y a&ntilde;adir el directorio <code>.sass-cache</code> al listado de elementos ignorados porque no nos interesar&aacute; guardar en Git la cach&eacute; de SASS.</p>


<p class="codeFilePath">/.gitignore</p>
<pre class="ruby">.sass-cache/</pre>

<h3>Cambio de sitio de los est&aacute;ticos</h3>

<p>Ahora que ya tenemos el conducto listo, debemos crear el directorio <code>app/assets</code> para mover all&iacute; los directorios <code>images</code>, <code>javascripts</code> y <code>stylesheets</code> que ten&iacute;amos en <code>/public</code>.</p>

<pre class="terminal">$ mkdir app/assets
$ mv public/images/ app/assets/
$ mv public/javascripts/ app/assets/
$ mv public/stylesheets/ app/assets/</pre>

<p>Algunos de estos archivos ya no hacen falta, como por ejemplo los ficheros <code>jquery.js</code>, <code>jquery.min.js</code> y <code>rails.js</code> del directorio <code>javascripts</code> que ahora vienen incluidos en la gema jQuery as&iacute; que los borraremos.  Tambi&eacute;n es un buen momento para decididr si queremos mover los <em>plugins</em> de jQuery a <code>lib/assets</code> o <code>vendor/assets</code>, como hicimos en el episodio 279  [<a href="http://railscasts.com/episodes/279-understanding-the-asset-pipeline">verlo</a>, <a href="http://es.asciicasts.com/episodes/279-el-conducto-de-estaticos">leerlo</a>].</p>

<p>A continuaci&oacute;n debemos crear los manifiestos.   La aplicaci&oacute;n ya tiene su <code>application.js</code> y <code>application.css</code> en los directorios necesarios, as&iacute; que no los tenemos que crear.  Empezaremos con el fichero CSS.  Para convertirlo en un manifiesto tenemos que a&ntilde;adir algunos comentarios en la parte superior para indicarle a  <a href="https://github.com/sstephenson/sprockets">Sprockets</a> los ficheros que debe incluir.  Nosotros le diremos que incluya el resto del fichero y el resto de archivos que residan en el directorio <code>stylesheets</code> y sus subdirectorios.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css</p>
<pre class="css">/*
*= require_self
*= require_tree .
*/

/* rest of file omitted */</pre>

<p>Podemos hacer lo mismo en el fichero <code>application.js</code>, pero para incluir jQuery tenemos que hacerlo de forma un poco diferente:</p>

<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">//= require jquery
//= require jquery_ujs
//= require_self
//= require_tree .

/* rest of file omitted */</pre>

<p>De nuevo haremos <code>require_self</code> porque el propio fichero contendr&aacute; su c&oacute;digo y tambi&eacute;n <code>require_tree</code> para incluir el resto de los ficheros del directorio.</p>

<p>Tambi&eacute;n tenemos que ir al fichero <em>layout</em> y cambiar las l&iacute;neas que incluyen las hojas de estilo y los ficheros de JavaScript de forma que s&oacute;lo hagan referencia al fichero relevante, porque los otros los incluir&aacute; el manifiesto.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= stylesheet_link_tag &quot;application&quot; %&gt;
&lt;%= javascript_include_tag &quot;application&quot;, &quot;http://cdn.sublimevideo.net/js/3s7oes9q.js&quot; %&gt;</pre>

<p>Nuestro JavaScript necesita incluir un fichero externo que no se encontrar&aacute; en el conducto de est&aacute;ticos por lo que debemos seguir incluy&eacute;ndolo en la primera l&iacute;nea.</p>

<p>Ya podemos probar la aplicaci&oacute;n en el navegador para ver si nuestros cambios funcionan, pero antes debemos ejecutar <code>bundle</code> para instalar todas las gemas necesarias.  Tras esto podemos arrancar el servidor.</p>

<pre class="terminal">$ rails s</pre>

<p>Funciona casi todo pero quedan algunas im&aacute;genes rotas, por ejemplo el logo en la parte superior.</p>

<div class="imageWrapper">
  <img src="/system/photos/729/original/E282I02.png" width="804" height="381" alt="El sitio funciona pero quedan imágenes rotas."/>
</div>

<p>El problema es que la URL de la imagen ha sido escrita a fuego en el fichero de <em>layout</em>.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;img src=&quot;/images/railscasts_logo.png&quot; width=&quot;423&quot; height=&quot;56&quot; alt=&quot;RailsCasts = Ruby on Rails Screencasts&quot;/&gt;</pre>

<p>Esto no funciona porque las im&aacute;genes de nuestra aplicaci&oacute;n ya no se alojan en <code>/public/images</code>.  La soluci&oacute;n m&aacute;s sencilla ser&iacute;a cambiar la URL por  <code>/assets/railscasts_logo.png</code> pero tendremos problemas en producci&oacute;n.  Si tenemos la opci&oacute;n <code>assets.digest</code> se a&ntilde;adir&aacute; una huella al final del nombre de forma que no nos bastar&aacute; con tener una referencia est&aacute;tica a este fichero.  Deber&iacute;amos siempre utilizar los m&eacute;todos <em>helper</em> para enlazar correctamente la imagen en desarrollo y producci&oacute;n:</p>
<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= image_tag(&quot;railscasts_logo.png&quot;, :size =&gt; &quot;423x56&quot;, :alt =&gt; &quot;RailsCasts - Ruby on Rails Screencasts&quot;) %&gt;</pre>

<p>Tenemos que buscar globalmente en nuestra aplicaci&oacute;n y cambiar todos los est&aacute;ticos que est&eacute;n referenciados a mano para pasar a usar los <em>helpers</em> de Rails como con la imagen anterior.  Si ahora recargamos la p&aacute;gina y vemos el logo esto querr&aacute; decir que el conducto de est&aacute;ticos funciona correctamente.</p>

<p>Con esto hemos terminado la actualizaci&oacute;n a Rails 3.1 de nuestra aplicaci&oacute;n.  Hay otras funcionalidades extra de las que nos podemos aprovechar y que se pueden consultar en el resto de episodios dedicados a Rails 3.1 por si nos fueran de utilidad en nuestras aplicaciones.</p>
