<p>Rails&nbsp;3.1 est enfin sorti. On trouve un bon aper&ccedil;u des nouvelles fonctionnalit&eacute;s dans les <a href="http://guides.rubyonrails.org/3_1_release_notes.html">Release Notes sur le site RailsGuides</a>. Certaines ont d&eacute;j&agrave; &eacute;t&eacute; abord&eacute;es sur <a href="http://railscasts.com/?tag_id=31">Railscasts</a> ainsi que sur <a href="http://asciicasts.com/tags/rails-31">Asciicasts</a>. Dans cet &eacute;pisode, nous allons nous concentrer sur la migration de Rails&nbsp;3.0 &agrave; Rails&nbsp;3.1 et nous utiliserons le site Railscasts pour la d&eacute;monstration.</p>

<h3>Pr&eacute;parer Le Site</h3>

<p>Avant de passer le site sous Rails&nbsp;3.1, nous allons avoir besoin d&#x27;effectuer quelques op&eacute;rations de pr&eacute;paration. Si le site n&#x27;utilise pas encore la derni&egrave;re version de Rails&nbsp;3.0 (<code>3.0.10</code> actuellement), nous allons devoir le mettre &agrave; jour. Nous pouvons le faire en changeant la version dans le Gemfile et en lan&ccedil;ant <code>bundle</code>.</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &quot;rails&quot;, &quot;3.0.10&quot;</pre>

<p>Nous allons ensuite lancer la suite de tests de l&#x27;application afin de s&#x27;assurer qu&#x27;elle passe toujours et que nous n&#x27;avons pas d&#x27;erreur de d&eacute;preciation. Si nous en rencontrons, nous devons les corriger avant de continuer. Le code de Railscasts passe, nous pouvons donc passer &agrave; la migration.</p>

<h3>Migration</h3>

<p>Nous sommes maintenant pr&ecirc;ts &agrave; migrer le site. Nous allons le faire dans un nouvelle branche Git que nous appellerons <code>rails31</code>.</p>

<pre class="terminal">$ git checkout -b rails31</pre>

<p>Migrer vers Rails&nbsp;3.1 est plut&ocirc;t simple. Nous avons juste besoin d&#x27;aller dans le Gemfile de notre application et de changer &agrave; nouveau la version de Rails pour mettre le num&eacute;ro de la derni&egrave;re (actuellement <code>3.1.0</code>).</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby">gem &quot;rails&quot;, &quot;3.1.0&quot;</pre>

<p>Nous pouvons maintenant lancer <code>bundle update</code> pour installer la nouvelle version. Le seul autre changement que nous devons op&eacute;rer a lieu dans le fichier de configuration <code>development.rb</code>. Nous devons supprimer ou commenter la ligne suivante.</p>

<p class="codeFilePath">/config/development.rb</p>
<pre class="ruby"># config.action_view.debug_rjs = true</pre>

<p>Si nous lan&ccedil;ons nos tests &agrave; nouveau, nous allons voir qu&#x27;ils passent toujours. Nous pouvons m&ecirc;me d&eacute;marrer le serveur Rails et tester dans notre navigateur.</p>

<div class="imageWrapper">
  <img src="/system/photos/728/original/E282I01.png" width="802" height="567" alt="Le site fonctionne avec Rails 3.1."/>
</div>

<h3>Modifier notre application pour qu&#x27;elle utilise l&#x27;Asset Pipeline</h3>

<p>L&#x27;asset pipeline est une des plus importantes fonctionnalit&eacute;s de Rails&nbsp;3.1. Toutefois, les images, CSS et JavaScripts de notre application se situent toujours dans le dossier <code>/public</code> de notre application, nous n&#x27;en tirons donc pas avantage. L&#x27;asset pipeline est totalement optionnel et n&#x27;est pas actif tant que nous ne le demandons pas. De cette mani&egrave;re, si nous ne sommes pas s&ucirc;rs de vouloir l&#x27;utiliser, cela ne nous emp&ecirc;che pas de migrer vers Rails&nbsp;3.1. &Eacute;tant donn&eacute; la facilit&eacute; de migration, il y a tr&egrave;s peu de raisons de ne pas sauter le pas.</p>

<p>Si nous voulons utiliser l&#x27;asset pipeline, nous devons l&#x27;activer. Pour ce faire, nous devons ajouter les lignes suivantes &agrave; notre <code>Gemfile</code> (extraites du <code>Gemfile</code> g&eacute;n&eacute;r&eacute; par Rails&nbsp;3.1).</p>

<p class="codeFilePath">/Gemfile</p>
<pre class="ruby"># Gems used only for assets and not required
# in production environments by default.
group :assets do
  gem &#x27;sass-rails&#x27;, &quot; ~&gt; 3.1.0&quot;
  gem &#x27;coffee-rails&#x27;, &quot; ~&gt; 3.1.0&quot;
  gem &#x27;uglifier&#x27;
end

gem &#x27;jquery-rails&#x27;</pre>

<p>Ce code cr&eacute;e un groupe <code>assets</code> et y place quelques gems relatives aux assets. On y trouve la gem <code>jquery-rails</code>, nous pourrons donc utiliser jQuery (si vous pr&eacute;f&eacute;rez Prototype, vous pouvez utiliser la gem <a href="https://github.com/rails/prototype-rails"><code>prototype-rails</code> gem</a>). Nous allons &eacute;galement devoir modifier le fichier <code>/config/application.rb</code> pour remplacer ce code&nbsp;:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># If you have a Gemfile, require the gems listed there, including any gems
# you&#x27;ve limited to :test, :development, or :production.
Bundler.require(:default, Rails.env) if defined?(Bundler)</pre>

<p>par celui-ci&nbsp;:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">if defined?(Bundler)
  # If you precompile assets before deploying to production, 
    use this line
  Bundler.require *Rails.groups(:assets =&gt; %w(development test))
  # If you want your assets lazily compiled in production, 
    use this line
  # Bundler.require(:default, :assets, Rails.env)
end</pre>

<p>Ce code ajoute le groupe <code>assets</code> aux groupes requis par <code>Bundler</code>. Nous allons de plus devoir activer l&#x27;asset pipeline dans ce fichier. Cela se fait en ajoutant les lignes suivantes dans la classe <code>Application</code>&nbsp;:</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby"># Enable the asset pipeline
config.assets.enabled = true

# Version of your assets, change this if you want to expire all your assets
config.assets.version = &#x27;1.0&#x27;</pre>

<p>Ce code active l&#x27;asset pipeline et lui donne un num&eacute;ro de version. Ce num&eacute;ro peut &ecirc;tre chang&eacute; pour expirer les assets.</p>

<p>Il nous faut &eacute;galement changer la configuration de chaque environnement. Nous allons commencer par <code>development.rb</code>. Nous avons deux changements &agrave; faire de fa&ccedil;on &agrave; ce que les assets ne soient pas compress&eacute;s et pour activer le debug des assets.</p>

<p class="codeFilePath">/config/environments/development.rb</p>
<pre class="ruby">  # Do not compress assets
  config.assets.compress = false
  
  # Expands the lines which load the assets
  config.assets.debug = true</pre>
  
<p>Passons &agrave; <code>production.rb</code>.</p>

<p class="codeFilePath">/config/environments/production.rb</p>
<pre class="ruby"># Compress JavaScript and CSS
config.assets.compress = true
   
# Don&#x27;t fallback to assets pipeline
config.assets.compile = false
   
# Generate digests for assets URLs
config.assets.digest = true</pre>

  <p>En mode production, nous voulons voir les assets compress&eacute;s mais nous mettons <code>compile</code> &agrave; <code>false</code> car nous ne voulons pas que l&#x27;asset pipeline soit appel&eacute; alors que nous allons pr&eacute;compiler les assets. Nous mettons <code>digest</code> &agrave; <code>true</code> de fa&ccedil;on &agrave; ce que les URLs des assets aient une <a href="http://guides.rubyonrails.org/asset_pipeline.html#what-is-fingerprinting-and-why-should-i-care">fingerprint</a>. Bien s&ucirc;r, nous pouvons configurer tout cela pour l&#x27;adapter aux besoins de notre application en production.</p>

<p>Enfin, nous allons modifier l&#x27;environnement de test. Ici nous pr&eacute;cisons que les fichiers statiques doivent &ecirc;tre servis et mis en cache. Nous activons &eacute;galement le debug des assets.</p>

<p class="codeFilePath">/config/environments/test.rb</p>
<pre class="ruby"># Configure static asset server for tests with Cache-Control for performance
config.serve_static_assets = true
config.static_cache_control = &quot;public, max-age=3600&quot;

# Allow pass debug_assets=true as a query parameter to load pages with unpackaged assets
config.assets.allow_debugging = true</pre> 

<p>Si nous utilisons Git pour contr&ocirc;ler les sources de notre application, nous pouvons &eacute;galement modifier le fichier <code>.gitignore</code> et ajouter le dossier <code>.sass-cache</code> &agrave; la liste des &eacute;l&eacute;ments ignor&eacute;s. Nous ne voulons pas le cache de SASS dans Git.</p>

<p class="codeFilePath">/.gitignore</p>
<pre class="ruby">.sass-cache/</pre>

<h3>D&eacute;placer les assets</h3>

<p>Maintenant que notre asset pipeline est configur&eacute;, il est temps de cr&eacute;er un dossier <code>/app/assets</code>. Nous pouvons ensuite d&eacute;placer les dossiers <code>images</code>, <code>javascripts</code> et <code>stylesheets</code> de <code>/public</code> vers <code>/app/assets</code>.</p>

<pre class="terminal">$ mkdir app/assets
$ mv public/images/ app/assets/
$ mv public/javascripts/ app/assets/
$ mv public/stylesheets/ app/assets/</pre>

<p>Certains fichiers que nous avons d&eacute;plac&eacute;s ne sont plus n&eacute;cessaires, ceux li&eacute;s &agrave; jQuery dans le dossier <code>javascripts</code> par exemple. Ils sont inclus dans la gem jQuery, nous pouvons donc supprimer les fichiers <code>jquery.js</code>, <code>jquery.min.js</code> et <code>rails.js</code>. Il est maintenant temps de d&eacute;cider de si nous devons placer certains fichiers, comme les plugins jQuery, dans <code>/lib/assets</code> ou <code>/vendor/assets</code>, tel que vu dans l&#x27;&eacute;pisode 279 [<a href="http://railscasts.com/episodes/279-understanding-the-asset-pipeline">regarder</a>, <a href="http://fr.asciicasts.com/episodes/279-understanding-the-asset-pipeline">lire</a>].</p>

<p>Nous devons ensuite cr&eacute;er les fichiers de manifest. Cette application contient d&eacute;j&agrave; les fichiers <code>application.js</code> et <code>application.css</code>, nous n&#x27;avons donc pas besoin de les cr&eacute;er. Nous allons commencer par le fichier CSS. Pour le transformer en manifest, nous devons ajouter, au d&eacute;but de celui-ci, quelques commentaires qui indiqueront &agrave; <a href="https://github.com/sstephenson/sprockets">Sprockets</a> quels fichiers inclure (la syntaxe de Sprockets est &eacute;galement vue dans l&#x27;&eacute;pisode 279). Nous allons dire &agrave; Sprockets d&#x27;inclure le reste du fichier ainsi que tout ceux pr&eacute;sents dans le dossier <code>stylesheets</code> et ses sous dossiers.</p>

<p class="codeFilePath">/app/assets/stylesheets/application.css</p>
<pre class="css">/*
*= require_self
*= require_tree .
*/

/* rest of file omitted */</pre>

<p>Nous pouvons faire la m&ecirc;me chose pour le fichier <code>application.js</code> mais ce sera l&eacute;g&egrave;rement diff&eacute;rent car nous voulons inclure jQuery.</p>

<p class="codeFilePath">/app/assets/javascripts/application.js</p>
<pre class="javascript">//= require jquery
//= require jquery_ujs
//= require_self
//= require_tree .

/* rest of file omitted */</pre>

<p>Pour rappel, nous ajoutons <code>require_self</code> ici car le reste du fichier contient du code et <code>require_tree</code> pour inclure les fichiers contenus dans le m&ecirc;me dossier.</p>

<p>Nous allons devoir aller dans le layout de l&#x27;application pour changer les lignes d&#x27;inclusion des fichiers CSS et JavaScript afin qu&#x27;elles r&eacute;f&eacute;rencent uniquement les fichiers n&eacute;cessaires, puisque les autres fichiers sont inclus via les manifests.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= stylesheet_link_tag &quot;application&quot; %&gt;
&lt;%= javascript_include_tag &quot;application&quot;, &quot;http://cdn.sublimevideo.net/js/3s7oes9q.js&quot; %&gt;</pre>

<p>Les fichiers JavaScript n&eacute;cessaires &agrave; l&#x27;application comprennent un fichier externe qui ne sera pas inclus par l&#x27;asset pipeline. Pour celui-ci, nous avons toujours besoin d&#x27;une inclusion explicite comme ci-dessus.</p>

<p>Il est maintenant temps de tester notre application dans le navigateur pour nous assurer que toutes nos modifications ont fonctionn&eacute;. Avant cela, nous allons lancer une nouvelle fois <code>bundle</code> pour installer les gems que nous avons ajout&eacute;es. Cela fait, nous pouvons lancer le serveur.</p>

<pre class="terminal">$ rails s</pre>

<p>En dehors de quelques images cass&eacute;es (le logo en haut de l&#x27;&eacute;cran par exemple), tout semble fonctionner.</p>

<div class="imageWrapper">
  <img src="/system/photos/729/original/E282I02.png" width="804" height="381" alt="Le site fonctionne toujours bien que quelques images soient cass&eacute;es."/>
</div>

<p>Le probl&egrave;me est que les URLs des images ont &eacute;t&eacute; hard-cod&eacute;e dans le fichier de layout.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;img src=&quot;/images/railscasts_logo.png&quot; width=&quot;423&quot; height=&quot;56&quot; alt=&quot;RailsCasts = Ruby on Rails Screencasts&quot;/&gt;</pre>
  
<p>Cela ne peut pas fonctionner puisque les images de notre application ne sont plus dans le dossier <code>/public/images</code>. La solution la plus simple pourrait &ecirc;tre de changer l&#x27;url de l&#x27;image de <code>/images/railscasts_logo.png</code> &agrave; <code>/assets/railscasts_logo.png</code> mais bien que cela marche en d&eacute;veloppement, ce ne sera pas le cas en production. Si l&#x27;option <code>assets.digest</code> est activ&eacute;e, un hash sera ajout&eacute; au nom de fichier, la r&eacute;f&eacute;rence statique vers celui-ci ne fonctionnera plus. Nous devons donc toujours utiliser le helper. Celui-ci va lier l&#x27;image correctement en d&eacute;veloppement comment en production.</p>

<p class="codeFilePath">/app/views/layouts/application.html.erb</p>
<pre class="ruby">&lt;%= image_tag(&quot;railscasts_logo.png&quot;, :size =&gt; &quot;423x56&quot;, :alt =&gt; &quot;RailsCasts - Ruby on Rails Screencasts&quot;) %&gt;</pre>

<p>Nous allons devoir chercher, dans notre application, toues les r&eacute;f&eacute;rences statiques et faire en sorte qu&#x27;elles utilisent le helper, comme ci-dessus. Si nous rechargeons la page, l&#x27;image apparait, nous indiquant que notre asset pipeline fonctionne correctement.</p>

<p>Nous avons termin&eacute; notre migration vers Rails&nbsp;3.1. Il y a d&#x27;autres fonctionnalit&eacute;s dont vous pouvez tirer avantage. Cela vaut la peine de jeter un &oelig;il sur les autres &eacute;pisodes autour de Rails&nbsp;3.1 pour voir ce qui pourra vous &ecirc;tre utile.</p>
