<p>En este episodio aprenderamos a hacer que una tabla se pueda ordenar haciendo clic en cualquiera de sus columnas.  A continuaci&oacute;n se muestra una p&aacute;gina de una aplicaci&oacute;n de tienda que muestra un listado de productos en su tabla.  Queremos que se puedan ordenar los &iacute;tems de la tabla haciendo clic en la cabecera.  Tal vez no nos parezca una idea muy interesante porque en nuestro ejemplo s&oacute;lo tenemos un pu&ntilde;ado de productos pero si nuestra tabla paginada tuviese cientos de elementos seguro que resultar&iacute;a bastante m&aacute;s &uacute;til.</p>

<div class="imageWrapper">
  <img src="/system/photos/449/original/E228I01.png" width="800" height="526" alt="Tabla de productos."/>
</div>

<p>Hay bastantes <em>plugins</em> que podemos usar, tales como Searchlogic, que vimos en el episodio 176 [<a href="http://railscasts.com/episodes/176-searchlogic">verlo</a>, <a href="http://asciicasts.com/episodes/176-searchlogic">leerlo</a>], pero en esta ocasi&oacute;n empezaremos de cero y no vamos a usar ning&uacute;n otro <em>plugin</em>.</p>

<h3>Creaci&oacute;n de los enlaces</h3>

<p>Empezaremos en el c&oacute;digo de la vista de la acci&oacute;n <code>index</code> que contiene la tabla que muestra los productos.</p>


<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;% title &quot;Products&quot; %&gt;

&lt;table class=&quot;pretty&quot;&gt;
  &lt;tr&gt;
    &lt;th&gt;Name&lt;/th&gt;
    &lt;th&gt;Price&lt;/th&gt;
    &lt;th&gt;Released&lt;/th&gt;
  &lt;/tr&gt;
  &lt;% for product in @products %&gt;
  &lt;tr&gt;
    &lt;td&gt;&lt;%= product.name %&gt;&lt;/td&gt;
    &lt;td class=&quot;price&quot;&gt;&lt;%= number_to_currency(product.price, :unit =&gt; &quot;&amp;pound;&quot;) %&gt;&lt;/td&gt;
    &lt;td&gt;&lt;%= product.released_at.strftime(&quot;%B %e, %Y&quot;) %&gt;&lt;/td&gt;
  &lt;/tr&gt;
  &lt;% end %&gt;
&lt;/table&gt;

&lt;p&gt;&lt;%= link_to &quot;New Product&quot;, new_product_path %&gt;&lt;/p&gt;
</pre>

<p>Tendremos que hacer la mayor parte de los cambios en las celdas de la cabecera de la tabla.  Queremos que el texto de dichas  celdas sean enlaces para poder ordenar la tabla cuando se haga clic en ellos.  Para poder ver c&oacute;mo cambia el proceso seg&uacute;n avanzamos iremos dando peque&ntilde;os pasos haciendo s&oacute;lo lo m&iacute;nimo imprescindible en cada uno de ellos.</p>

<p>Lo primero que haremos ser&aacute; convertir en enlaces los textos del encabezado de la tabla, para lo que a&ntilde;adiremos un <code>link_to</code> antes del texto de cada cabecera (en TextMate esto puede hacerse r&aacute;pidamente pulsando la tecla &quot;opci&oacute;n&quot; y escogiendo las tres columnas al final de la etiqueta <code>&lt;th&gt;</code>, cualquier texto que escribamos aparecer&aacute; simult&aacute;neamente en las tres l&iacute;neas)  Queremos que los enlaces vayan a la misma p&aacute;gina pero con diferentes par&aacute;metros en la petici&oacute;n.  Esto lo podemos hacer especificando un <em>hash</em> como el segundo par&aacute;metro de <code>link_to</code>.</p>


<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;th&gt;&lt;%= link_to &quot;Name&quot;, :sort =&gt; &quot;name&quot; %&gt;&lt;/th&gt;
&lt;th&gt;&lt;%= link_to &quot;Price&quot;, :sort =&gt; &quot;price&quot; %&gt;&lt;/th&gt;
&lt;th&gt;&lt;%= link_to &quot;Released&quot;, :sort =&gt; &quot;released_at&quot; %&gt;&lt;/th&gt;
</pre>

<p>Cuando volvamos a cargar la p&aacute;gina de productos, en la cabecera de la tabla ahora aparecer&aacute;n los enlaces y si ponemos el cursor encima de cada uno veremos que en la URL aparece el par&aacute;metro adecuado en la URL.</p>

<div class="imageWrapper">
  <img src="/system/photos/450/original/E228I02.png" width="800" height="526" alt="El texto del encabezamiento de cada columna es un enlace."/>
</div>

<h3>Ordenaci&oacute;n de los productos</h3>

<p>Tendremos que modificar la acci&oacute;n <code>index</code> del controlador <code>ProductController</code> para que la ordenaci&oacute;n se haga seg&uacute;n el par&aacute;metro recibido en la cadena de la petici&oacute;n.</p>


<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
def index
  @products = Product.order(params[:sort])
end
</pre>

<p>Para ordenar los productos vamos a usar el m&eacute;todo <code>order</code> de Rails 3.  Si estuvi&eacute;semos con una aplicaci&oacute;n Rails 2 podr&iacute;amos usar <code>find</code> con un <em>hash</em> que especificase el orden.  N&oacute;tese que estamos pasando directamente par&aacute;metros introducidos por el usuario hacia la cl&aacute;usula de ordenaci&oacute;n, esto es algo que no debe hacerse porque dicha entrada no ha sido saneada y por tanto hay peligro de inyecci&oacute;n de SQL (vimos este tema en el episodio 25 [<a href="http://railscasts.com/episodes/25-sql-injection">verlo</a>, <a href="http://asciicasts.com/episodes/25-sql-injection">leerlo</a>].)  Por ahora lo dejaremos tal cual y m&aacute;s adelante volveremos para corregir esto.</p>

<p>Con este c&oacute;digo la ordenaci&oacute;n funcionar&aacute; y la tabla aparecer&aacute; ordenada correctamente cuando hagamos clic en uno de los encabezados.</p>

<div class="imageWrapper">
  <img src="/system/photos/451/original/E228I03.png" width="800" height="526" alt="La tabla se ordena dependiendo de la columna en la que se haya hecho clic."/>
</div>

<h3>Cambio del sentido de la ordenaci&oacute;n</h3>

<p>Sin haber tenido que escribir mucho c&oacute;digo ya hemos avanzado bastante pero a&uacute;n nos quedan otras funcionalidades por a&ntilde;adir como por ejemplo ordenar las columnas al rev&eacute;s si se vuelve a hacer clic en el encabezamiento, y mostrar un icono con una flecha seg&uacute;n la ordenaci&oacute;n escogida.</p>

<p>Empezaremos con el cambio de sentido de la ordenaci&oacute;n, cuando se haga clic en el enlace de la columna de la tabla por la que estemos ordenando deber&iacute;amos ordenar por el mismo campo pero en el orden inverso.  Si hici&eacute;semos esto en la vista a&ntilde;adir&iacute;amos bastante l&oacute;gica y duplicaci&oacute;n, por lo que vamos a hacer una funci&oacute;n <em>helper</em> que genere cada enlace.</p>

<p>El nuevo <em>helper</em> se llamar&aacute; <code>sortable</code> y recibir&aacute; dos argumentos (el segundo ser&aacute; opcional).  El primer argumento ser&aacute; el nombre de la columna y el segundo ser&aacute; el texto de cabecera en caso de que sea diferente del nombre de la columna.  Por tanto, la cabecera de la tabla quedar&aacute; as&iacute;:</p>

<p class="codeFilePath">/app/views/products/index.html.erb</p>
<pre class="ruby">
&lt;tr&gt;
  &lt;th&gt;&lt;%= sortable &quot;name&quot; %&gt;&lt;/th&gt;
  &lt;th&gt;&lt;%= sortable &quot;price&quot; %&gt;&lt;/th&gt;
  &lt;th&gt;&lt;%= sortable &quot;released_at&quot;, &quot;Released&quot; %&gt;&lt;/th&gt;
&lt;/tr&gt;
</pre>

<p>Escribamos ahora el m&eacute;todo <code>sortable</code> en el m&oacute;dulo <code>ApplicationHelper</code>.</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def sortable(column, title = nil)
    title ||= column.titleize
    direction = (column == params[:sort] &amp;&amp; params[:direction] == &quot;asc&quot;) ? &quot;desc&quot; : &quot;asc&quot;
    link_to title, :sort =&gt; column, :direction =&gt; direction
  end
end
</pre>

<p>El m&eacute;todo tiene los dos argumentos de los que habl&aacute;bamos antes, y el argumento <code>title</code> por defecto vale <code>nil</code> por lo que si no viene podemos darle valor bas&aacute;ndonos en el argumento <code>column</code>.  A continuaci&oacute;n tenemos la l&oacute;gica que determina cu&aacute;l es la direcci&oacute;n de ordenaci&oacute;n para el enlace.  Si la columna para la que estamos generando el enlace es la columna por la que ya estamos ordenando y el orden es ascendente entonces hacemos que la direcci&oacute;n sea <code>desc</code> para que la pr&oacute;xima vez que hagamos clic se ordene al rev&eacute;s.  En el resto de casos queremos que la direcci&oacute;n de ordenaci&oacute;n sea ascendente.  Con esto ya podemos a&ntilde;adir el criterio de ordenaci&oacute;n como par&aacute;metro al enlace.</p>

<p>Si recargamos la p&aacute;gina y hacemos clic en el enlace &ldquo;Name&rdquo; la tabla mostrar&aacute; la ordenaci&oacute;n por nombre en orden ascendente.  Si volvemos a hacer clic otra vez la URL cambia el par&aacute;metro <code>direction</code> a <code>desc</code> pero la tabla no se muestra en orden descendente.</p>

<div class="imageWrapper">
  <img src="/system/photos/452/original/E228I04.png" width="800" height="519" alt="El sentido de la ordenación en la cadena de la petición."/>
</div>

<p>Nuestro controlador est&aacute; ignorando el par&aacute;metro que indica el sentido de ordenaci&oacute;n.  Para corregir esto s&oacute;lo tenemos que a&ntilde;adir dicho par&aacute;metro al m&eacute;todo <code>order</code> cuando recuperamos todos los productos en la acci&oacute;n <code>index</code> del controlador <code>ProductController</code>.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
def index
  @products = Product.order(params[:sort] + &#x27; &#x27; + params[:direction])
end
</pre>

<p>Nuevamente estamos pasando directamente a una consulta los par&aacute;metros introducidos por el usuario, lo que no es seguro, pero ya arreglaremos esto m&aacute;s adelante.  Cuando recarguemos la p&aacute;gina ya veremos que los &iacute;tems se ordenan correctamente y podemos hacer clic en cualquiera de las columnas para ordenarla en orden ascendente o descendente.</p>

<div class="imageWrapper">
  <img src="/system/photos/453/original/E228I05.png" width="800" height="519" alt="Ya podemos ordenar en ambas direcciones"/>
</div>

<h3>Valores por defecto</h3>

<p>Aunque la tabla ya parece funcionar, si tratamos de ir directamente a la p&aacute;gina de productos sin pasar par&aacute;metros por la URL veremos que nos da un error porque el c&oacute;digo del controlador trata de leer los valores de los parametros directamente de la cadena de la petici&oacute;n.  El error aparece al intentar unir ambos par&aacute;metros en una &uacute;nica cadena porque ambos son <code>nil</code> . </p>

<p>Tenemos que establecer algunos valores por defecto en los par&aacute;metros <code>sort</code> y <code>direction</code>  Podemos modificar directamente el <em>hash</em> de  <code>params</code> y establecer ambos par&aacute;metros si no vienen en la petici&oacute;n, pero en vez de eso vamos a escribir dos m&eacute;todos en el controlador que devolver&aacute;n el par&aacute;metro o un valor por defecto y luego usaremos estos m&eacute;todos para construir el argumento de ordenaci&oacute;n.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
class ProductsController &lt; ApplicationController
  helper_method :sort_column, :sort_direction
  def index
    @products = Product.order(sort_column + &#x27; &#x27; + sort_direction)
  end
  
  private
  def sort_column
    params[:sort] || &quot;name&quot;
  end
  
  def sort_direction
    params[:direction] || &quot;asc&quot;
  end
end
</pre>
<p>Estos m&eacute;todos tienen que estar disponibles en <code>ApplicationHelper</code> para que puedan ser usados desde el m&eacute;todo  <code>sortable</code> que escribimos antes:</p>

<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def sortable(column, title = nil)
    title ||= column.titleize
    direction = (column == sort_column &amp;&amp; sort_direction == &quot;asc&quot;) ? &quot;desc&quot; : &quot;asc&quot;
    link_to title, :sort =&gt; column, :direction =&gt; direction
  end
end
</pre>

<p>Si visitamos otra vez la p&aacute;gina de productos sin especificar par&aacute;metros la p&aacute;gina utilizar&aacute; la ordenaci&oacute;n por defecto: el nombre de producto en orden ascendente.  Si hacemos clic en el enlace &ldquo;Name&rdquo; la lista se ordenar&aacute; en sentido descendente, como ser&iacute;a de esperar.</p>
  
<div class="imageWrapper">
  <img src="/system/photos/454/original/E228I06.png" width="800" height="517" alt="A default sort order."/>
</div>

<h3>Asegurando la consulta</h3>

<p>Ya vimos antes que no es recomendable pasar datos introducidos por el usuario directamente a una consulta de base de datos (como por ejemplo la cl&aacute;usula de ordenaci&oacute;n) debido al peligro que supone  la inyecci&oacute;n SQL.  Para sanear la entrada podr&iacute;amos hacer un saneado gen&eacute;rico de los par&aacute;metros pero en vez de eso adoptaremos un enfoque m&aacute;s estricto.</p>

<p>Como ya tenemos m&eacute;todos de acceso a la columna y sentido de la ordenaci&oacute;n podemos a&ntilde;adir c&oacute;digo en estos m&eacute;todos que garantice que los valores pasados sean seguros y v&aacute;lidos.  El sentido de la ordenaci&oacute;n s&oacute;lo puede adoptar dos valores, por lo que podemos comprobar si el par&aacute;metro recibido se corresponde con uno de ellos y si no, establecer  por defecto el valor <code>asc</code>.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
def sort_direction
  %w[asc desc].include?(params[:direction]) ?  params[:direction] : &quot;asc&quot;
end
</pre>

<p>Podemos hacer algo muy parecido en el m&eacute;todo <code>sort_column</code> para asegurarnos de que el par&aacute;metro de ordenaci&oacute;n se correspondente con alguno de los campos del modulo de producto, devolviendo &ldquo;name&rdquo; en caso contrario.</p>

<p class="codeFilePath">/app/controllers/products_controller.rb</p>
<pre class="ruby">
def sort_column
  Product.column_names.include?(params[:sort]) ? params[:sort] : &quot;name&quot;
end
</pre>

<p>Podr&iacute;amos incluso ser todav&iacute;a m&aacute;s estrictos y restringir la ordenaci&oacute;n s&oacute;lo a ciertas columnas en la tabla, pero con esto nos bastar&aacute; por ahora.</p>

<h3>Mostrar el campo de ordenaci&oacute;n escogido</h3>

<p>Acabaremos este episodio a&ntilde;adiendo un icono delante del campo por el que estemos ordenando en un momento dado para que indique la direcci&oacute;n en la cual se est&aacute; realizando la ordenaci&oacute;n.  Podemos hacer esto con CSS pero primero tenemos que hacer algunos ajustes en el m&eacute;todo <code>sortable</code> para que a&ntilde;ada una clase al enlace en la celda de la cabecera en el campo de ordenaci&oacute;n actual.</p>


<p class="codeFilePath">/app/helpers/application_helper.rb</p>
<pre class="ruby">
module ApplicationHelper
  def sortable(column, title = nil)
    title ||= column.titleize
    css_class = (column == sort_column) ? &quot;current #{sort_direction}&quot; : nil
    direction = (column == sort_column &amp;&amp; sort_direction == &quot;asc&quot;) ? &quot;desc&quot; : &quot;asc&quot;
    link_to title, {:sort =&gt; column, :direction =&gt; direction}, {:class =&gt; css_class}
  end
end
</pre>

<p>En el m&eacute;todo hemos a&ntilde;adido la variable <code>css_class</code>.  Si la columna actual es por la que estamos ordenando dicha variable valdr&aacute; o bien <code>current asc</code> o bien <code>current desc</code> dependiendo del sentido de la ordenaci&oacute;n (en caso contrario su valor ser&aacute; <code>nil</code>).</p>

<p>Podemos a&ntilde;adir el atributo <code>class</code> en el c&oacute;digo que genera el enlace, pero debemos recordar que tendremos que separar los par&aacute;metros en dos <em>hashes</em> diferentes para que el atributo de clase no sea pasado como par&aacute;metro en la URL de la etiqueta.</p>

<p>Ya tenemos listas dos im&aacute;genes que ser&aacute;n las que usaremos en el directorio 
 <code>/public/images</code> de nuestra aplicaci&oacute;n, por lo que s&oacute;lo nos queda a&ntilde;adir algo de CSS en la hoja de estilos de la aplicaci&oacute;n para mostrar la imagen correcta.</p>

<p class="codeFilePath">/public/stylesheets/application.css</p>
<pre class="css">
.pretty th .current {
  padding-right: 12px;
  background-repeat: no-repeat;
  background-position: right center;
}
.pretty th .asc { 
  background-image: url(/images/up_arrow.gif); 
}

.pretty th .desc { 
  background-image: url(/images/down_arrow.gif); 
}
</pre>

<p>Si reordenamos la tabla, la columna por la que se estar&aacute; ordenando dicha tabla tendr&aacute; una flecha para indicar que es la columna de ordenaci&oacute;n.</p>

<div class="imageWrapper">
  <img src="/system/photos/455/original/E228I07.png" width="800" height="530" alt="La fecha muestra la columna y el sentido de la ordenación"/>
</div>

<p>Con esto terminamos este episodio.  Ya tenemos lo que quer&iacute;amos: una tabla que podemos ordenar por cualquiera de sus columnas y que muestra un indicador de cu&aacute;l es la columna por la que estamos ordenando.</p>
