<p>Esta semana tenemos un episodio un poco diferente.  Vamos a bucear en la implementaci&oacute;n de Rails 3 para echar un vistazo a parte de su c&oacute;digo, concretamente el c&oacute;digo que se encarga del enrutamiento.  A continuaci&oacute;n se muestra el fichero de rutas de la aplicaci&oacute;n de tienda del &uacute;ltimo episodio.  Veremos el c&oacute;digo real de Rails que se ejecuta para comprender su funcionamiento con todo detalle.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  resources :products do
    resources :reviews
  end
  root :to =&gt; &quot;products#index&quot;
end
</pre>

<p>Cabr&iacute;a preguntarse si tiene sentido esto de leer el c&oacute;digo ajeno, pero en nuestra opini&oacute;n leer c&oacute;digo escrito por otros es una magn&iacute;fica manera de mejorar nuestro nivel de Ruby.   Veremos trucos y t&eacute;cnicas usadas por otros que aprenderemos a usar en nuestro propio c&oacute;digo.  Adem&aacute;s, leer el c&oacute;digo fuente de Rails tambi&eacute;n nos servir&aacute; para aprender a hacer un mejor uso de Rails, en este caso veremos formas de escribir mejor los archivos de rutas.  Nos ser&aacute; tambi&eacute;n &uacute;til si alg&uacute;n d&iacute;a intentamos depurar un problema u optimizar nuestro c&oacute;digo o incluso si consideramos colaborar alg&uacute;n d&iacute;a con el desarrollo de Rails.</p>

<h3>Empezando</h3>

<p>En este episodio se asumir&aacute; que el lector conoce el funcionamiento de las rutas en Rails 3.  Si no es el caso, o como refresco, se puede visitar primero el episodio 203 [<a href="http://railscasts.com/episodes/203-routing-in-rails-3">verlo</a> or <a href="http://es.asciicasts.com/episodes/203-rutas-en-rails-3">leerlo</a>] porque la sintaxis de las rutas es distinta a la de Rails 2</p>

<p>El c&oacute;digo fuente de Rails est&aacute; alojado en <a href="http://github.com/rails/rails">Github</a> por lo que es muy f&aacute;cil clonar el repositorio para su estudio.  Tan s&oacute;lo tenemos que ejecutar</p>

<pre class="terminal">
$ git clone git://github.com/rails/rails.git
</pre>


<p>La rama maestra del repositorio que hemos descargado es la de Rails 3.1, que es la versi&oacute;n actualmente en desarrollo. Dado que queremos ver la misma versi&oacute;n de Rails que est&aacute; ejecutando nuestra aplicaci&oacute;n vamos a cambiar a la versi&oacute;n etiquetada como 3.0.0 ejecutando</p>


<pre class="terminal">
$ git checkout v3.0.0
</pre>

<p>Veremos que Rails est&aacute; compuesto de varios componentes separados.  Cualquier cosa que tenga que ver con los controladores, vistas y rutas se encontrar&aacute; alojada en el directorio <code>actionpack</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/472/original/E231I01.png" width="795" height="454" alt="La estructura de directorios del código fuente de Rails."/>
</div>

<p>Dentro de <code>actionpack</code> el c&oacute;digo relacionado con las rutas se encuentra en el directorio <code>lib/action_dispatch</code>.</p>

<div class="imageWrapper">
  <img src="/system/photos/473/original/E231I02.png?1284930544" width="796" height="540" alt="Estructura de directorio de actionpack mostrando los archivos de implementación de las rutas."/>
</div>

<h3>Los m&eacute;todos <code>routes</code> y <code>draw</code>.</h3>

<p>Antes de empezar a leer el c&oacute;digo de Rails volvamos a nuestra aplicaci&oacute;n y repasemos una vez m&aacute;s el fichero de rutas.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  resources :products do
    resources :reviews
  end
  root :to =&gt; &quot;products#index&quot;
end
</pre>


<p>La primera l&iacute;nea de c&oacute;digo invoca el m&eacute;todo <code>routes</code> sobre <code>Store::Application</code>, donde <code>Store</code> es el nombre de la aplicaci&oacute;n. En el archivo <code>application.rb</code> podremos ver que es ah&iacute; donde se define el nombre de la aplicaci&oacute;n.</p>

<p class="codeFilePath">/config/application.rb</p>
<pre class="ruby">
require File.expand_path(&#x27;../boot&#x27;, __FILE__)

require &#x27;rails/all&#x27;

# If you have a Gemfile, require the gems listed there, including any gems
# you&#x27;ve limited to :test, :development, or :production.
Bundler.require(:default, Rails.env) if defined?(Bundler)

module Store
  class Application &lt; Rails::Application
     # Configure sensitive parameters which will be filtered from the log file.
    config.filter_parameters += [:password]
  end
end
</pre>

<p>En la clase <code>Store::Application</code> es donde tiene lugar la mayor parte de la configuraci&oacute;n de la aplicaci&oacute;n y hereda de <code>Rails::Application</code>.  Cualquier cosa con el prefijo <code>Rails</code>  se encuentra por lo general definida en el directorio <code>railties</code> del c&oacute;digo fuente de Rails; el c&oacute;digo de la clase <code>Rails::Application</code> se encuentra en  <code>rails/railties/lib/rails/application.rb</code>, donde podremos encontra el m&eacute;todo <code>routes</code>.</p>

<p class="codeFilePath">rails/railties/lib/rails/application.rb</p>
<pre class="ruby">
def routes
  @routes ||= ActionDispatch::Routing::RouteSet.new
end
</pre>

<p>Este es el m&eacute;todo que se ejecuta desde el fichero de rutas de la aplicaci&oacute;n, y su &uacute;nica misi&oacute;n es crear un nuevo objeto  <code>ActionDispatch::Routing::RouteSet</code>.  El m&eacute;todo <code>routes</code> devuelve este  <code>RouteSet</code>, sobre el que se invocar&aacute; el m&eacute;todo <code>draw</code> en la primera l&iacute;nea de nuestro archivo de rutas.  Este m&eacute;todo se puede encontrar en la definici&oacute;n de la clase.  Por lo general en el c&oacute;digo fuente de Rails las clases se definen dentro de archivos que se llaman como la clase y <code>RouteSet</code> no es una excepci&oacute;n.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/route_set.rb</p>
<pre class="ruby">
def draw(&amp;block)
  clear! unless @disable_clear_and_finalize

  mapper = Mapper.new(self)
  if block.arity == 1
    mapper.instance_exec(DeprecatedMapper.new(self), &amp;block)
  else
    mapper.instance_exec(&amp;block)
  end

   finalize! unless @disable_clear_and_finalize

   nil
end
</pre>

<p>El m&eacute;todo <code>draw</code> recibe un bloque como argumento.  En primer lugar despeja cualquier ruta previamente existente y luego crea un nuevo objeto <code>Mapper</code> pas&aacute;ndole <code>self</code> (el <code>RouteSet</code>)  El m&eacute;todo luego comprueba el n&uacute;mero de argumentos del bloque, si recibe al menos uno entonces quiere decir que el fichero de rutas est&aacute; usando la sintaxis de Rails 2.  De esta forma la aplicaci&oacute;n puede funcionar tambi&eacute;n definiendo rutas al estilo de Rails 2, donde el bloque tomaba como argumento un par&aacute;metro <code>map</code>:</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do |map|
  # Rails 2 routes...
end
</pre>

<p>Independientemente de que nuestra aplicaci&oacute;n configure las rutas al estilo de Rails 2 o Rails 3 lo siguiente que se hace es llamar a <code>instance_exec</code>.  Si la aplicaci&oacute;n usa las rutas de Rails 2 se genera un objeto <code>DeprecatedMapper</code> para pas&aacute;rselo a <code>instance_exec</code>, mientras que si usa el estilo de rutas de Rails 3 se pasar&aacute; directamente el bloque.  <code>instance_exec</code> ejecutar&aacute; el bloque exactamente igual que si estuviera dentro de la instancia lo que significa que dentro de un fichero de rutas cualquier cosa que escribamos se ejecuta dentro de un objeto <code>Mapper</code>, que es la clase que implementa el c&oacute;modo lenguaje de rutas de Rails 3 donde podemos invocar a m&eacute;todos como <code>resources</code> sin tener que invocarlos sobre objetos espec&iacute;ficos como en Rails 2 (donde us&aacute;bamos <code>map.resources</code>).</p>

<p>La &uacute;ltimo que hace el m&eacute;todo <code>draw</code> es invocar el m&eacute;todo <code>finalize!</code> que se define un poco m&aacute;s adelante en la clase <code>RouteSet</code> para congelar el conjunto de rutas.</p>

<h3>C&oacute;mo se mapean las rutas</h3>


<p>Ahora que ya sabemos que todo lo que est&aacute; dentro del archivo de rutas de Rails 3 se ejecuta contra un objeto <code>Mapper</code> vamos a usar una ruta sencilla como ejemplo para ver c&oacute;mo es procesada.</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  match &#x27;products&#x27;, :to =&gt; &#x27;products#index&#x27;
end
</pre>

<p>Veamos lo que hace el m&eacute;todo <code>match</code> de la clase <code>Mapper</code>.  Nos encontramos con varios m&eacute;todos llamados <code>match</code> en dicha clase; el que nos interesa se encuentra en el m&oacute;dulo <code>Base</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
module Base
  def initialize(set) #:nodoc:
    @set = set
  end

  def root(options = {})
    match &#x27;/&#x27;, options.reverse_merge(:as =&gt; :root)
  end

  def match(path, options=nil)
    mapping = Mapping.new(@set, @scope, path, options || {}).to_route
    @set.add_route(*mapping)
    self
  end

  # other methods

end
</pre>


<p>Para crear un nuevo objeto <code>Mapper</code> tenemos que pasar un <code>RouteSet</code>.  Cuando se invoca el m&eacute;todo <code>match</code> en el fichero de rutas para crear una nueva ruta dicha ruta se a&ntilde;ade al <code>RouteSet</code>, creando un nuevo objeto <code>Mapping</code> y luego ejecut&aacute;ndose <code>to_route</code> sobre &eacute;l.  N&oacute;tese tambi&eacute;n que el m&eacute;todo <code>root</code> es realmente sencillo, tan s&oacute;lo llama a <code>match</code> pasando la ra&iacute;z URL y a&ntilde;adiendo la opci&oacute;n <code>:as =&gt; :root</code> para que sea una ruta con nombre.</p> 
	
<p>Veamos a continuaci&oacute;n la clase <code>Mapping</code>, que est&aacute; contenido en el mismo fichero <code>mapper.rb</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
class Mapping #:nodoc:
  IGNORE_OPTIONS = [:to, :as, :via, :on, :constraints, :defaults, :only, :except, :anchor, :shallow, :shallow_path, :shallow_prefix]

  def initialize(set, scope, path, options)
    @set, @scope = set, scope
    @options = (@scope[:options] || {}).merge(options)
    @path = normalize_path(path)
    normalize_options!
  end

  def to_route
    [ app, conditions, requirements, defaults, @options[:as], @options[:anchor] ]
  end

  private 

  def normalize_options!
    path_without_format = @path.sub(/\(\.:format\)$/, &#x27;&#x27;)

    if using_match_shorthand?(path_without_format, @options)
      to_shorthand    = @options[:to].blank?
      @options[:to] ||= path_without_format[1..-1].sub(%r{/([^/]*)$}, &#x27;#\1&#x27;)
      @options[:as] ||= Mapper.normalize_name(path_without_format)
    end

    @options.merge!(default_controller_and_action(to_shorthand))
  end

  # other private methods omitted.

end
</pre>


<p>Algunas variables de instancia del <code>Mapper</code> se establecen en la inicializaci&oacute;n a partir de los par&aacute;metros recibidos, y luego se invoca a <code>normalize_options!</code>.  Este m&eacute;todo comprueba si estamos usando la sintaxis abreviada en la ruta y en el m&eacute;todo <code>using_match_shorthand?</code> nos encontramos con un truco interesante.  Hay una forma abreviada de definir acciones de controlador, donde basta con separar el nombre y la acci&oacute;n por una barra inclinada.</p>
<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
# match &quot;account/overview&quot;
def using_match_shorthand?(path, options)
  path &amp;&amp; options.except(:via, :anchor, :to, :as).empty? &amp;&amp; path =~ %r{^/[\w\/]+$}
end
</pre>


<p>Si hemos definido as&iacute; la ruta las opciones <code>:to</code> y <code>:as</code> se establecer&aacute;n autom&aacute;ticamente dependiendo del nombre de la URL.  Veamos esto en el archivo de rutas de nuestra aplicaci&oacute;n a&ntilde;adiendo otra ruta que utiliza esta sintaxis abreviada:</p>

<p class="codeFilePath">/config/routes.rb</p>
<pre class="ruby">
Store::Application.routes.draw do
  match &#x27;products&#x27;, :to =&gt; &#x27;products#index&#x27;
  match &#x27;products/recent&#x27;, :to =&gt; &#x27;products#recent&#x27;
end
</pre>

<p>Hemos pasado el par&aacute;metro &lt;cdoe&gt;:to&lt;/cdoe&gt; a esta nueva ruta pero si lo omitimos ser&aacute; asignado autom&aacute;ticamente.  El m&eacute;todo adem&aacute;s tambi&eacute;n a&ntilde;adir&aacute; el par&aacute;metro <code>:as</code> como si hubi&eacute;semos escrito <code>:as =&gt; products_recent</code>.</p>

<h3>C&oacute;mo se usa Rack en las rutas</h3>

<p>En el m&eacute;todo <code>match</code>, una vez que hemos creado un nuevo objeto <code>Mapping</code> invocamos al m&eacute;todo <code>to_route</code> sobre &eacute;l.  Este m&eacute;todo devuelve un <em>array</em> de opciones que son las que se utilizan para crear la nueva ruta.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def to_route
  [ app, conditions, requirements, defaults, @options[:as], @options[:anchor] ]
end
</pre>

<p>Los primeros cuatro elementos del <em>array</em> son valores recibidos de llamadas a m&eacute;todos en la clase <code>Mapper</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def app
  Constraints.new(
    to.respond_to?(:call) ? to : Routing::RouteSet::Dispatcher.new(:defaults =&gt; defaults),
    blocks,
    @set.request_class
  )
end

def conditions
  { :path_info =&gt; @path }.merge(constraints).merge(request_method_condition)
end

def requirements
  @requirements ||= (@options[:constraints].is_a?(Hash) ? @options[:constraints] : {}).tap do |requirements|
    requirements.reverse_merge!(@scope[:constraints]) if @scope[:constraints]
    @options.each { |k, v| requirements[k] = v if v.is_a?(Regexp) }
   end
end

def defaults
  @defaults ||= (@options[:defaults] || {}).tap do |defaults|
    defaults.reverse_merge!(@scope[:defaults]) if @scope[:defaults]
    @options.each { |k, v| defaults[k] = v unless v.is_a?(Regexp) || IGNORE_OPTIONS.include?(k.to_sym) }
  end
end
</pre>

<p>La primera opci&oacute;n es <code>app</code>, y cuando veamos en el c&oacute;digo fuente de Rails algo llamado <code>app</code> es muy probable que se refiera a una aplicaci&oacute;n Rack.  Este m&eacute;todo <code>app</code> devuelve un nuevo objeto <code>Constraints</code>, as&iacute; que veamos si se trata de una aplicaci&oacute;n Rack. La clase <code>Constraints</code> est&aacute; definida en el mismo archivo <code>mapper.rb</code>.  Recibe varios m&eacute;todos, uno de los cuales se llama <code>call</code> y recibe como par&aacute;metro un entorno.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def call(env)
  req = @request.new(env)

  @constraints.each { |constraint|
    if constraint.respond_to?(:matches?) &amp;&amp; !constraint.matches?(req)
      return [ 404, {&#x27;X-Cascade&#x27; =&gt; &#x27;pass&#x27;}, [] ]
    elsif constraint.respond_to?(:call) &amp;&amp; !constraint.call(*constraint_args(constraint, req))
      return [ 404, {&#x27;X-Cascade&#x27; =&gt; &#x27;pass&#x27;}, [] ]
    end
  }

  @app.call(env)
end
</pre>


<p>La clase <code>Constraints</code> desde luego tiene toda la pinta de ser una aplicaci&oacute;n Rack.  Como detalle interesante esta clase redefine el m&eacute;todo <code>self.new</code> y cabe preguntarse por qu&eacute; lo hace as&iacute; si ya tiene su propio m&eacute;todo <code>initialize</code>.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def self.new(app, constraints, request = Rack::Request)
  if constraints.any?
    super(app, constraints, request)
  else
    app
  end
end

attr_reader :app

def initialize(app, constraints, request)
  @app, @constraints, @request = app, constraints, request
end
</pre>


<p>El motivo es el rendimiento.  <code>Constraints</code> es un <em>middleware</em> de Rack, o lo que es lo mismo, es un envoltorio de otra aplicaci&oacute;n Rack.  El primer argumento que recibe <code>self.new</code> es <code>app</code>, que es una aplicaci&oacute;n Rack y cuando se invoca el m&eacute;todo <code>call</code> si se cumple cualquiera de las restricciones devolver&aacute; un <code>404</code> y en otro caso invocar&aacute; a la aplicaci&oacute;n Rack que est&aacute; envolviendo.  El m&eacute;todo <code>self.new</code> es un peque&ntilde;o truco de rendimiento para que cuando se llame no sea necesario reservar espacio para otro objeto en memoria, envolverlo y utilizarlo, en su lugar simplemente devolver&aacute; la misma aplicaci&oacute;n inicial Rack.</p>

<p>Volvamos al c&oacute;digo que invoca esto.  N&oacute;tese que los dos primeros argumentos son una aplicaci&oacute;n Rack y un <em>array</em> de restricciones, y se le llama desde el m&eacute;todo <code>app</code> de la clase <code>Mapping</code>.  Cuando se crea una nueva restricci&oacute;n simplemente tenemos que ver si el m&eacute;todo responde a <code>call</code> (el m&eacute;todo <code>to</code> simplemente devuelve la opci&oacute;n <code>:to</code> que se defini&oacute; para la ruta) si lo hace entonces es una aplicaci&oacute;n Rack y podemos pasarla directamente, de lo contrario creo un nuevo objeto <code>RouteSet::Dispatcher</code> con ciertas opciones por defecto.</p>

<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/mapper.rb</p>
<pre class="ruby">
def app
  Constraints.new(
    to.respond_to?(:call) ? to : Routing::RouteSet::Dispatcher.new(:defaults =&gt; defaults),
    blocks,
    @set.request_class
  )
end
</pre>


<p>Este es el c&oacute;digo que nos permite poder pasar una aplicaci&oacute;n Rack a una ruta de esta manera:</p>

<pre class="ruby">
&nbsp;&nbsp;root&nbsp;:to&nbsp;=&gt;&nbsp;proc&nbsp;{&nbsp;|env|&nbsp;[200,&nbsp;{},&nbsp;[&quot;Welcome&quot;]]&nbsp;}
</pre>

<p>Poder usar Rack en combinaci&oacute;n con las rutas de Rails nos da una gran flexibilidad, se trata este tema en m&aacute;s profundidad en el episodio 222
 [<a href="http://railscasts.com/episodes/222-rack-in-rails-3">verlo</a>, <a href="http://es.asciicasts.com/episodes/222-rack-y-rails-3">leerlo</a>]. </p>

<p>Si no le pasamos una aplicaci&oacute;n Rack a la opci&oacute;n <code>:to</code> se crear&aacute; un nuevo objeto de tipo <code>RouteSet::Dispatcher</code>.  A continuaci&oacute;n veremos c&oacute;mo se gestiona esto.</p>

<p>La clase <code>Dispatcher</code> gestiona el paso de la petici&oacute;n al controlador adecuado.  En el m&eacute;todo <code>controller_reference</code> se puede ver el c&oacute;digo donde se determina cu&aacute;l es dicho controlador.</p>
 
<p class="codeFilePath">rails/actionpack/lib/action_dispatch/routing/route_set.rb</p>
<pre class="ruby">
def controller_reference(controller_param)
  unless controller = @controllers[controller_param]
    controller_name = &quot;#{controller_param.camelize}Controller&quot;
    controller = @controllers[controller_param] =
       ActiveSupport::Dependencies.ref(controller_name)
  end
  controller.get
end
</pre>

<p>La clase tambi&eacute;n tiene m&eacute;todos para hacer cosas como establecer la acci&oacute;n <code>index</code> por defecto y un m&eacute;todo <code>dispatch</code> que llama a la acci&oacute;n propiamente dicha y que devuelve una aplicaci&oacute;n Rack.  Esto significa que podemos coger cualquiera de los controladores de nuestra aplicaci&oacute;n e invocar <code>action</code> sobre &eacute;l pas&aacute;ndole el nombre de la acci&oacute;n que queramos y obtendremos de vuelta una aplicaci&oacute;n Rack.</p>

<pre class="terminal">
ruby-1.9.2-p0 &gt; ProductsController.action(&quot;index&quot;)
 =&gt; #&lt;Proc:0x00000100ec56c0@/Users/eifion/.rvm/gems/ruby-1.9.2-p0/gems/actionpack-3.0.0/lib/action_controller/metal.rb:172&gt;
</pre> 

<p>Esto es lo que ocurre entre bambalinas cuando pasamos una ruta como esta</p>

<pre class="ruby">
match &#x27;products&#x27;, :to =&gt; &#x27;products#index&#x27;
</pre>

<p>La cadena <code>products#index</code> se transforma en <code>ProductsController.action(&quot;index&quot;)</code>, lo que devuelve una aplicaci&oacute;n Rack.  La sintaxis de la cadena es un simple atajo de hacer lo mismo.</p>

<p>Hay mucha m&aacute;s que tratar acerca de las rutas que podr&iacute;amos repasar: los m&eacute;todos <code>resources</code> que generan varias rutas de una vez, los m&eacute;todos que nos permiten definiri &aacute;mbitos y pasarles bloques... esperamos que eso sea suficiente para servir de acicate para leer el c&oacute;digo de las rutas.</p>

<p>Las rutas probablemente sean una de las &aacute;reas m&aacute;s complejas de Rails, por lo que si nos intimida la complejidad del c&oacute;digo visto aqu&iacute; no hay que preocuparse: es un c&oacute;digo dif&iacute;cil.  Es recomendable empezar primero por otras partes del c&oacute;digo de Rails antes de enfrentarse a las partes m&aacute;s complejas.</p>